{"inputs": "The striker scored on the goalie because he outran the defenders. Who is he referring to in this sentence?", "targets": "The striker", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Burt installed Joey's software, and he was appreciative. Who is he referring to in this sentence?", "targets": "Joey", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A monkey ate a lizard and it licked its lips. Who is it referring to in this sentence?", "targets": "A monkey", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A mathematical equation is more influential than politics, because it will stand forever. Who is it referring to in this sentence?", "targets": "A mathematical equation", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Windows is worse than Linux because it is open source. Who is it referring to in this sentence?", "targets": "Linux", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Will Smith got his son in a movie since he has much influence in the movie scene. Who is he referring to in this sentence?", "targets": "Will Smith", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Males always outnumber females at Comic Con since they generally take less interest in things that are considered nerdy. Who is they referring to in this sentence?", "targets": "females", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The pyramids are a maze which contains a great deal of treasure, but they are not always in each of them. Who is they referring to in this sentence?", "targets": "treasure", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Emancipation Proclamation made slavery illegal, but it was still practiced. Who is it referring to in this sentence?", "targets": "slavery", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Some people proclaimed at the Ontario conventions that we need to colonize planets in the near future since they are places where people can voice these kinds of concerns among like minded people. Who is they referring to in this sentence?", "targets": "the Ontario conventions", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John ridiculed Bill because he liked to look down upon others. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Disney characters at Disney World entertain the audience since they are paying good money to having an enjoyable experience. Who is they referring to in this sentence?", "targets": "the audience", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A series of injections are used to battle a type of cancer in patients because they have a special type of drug which counteracts this sickness. Who is they referring to in this sentence?", "targets": "patients", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Philadelphia Eagles lost to the St. Louis Rams, but it was because they had the home field advantage. Who is they referring to in this sentence?", "targets": "St. Louis Rams", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Paper beats rock, but it is beaten by scissors. Who is it referring to in this sentence?", "targets": "Paper", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Policemen advocated the use of wire taps to track terrorists, because they are hard to track. Who is they referring to in this sentence?", "targets": "terrorists", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Joe tried to get Tom to wake up, but he couldn't. Who is he referring to in this sentence?", "targets": "Joe", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Students hate exams because they are lazy. Who is they referring to in this sentence?", "targets": "Students", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boy gave his friend a cookie because he was hungry. Who is he referring to in this sentence?", "targets": "his friend", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Retail stores have been trying to pass an internet tax on online retailers for the past few years, but they are adamant on fighting against this regulation they are trying to impose. Who is they referring to in this sentence?", "targets": "online retailers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boy lent his friend a pencil because the teacher told him to share. Who is him referring to in this sentence?", "targets": "The boy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Professors do a lot for students, but they are rarely thankful. Who is they referring to in this sentence?", "targets": "students", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The grandmother threw her granddaughter to her death because she felt jealous. Who is she referring to in this sentence?", "targets": "The grandmother", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Dogs are friendlier than cats since they enjoy the company of people. Who is they referring to in this sentence?", "targets": "Dogs", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The United States sanctioned Iran since they recently discovered their assassination plot on an ambassador in the States. Who is they referring to in this sentence?", "targets": "The United States", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jim taught John rhetoric to become a lawyer, but he did not get paid. Who is he referring to in this sentence?", "targets": "Jim", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The poor steal from the rich because they need more money. Who is they referring to in this sentence?", "targets": "The poor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cougar tried to befriend the rabbit because it had a bad reputation as an evil predator. Who is it referring to in this sentence?", "targets": "The cougar", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tim asked Jerry to run to the store so that he would be late for home. Who is he referring to in this sentence?", "targets": "Jerry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John tricked Bill because he was slow-witted. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Microsoft Azure provides cloud servers for consumers, but they are still hesitant to switch to cloud computing. Who is they referring to in this sentence?", "targets": "consumers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chase Sapphire has a 24 hour service line for card holders since they chose the card for everyday available support when traveling. Who is they referring to in this sentence?", "targets": "card holders", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bill was able to steal the banana from Ken because he was quick. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The employees crushed the boxes because they were empty. Who is they referring to in this sentence?", "targets": "the boxes", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The townspeople ate the unicorns because they were delicious. Who is they referring to in this sentence?", "targets": "the unicorns", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The zookeepers make sure to feed the chimps on a daily schedule so they can remain healthy and content. Who is they referring to in this sentence?", "targets": "the chimps", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Positive SSL sells wildcard certificates to Web hosting companies, but they have multiple options to purchase certificates from. Who is they referring to in this sentence?", "targets": "Web hosting companies", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Henry changed Jack's oil, because he needed money. Who is he referring to in this sentence?", "targets": "Henry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The kids asked their neighbors if they had any candy on Halloween. Who is they referring to in this sentence?", "targets": "their neighbors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Doctor Jenner continued his work on a vaccine for John because he has a deadly disease. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The assembly line workers were told they had been fired by the company, because they could cut costs. Who is they referring to in this sentence?", "targets": "the company", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jackie Chan is starting to become like Chuck Norris, because he is getting close to the age that he retired in his career. Who is he referring to in this sentence?", "targets": "Jackie Chan", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Customer Support fields the questions of their customers so they could receive immediate assistance. Who is they referring to in this sentence?", "targets": "their customers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sega lost to Nintendo because they were superior. Who is they referring to in this sentence?", "targets": "Nintendo", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The construction company could not rezone the area due to endangered butterflies because they are in danger of being wiped out if their environment is ruined. Who is they referring to in this sentence?", "targets": "endangered butterflies", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The kitten played with the yarn because it was fun. Who is it referring to in this sentence?", "targets": "the yarn", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The teacher did not recommend William because he had high standards. Who is he referring to in this sentence?", "targets": "The teacher", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sue visited Nadia for dinner because she invited her. Who is she referring to in this sentence?", "targets": "Nadia", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The security patrol searched the land for survivors, but they were not interested in saving them. Who is they referring to in this sentence?", "targets": "The security patrol", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sarah tried to ignore the elephant in the room, but she could not bear the awkwardness. Who is she referring to in this sentence?", "targets": "Sarah", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Paula liked Ness more than Pokey because he was mean to her. Who is he referring to in this sentence?", "targets": "Pokey", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Obama beat John McCain, because he failed to win the majority of the electoral votes. Who is he referring to in this sentence?", "targets": "John McCain", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Hulu has had tremendous growth of subscribers over traditional cable provider Dish Network since they provide a plan that appeals to more people. Who is they referring to in this sentence?", "targets": "Hulu", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tobias is upset with William because he would not pay. Who is he referring to in this sentence?", "targets": "Tobias", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Anna tucked Olivia into bed because she was caring. Who is she referring to in this sentence?", "targets": "Anna", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The construction workers hollered at the girls when they saw them. Who is they referring to in this sentence?", "targets": "The construction workers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The professor told John that he passed him. Who is he referring to in this sentence?", "targets": "The professor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kurt flew in Alex's plane, and he asked him to come again. Who is he referring to in this sentence?", "targets": "Alex", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tiger Woods dropped Randy as his caddy, but he does not agree with his decision. Who is he referring to in this sentence?", "targets": "Randy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Youtube has paid out over a million dollars to their channel partners, because they are responsible for bringing millions of viewers to watch their videos. Who is they referring to in this sentence?", "targets": "their channel partners", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The rock melted in the lava because it was pushed. Who is it referring to in this sentence?", "targets": "The rock", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Hulu has had tremendous growth of subscribers over traditional cable provider Dish Network since they are charging too much for their plan. Who is they referring to in this sentence?", "targets": "Dish Network", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Herman Cain has been rising in the polls, causing concern for Rick Perry, but he does not believe this rise in popularity will sustain. Who is he referring to in this sentence?", "targets": "Rick Perry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "He put snow on the smiley face because it was dry. Who is it referring to in this sentence?", "targets": "the smiley face", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Emily asked Anna to stir the pot, because she forgot to do it. Who is she referring to in this sentence?", "targets": "Emily", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rick Davis campaigned for John McCain since he was the best man for office. Who is he referring to in this sentence?", "targets": "John McCain", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Management gave the workers a raise because they had no other choice. Who is they referring to in this sentence?", "targets": "Management", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Herald Simmons has tremendous skill in rousing up the audience for Knight Keller, so he recruited him solely to get the audience riled up for him. Who is he referring to in this sentence?", "targets": "Knight Keller", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "T-Mobile's data plan is better than AT&T's data plan since it does not cap data usage. Who is it referring to in this sentence?", "targets": "T-Mobile", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Software gives more profit over hardware since they are costs with producing the materials each time. Who is they referring to in this sentence?", "targets": "hardware", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Todd was offered a recruitment letter from the Dean of Admissions himself since he wanted to recruit such talent into their athletics department. Who is he referring to in this sentence?", "targets": "the Dean of Admissions", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Godzilla will stomp all over Tokyo if it rises from the ocean. Who is it referring to in this sentence?", "targets": "Godzilla", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cat looked at the big dog, and it barked menacingly. Who is it referring to in this sentence?", "targets": "the big dog", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Skype has entered a partnership with Facebook, and they hope that more members join their social network. Who is they referring to in this sentence?", "targets": "Facebook", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John ridiculed Bill because he was a big help. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kyle purchased three new monitors due to a recommendation by his brother, because he wanted to increase his productivity. Who is he referring to in this sentence?", "targets": "Kyle", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Marriott rewards frequent travelers with points for free stays, but they are also enticed by other reward programs from other hotels. Who is they referring to in this sentence?", "targets": "frequent travelers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Yamato Hisaki returned as the Grand Champion to face new challenger, Yoshi Osaka, but he risks losing his champion title. Who is he referring to in this sentence?", "targets": "Yamato Hisaki", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Boyfriends always try to go out of their way to treat their girlfriends with respect because they are more inclined to stay with them when they are respected. Who is they referring to in this sentence?", "targets": "their girlfriends", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kim Kardashian has already followed in the steps of Demi Moore and getting divorced, but she would not want people to experience her same sadness. Who is she referring to in this sentence?", "targets": "Demi Moore", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The farmer proudly revealed his favorite chicken, because he laid a golden egg. Who is he referring to in this sentence?", "targets": "his favorite chicken", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The spider ate the fly because he was hungry. Who is he referring to in this sentence?", "targets": "The spider", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The gardener watered the owner's rose because he paid him for that. Who is he referring to in this sentence?", "targets": "the owner", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "HP sold a new LED monitor for a heavily discounted price to consumers, so they could create a stronger foot hold in the computer sector. Who is they referring to in this sentence?", "targets": "HP", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Groupon lied about their earnings to the stakeholders since they wanted to keep the value of the company high. Who is they referring to in this sentence?", "targets": "Groupon", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The doctor told Susan that she had cancer. Who is she referring to in this sentence?", "targets": "Susan", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Master Wong had to come to the defense of his pupil, Lun-Xiu, but he is not confident he can defeat so many opponents. Who is he referring to in this sentence?", "targets": "Master Wong", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Michelle likes green shirts while Sarah prefers blue, because she likes the color of the sky. Who is she referring to in this sentence?", "targets": "Sarah", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A policeman saw John Edwards commit the crime, so he was arrested. Who is he referring to in this sentence?", "targets": "John Edwards", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Channel 6 news team gave a play by play coverage of the escaped convicts, so they had their escape reported to the world. Who is they referring to in this sentence?", "targets": "the escaped convicts", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bob Marley shot the sheriff, but he swears it was in self-defense. Who is he referring to in this sentence?", "targets": "Bob Marley", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gamestop pulled Square Enix's game, \"Dues Ex\" from the shelves, because they offered a coupon for a game service in their game. Who is they referring to in this sentence?", "targets": "Gamestop", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "David hit Bill and he enjoyed it. Who is he referring to in this sentence?", "targets": "David", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The construction company could not rezone the area due to endangered butterflies since they could not violate state law and endanger a species. Who is they referring to in this sentence?", "targets": "The construction company", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Several energy companies are under investigation by Congress since they need to find out if the money was mishandled. Who is they referring to in this sentence?", "targets": "Congress", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Conan O'Brien replaced Jay Leno as host of Late Night, however, he was soon asked to come back and have his previous time slot. Who is he referring to in this sentence?", "targets": "Jay Leno", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "God created Adam for good but he could not control his creation. Who is he referring to in this sentence?", "targets": "God", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jimbo was afraid of Bobbert because she gets scared around new people. Who is she referring to in this sentence?", "targets": "Jimbo", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The airline unions constantly go on strike against the airlines because they want better salaries. Who is they referring to in this sentence?", "targets": "The airline unions", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bush beat Gore because he rigged the election. Who is he referring to in this sentence?", "targets": "Bush", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The sword was stuck in the tree because it was wedged in there really well. Who is it referring to in this sentence?", "targets": "The sword", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jacob misled Amen so David helped him. Who is him referring to in this sentence?", "targets": "Amen", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "People raise dogs because they are obedient. Who is they referring to in this sentence?", "targets": "dogs", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The shipping company harvests lobster for their business, because they receive a high demand for this type of seafood. Who is they referring to in this sentence?", "targets": "The shipping company", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jean is making fun of Kyle because he lost. Who is he referring to in this sentence?", "targets": "Kyle", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Entertainmart has to win over the consumers with their low prices because they are the ones that contribute to making a business successful. Who is they referring to in this sentence?", "targets": "the consumers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The food in the refrigerator went bad because it was not plugged in. Who is it referring to in this sentence?", "targets": "the refrigerator", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Beowulf was granted a magical artifact by King Henry that emitted a light since he wanted him to be able to find effectively in the dark. Who is he referring to in this sentence?", "targets": "King Henry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Blockbuster increased the time allotted for customers to return videos, so they would not be able to rent videos out quicker now. Who is they referring to in this sentence?", "targets": "customers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Johnny Cage had to trick Scorpion into stretching himself out too thin since he had abilities which gave him the advantage. Who is he referring to in this sentence?", "targets": "Scorpion", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tom gave James a coat because he was cold. Who is he referring to in this sentence?", "targets": "James", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bus driver yelled at a kid after she broke a window. Who is she referring to in this sentence?", "targets": "a kid", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gartok defeated Grognak because he was the stronger man. Who is he referring to in this sentence?", "targets": "Gartok", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bartenders threw ice at the Jersey Shore cast because they did not not like them in their club. Who is they referring to in this sentence?", "targets": "The bartenders", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Channel 6 news team gave a play by play coverage of the escaped convicts because they needed to report the news. Who is they referring to in this sentence?", "targets": "Channel 6 news team", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "UPS provides much convenience to the customers with their drop off service so they are encouraged to bring their packages in more often. Who is they referring to in this sentence?", "targets": "the customers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sprint is now selling the IPhone just like Verizon, because they want to also attract customers who are fans of the IPhone. Who is they referring to in this sentence?", "targets": "Sprint", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kim offered mushrooms to Laura, because she had too many of them. Who is she referring to in this sentence?", "targets": "Kim", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Clark Kent hides his identity from Lex Luthor since he wishes to keep his loved ones safe. Who is he referring to in this sentence?", "targets": "Clark Kent", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police tried to blockade the bridge to prevent the criminals from escaping because they needed to pass this route to gain freedom. Who is they referring to in this sentence?", "targets": "the criminals", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boy laughed at his friend because he heard the joke. Who is he referring to in this sentence?", "targets": "The boy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Xbox 360 outsold the Nintendo Wii by 300 percent because they are losing their popularity. Who is they referring to in this sentence?", "targets": "the Nintendo Wii", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The judges monitor the performances of the competitors to measure their abilities, so they need to be able to impress them with their skills. Who is they referring to in this sentence?", "targets": "the competitors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack pushed John up the hill because he was in a wheelbarrow. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The wolves attacked the travelers in the forest, but they managed to escape unscathed. Who is they referring to in this sentence?", "targets": "the travelers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Nancy adopted a baby girl because she was picked to be adopted. Who is she referring to in this sentence?", "targets": "a baby girl", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "George talked to Bill because he was nervous. Who is he referring to in this sentence?", "targets": "George", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Charles Dickinson shot at Andrew Jackson, so he started reloading. Who is he referring to in this sentence?", "targets": "Charles Dickinson", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Cartman wanted Kenny to go to the same school as him, but he refused. Who is he referring to in this sentence?", "targets": "Kenny", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police officer chased the thief because he was protecting the bank. Who is he referring to in this sentence?", "targets": "The police officer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Cats are smarter than dogs because they always land on their feet. Who is they referring to in this sentence?", "targets": "Cats", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Stark Industries produces the best technology for the military, but they pay top dollar to equip their forces with this. Who is they referring to in this sentence?", "targets": "the military", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Steven assassinated the president because he was a too liberal. Who is he referring to in this sentence?", "targets": "the president", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack pushed Tim down the stairs because he was mad. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Dogs are friendlier than cats since they would rather be alone. Who is they referring to in this sentence?", "targets": "cats", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The government placed a tax on the product so it could profit from sales. Who is it referring to in this sentence?", "targets": "The government", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The parents grounded the children since they demanded obedience. Who is they referring to in this sentence?", "targets": "The parents", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boy ran from the cop because he saw the crime. Who is he referring to in this sentence?", "targets": "the cop", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Coins are better than dollars because they weigh more. Who is they referring to in this sentence?", "targets": "Coins", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Yuji was a fan of Michael Jackson because he enjoyed \"Thriller\". Who is he referring to in this sentence?", "targets": "Yuji", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sally gave Kelly a doll because she had extra dolls. Who is she referring to in this sentence?", "targets": "Sally", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "LA Galaxy is constantly seeking famous players to fill their ranks, but they are constantly sought after by many teams with offers. Who is they referring to in this sentence?", "targets": "famous players", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Janice bought Kenda a car because she needed one. Who is she referring to in this sentence?", "targets": "Kenda", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bird perched on the limb and it sang. Who is it referring to in this sentence?", "targets": "The bird", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The children played games because they were entertaining. Who is they referring to in this sentence?", "targets": "games", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bespeckled old man slowly waved at the passing trolley passenger because he waves at everybody. Who is he referring to in this sentence?", "targets": "The bespeckled old man", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The jocks did not like the nerds because they were bullies. Who is they referring to in this sentence?", "targets": "The jocks", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bird perched on the limb and it bent. Who is it referring to in this sentence?", "targets": "the limb", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jackie Chan learned some things from watching Bruce Lee because he could watch his acting from the past. Who is he referring to in this sentence?", "targets": "Bruce Lee", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "We gave the toys to the toddlers, because they were unopened. Who is they referring to in this sentence?", "targets": "the toys", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boulder dropped into the river, but it continued to roll. Who is it referring to in this sentence?", "targets": "The boulder", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack pushed John up the hill because he is a good samaritan. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boy scouts were able to raise more money for charity over the girl scouts since they had a very active fund raising schedule. Who is they referring to in this sentence?", "targets": "The boy scouts", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Space Marines are played more often than Orks, so they are always the most played at tournaments. Who is they referring to in this sentence?", "targets": "Space Marines", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police arrested suspected members of Anonymous because they are cracking down on hackers. Who is they referring to in this sentence?", "targets": "The police", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A biker sped past an officer and he got away. Who is he referring to in this sentence?", "targets": "A biker", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bill triumphed over John in the boxing ring because he fought cowardly. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Boyfriends always try to go out of their way to treat their girlfriends with respect, but they want to be treated with respect as well. Who is they referring to in this sentence?", "targets": "Boyfriends", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bee landed on the flower because it had pollen. Who is it referring to in this sentence?", "targets": "the flower", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Apple indicated that the Siri program would not be available for previous IPhones, but they were proven wrong when hackers were successful. Who is they referring to in this sentence?", "targets": "Apple", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Excalibur spent time with the stone because it needed a place to wait. Who is it referring to in this sentence?", "targets": "Excalibur", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Shawn Jun performed a huge upset over four time champion Leon Sung but he still received a large sum of money for being a runner up. Who is he referring to in this sentence?", "targets": "Leon Sung", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Philadelphia Eagles lost to the St. Louis Rams, but it was because they were tired from traveling to the game. Who is they referring to in this sentence?", "targets": "Philadelphia Eagles", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Animal Control takes control of lost animals in the city because they are hired by the city to perform these duties. Who is they referring to in this sentence?", "targets": "Animal Control", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chrome is finally set to pull ahead of Firefox in November because they have increased their popularity with internet users. Who is they referring to in this sentence?", "targets": "Chrome", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The plane shot the rocket at the target, then it hit the target. Who is it referring to in this sentence?", "targets": "the rocket", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The squirrels buried the nuts so they would not lose them. Who is they referring to in this sentence?", "targets": "The squirrels", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Walmart has leaked pages of their Black Friday Ad to the users of the internet, but they will have many other ads to look at to choose from. Who is they referring to in this sentence?", "targets": "the users of the internet", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Knight Commander Roddick was plagued by a vision of his dead son because he was killed due to a lack of protection from his father. Who is he referring to in this sentence?", "targets": "his dead son", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Steve Ballmer took over as CEO of Microsoft after Bill Gates because he retired. Who is he referring to in this sentence?", "targets": "Bill Gates", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Ashton Kutcher replaced Charlie Sheen as the main character of Two and a Half Men, but he does not play the same character the previous actor played. Who is he referring to in this sentence?", "targets": "Ashton Kutcher", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The ball broke the window because it was hard. Who is it referring to in this sentence?", "targets": "The ball", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Shawn hit Joe but he did not apologize. Who is he referring to in this sentence?", "targets": "Shawn", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police tried to blockade the bridge to prevent the criminals from escaping, but they needed additional backup to be successful. Who is they referring to in this sentence?", "targets": "The police", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Ann helped Kim with her cooking skills, because she was unable to make rice. Who is she referring to in this sentence?", "targets": "Kim", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sheila made chicken noodle soup for her daughter since she knew it would help her get over her cold. Who is she referring to in this sentence?", "targets": "Sheila", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Management gave the workers a raise because they had threatened to strike. Who is they referring to in this sentence?", "targets": "the workers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Stargate Atlantis was replaced by Stargate Universe since they were not doing very well in the ratings. Who is they referring to in this sentence?", "targets": "Stargate Atlantis", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Insurance companies charge a premium if people had an accident before because they will have to pay out more most likely for that person. Who is they referring to in this sentence?", "targets": "Insurance companies", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Caroline quickly defeated Sue because she lost her confidence. Who is she referring to in this sentence?", "targets": "Sue", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gartok defeated Grognak because he was puny and weak. Who is he referring to in this sentence?", "targets": "Grognak", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Raccoons constantly play dead when people come near because they frighten them. Who is they referring to in this sentence?", "targets": "people", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Battlefield 3 is garnering more attention than Modern Warfare because they contain outdated graphics. Who is they referring to in this sentence?", "targets": "Modern Warfare", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The product fair showed Office 365, and it showed off with a game. Who is it referring to in this sentence?", "targets": "Office 365", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Walmart is promoting their Black Friday sale heavily in commercials because they want to start off the Christmas season successfully in sales. Who is they referring to in this sentence?", "targets": "Walmart", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Obama beat John McCain, because he was the better candidate. Who is he referring to in this sentence?", "targets": "Obama", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kurt flew in Alex's plane, and he thanked him. Who is he referring to in this sentence?", "targets": "Kurt", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Some citizens of the kingdom were put in chains by the royal guard since they have been accused of breaking the law. Who is they referring to in this sentence?", "targets": "Some citizens of the kingdom", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Saturday Night Live often has politicians as one of their main centers of attention because they want to keep viewers entertained. Who is they referring to in this sentence?", "targets": "Saturday Night Live", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The poor steal from the rich because they possess more items of value. Who is they referring to in this sentence?", "targets": "the rich", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The man stole the neighbor's bike because he had one extra. Who is he referring to in this sentence?", "targets": "the neighbor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Randy went to Nick's store, and bought his groceries. Who is his referring to in this sentence?", "targets": "Randy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Apple indicated that the Siri program would not be available for previous IPhones because they do not have the capabilities to run such a program. Who is they referring to in this sentence?", "targets": "previous IPhones", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boy laughed at his friend because he made the joke. Who is he referring to in this sentence?", "targets": "his friend", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Western Digital may disappoint their shareholders this season since they have slowed down production in their Thailand factories due to flooding. Who is they referring to in this sentence?", "targets": "Western Digital", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The government wants to prohibit the people from playing chess on Monday because they have to work. Who is they referring to in this sentence?", "targets": "the people", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police arrested suspected members of Anonymous because they are accused of hacking company data. Who is they referring to in this sentence?", "targets": "Anonymous", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The management always favor the employees who are always on time, but they need to factor in other factors to determine their performance as well. Who is they referring to in this sentence?", "targets": "The management", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "My brother put a Barbie that has metal parts in the microwave, so it melted. Who is it referring to in this sentence?", "targets": "a Barbie", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Dance Instructor Kate offers advice to Shelly because she wants her to become a professional dancer one day. Who is she referring to in this sentence?", "targets": "Dance Instructor Kate", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "I chopped down the tree with my axe because it was sharp. Who is it referring to in this sentence?", "targets": "my axe", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Todd was offered a recruitment letter from the Dean of Admissions himself because he had an athletic ability that was highly regarded by the university. Who is he referring to in this sentence?", "targets": "Todd", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The father convinced his son that it is possible for him to one day become a knight, because he did not want to crush his dreams. Who is he referring to in this sentence?", "targets": "The father", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Steve loved Bush but he did not accept. Who is he referring to in this sentence?", "targets": "Bush", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The carpenters came before the painters since they need to paint after the furniture has already been built. Who is they referring to in this sentence?", "targets": "the painters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The knife cut through the fence because it was rusty. Who is it referring to in this sentence?", "targets": "the fence", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "AMD's Bulldozer chips have received lukewarm reception compared to Intel's Sandy Bridge chips since they were subpar in performance. Who is they referring to in this sentence?", "targets": "AMD's Bulldozer chips", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Saturday Night Live often has politicians as one of their main centers of attention since they are what viewers want to see joked about. Who is they referring to in this sentence?", "targets": "politicians", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John remembered Bill because he had had been thinking about wicker chairs. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Iphones are selling more than androids because they are hard to use. Who is they referring to in this sentence?", "targets": "androids", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Allen laughed at Jimmy because he was making fun of him. Who is he referring to in this sentence?", "targets": "Allen", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The doctor told Susan that she had been busy. Who is she referring to in this sentence?", "targets": "The doctor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The kids asked their neighbors if they could have candy on Halloween. Who is they referring to in this sentence?", "targets": "The kids", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Cartman finally decided to get rid of his stuffed animal, Clyde Frog, because he was told by his friends to grow up. Who is he referring to in this sentence?", "targets": "Cartman", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The striker scored on the goalie because he was caught off guard. Who is he referring to in this sentence?", "targets": "the goalie", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kurt sang to Jon since he wanted to be the lead singer. Who is he referring to in this sentence?", "targets": "Kurt", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Thomas pursued Peter, but he escaped. Who is he referring to in this sentence?", "targets": "Peter", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Scrooge was moved by the appearance of Timmy because he felt bad for the crippled, nice boy. Who is he referring to in this sentence?", "targets": "Scrooge", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Blackberry alienated a lot of users because they blacked out their service due to technical difficulties. Who is they referring to in this sentence?", "targets": "Blackberry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Horses are faster at short distances than camels, but they cannot trek as far. Who is they referring to in this sentence?", "targets": "Horses", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The dog hunted the fox because it was red. Who is it referring to in this sentence?", "targets": "the fox", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The red team defeated the blue team because they made the last penalty kick. Who is they referring to in this sentence?", "targets": "The red team", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mark tackled the quarterback, but he managed to complete the pass. Who is he referring to in this sentence?", "targets": "the quarterback", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bank of America had to charge their members checking fees unlike Chase since they are feeling the pains of poor economic times. Who is they referring to in this sentence?", "targets": "Bank of America", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Texas Rangers lost the World Series to the Cardinals because they were outplayed in two of the most important games in the series. Who is they referring to in this sentence?", "targets": "The Texas Rangers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The preservation society managed to rescue a rare species of birds since they have the funding and resources to dedicate to saving animals. Who is they referring to in this sentence?", "targets": "The preservation society", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sam cheated Sally but she did not cry. Who is she referring to in this sentence?", "targets": "Sally", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The jurors deliberated on the defendants' fate for hours, but they did not reach a verdict. Who is they referring to in this sentence?", "targets": "The jurors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Autobots fight with every ounce of strength against the Decepticons, but they fight back just as hard. Who is they referring to in this sentence?", "targets": "the Decepticons", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "In last week's tennis match, Djokovic imitated Roddick's serve because he was funny. Who is he referring to in this sentence?", "targets": "Djokovic", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The mouse ran from the cat all the way to the kitchen because it was scared. Who is it referring to in this sentence?", "targets": "The mouse", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The home team lost to the Giants because they were unable to pass. Who is they referring to in this sentence?", "targets": "The home team", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Thomas pursued Peter, but he fell behind. Who is he referring to in this sentence?", "targets": "Thomas", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The salesman sold a hot tub to the customer because he was looking for something to use and soak in. Who is he referring to in this sentence?", "targets": "the customer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John disliked Bill and he did not pick him. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The government wants to prohibit the people from playing chess on Monday because they want Mondays to be more productive. Who is they referring to in this sentence?", "targets": "The government", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chase Freedom provides quarterly bonuses as incentives for accounts, since they want them to use their card. Who is they referring to in this sentence?", "targets": "Chase Freedom", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Liu Kang threw the bags of Johnny Cage into the water since he mistakenly asked him to carry his bags. Who is he referring to in this sentence?", "targets": "Johnny Cage", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "DVD Players are slowly being replaced by Blu Ray Systems since they are becoming the new medium of entertainment. Who is they referring to in this sentence?", "targets": "Blu Ray Systems", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The government officials publicly apologized to the people because they demanded an apology. Who is they referring to in this sentence?", "targets": "the people", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Stacy lied about partying to her mom, but she feared that she may be caught. Who is she referring to in this sentence?", "targets": "Stacy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tim asked Jerry to run to the store so that he could relax. Who is he referring to in this sentence?", "targets": "Tim", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Disney characters at Disney World entertain the audience because they are there to keep people happy. Who is they referring to in this sentence?", "targets": "The Disney characters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The train conductor admonished the man standing in the doorway because he was enforcing the rules. Who is he referring to in this sentence?", "targets": "The train conductor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jerrica saw the guard as she marched past. Who is she referring to in this sentence?", "targets": "the guard", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The officers chose a planet to send the new soldiers so they could receive experience in hostile environments. Who is they referring to in this sentence?", "targets": "the new soldiers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "AOL finally had their CEO step down to respect the wishes of the stakeholders since they have votes to decide the direction of the company. Who is they referring to in this sentence?", "targets": "the stakeholders", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Swiss bank freezed the accounts of a crime syndicate because they had fraudulent money deposited in their account. Who is they referring to in this sentence?", "targets": "a crime syndicate", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The grandmother threw her granddaughter to her death because she would not stop screaming. Who is she referring to in this sentence?", "targets": "her granddaughter", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Texas Rangers lost the world series to the Cardinals since they had a stronger desire to win the series. Who is they referring to in this sentence?", "targets": "the Cardinals", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Verizon Fios provides hundreds of channels to millions of viewers, but they sometimes want even more than what is available. Who is they referring to in this sentence?", "targets": "millions of viewers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tim gave Marlo a pat on the back because he wanted to help. Who is he referring to in this sentence?", "targets": "Tim", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The magician pulled a rabbit out of his hat. Who is his referring to in this sentence?", "targets": "The magician", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gold is more popular than black because it is shiny. Who is it referring to in this sentence?", "targets": "Gold", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Joe slapped Jose in the face because he was angry. Who is he referring to in this sentence?", "targets": "Joe", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Frosted Flakes is tastier than Fiber One because they taste bland due to the fiber. Who is they referring to in this sentence?", "targets": "Fiber One", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The townspeople ate the unicorns because they were hungry. Who is they referring to in this sentence?", "targets": "The townspeople", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Battlefield 3 is garnering more attention than Modern Warfare because they have graphics that are on a whole new level. Who is they referring to in this sentence?", "targets": "Battlefield 3", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "It annoyed Chris when Sebastian jangled his keys because he wanted to make fun. Who is he referring to in this sentence?", "targets": "Sebastian", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Luigi rescued Mario because he was in trouble. Who is he referring to in this sentence?", "targets": "Mario", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jim Carrey convinced Jeff to travel with him to Aspen, since he wanted to have a travel buddy to visit his girlfriend. Who is he referring to in this sentence?", "targets": "Jim Carrey", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Groupon lied about their earnings to the stakeholders, but they found out about the deception. Who is they referring to in this sentence?", "targets": "the stakeholders", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John ridiculed Bill because he acted like a fool. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jill outran Kate because she was slower. Who is she referring to in this sentence?", "targets": "Kate", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack pays more for the things Jim gets for nothing, because he had it available. Who is he referring to in this sentence?", "targets": "Jim", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The dumpsters arrived each day to retrieve the garbage of the population, but they can be called to arrive if requested. Who is they referring to in this sentence?", "targets": "The dumpsters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kurt sang to Jon since he was the judge. Who is he referring to in this sentence?", "targets": "Jon", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "There is more NLP work on English than on Bengali because it has rich linguistic resources. Who is it referring to in this sentence?", "targets": "English", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Lucy gave a tutorial on how to install IOS 5 to Cindy since she is familiar with software upgrades. Who is she referring to in this sentence?", "targets": "Lucy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Amazon's Kindle Fire may surpass Apple's Ipad because they are quite expensive for providing a similar product. Who is they referring to in this sentence?", "targets": "Apple", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The army crossed the river because it was retreating. Who is it referring to in this sentence?", "targets": "The army", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Secretary and the President met about him being appointed. Who is him referring to in this sentence?", "targets": "The Secretary", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The US Health inspection board shut down several food factories, but they discovered that many rules and regulations were violated. Who is they referring to in this sentence?", "targets": "The US Health inspection board", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The squirrels buried the nuts so they would not get lost. Who is they referring to in this sentence?", "targets": "the nuts", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Stargate Atlantis was replaced by Stargate Universe since they were hoping that this show would do better in the ratings. Who is they referring to in this sentence?", "targets": "Stargate Universe", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The separatists launched a surprise attack against the empire so they could be caught off guard. Who is they referring to in this sentence?", "targets": "the empire", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Alex Rodriguez is paid much higher than Brandon Hughs because he is grossly overpaid. Who is he referring to in this sentence?", "targets": "Alex Rodriguez", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The dog hunted the fox because it was hungry. Who is it referring to in this sentence?", "targets": "The dog", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The collections agency often goes after delinquent accounts, but they sometimes make mistakes. Who is they referring to in this sentence?", "targets": "The collections agency", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Peter managed to win the lottery and loaned money to Rick, but he will pay him back. Who is he referring to in this sentence?", "targets": "Rick", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Dad yelled at Sam because he was mad. Who is he referring to in this sentence?", "targets": "Dad", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Snooki got angry at Kendra since she is upset that her friend would not comfort her. Who is she referring to in this sentence?", "targets": "Snooki", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rob was granted a gun license while Jon was not, because he had passed the background check. Who is he referring to in this sentence?", "targets": "Rob", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The robots tried to negotiate a cease-fire with the squirrel-men, but negotiations broke down when they sabotaged the microchip processing facility. Who is they referring to in this sentence?", "targets": "the squirrel-men", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Pat tried to talk to Jill but she did not seem to hear it. Who is she referring to in this sentence?", "targets": "Jill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bespeckled old man slowly waved at the passing trolley passenger because he waved at him. Who is he referring to in this sentence?", "targets": "the passing trolley passenger", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Wall Street was bailed out by the government because they were on the verge of collapsing. Who is they referring to in this sentence?", "targets": "Wall Street", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Chinese Empire banished the Wu Shu family from the kingdom since they tried to avoid conflict. Who is they referring to in this sentence?", "targets": "The Chinese Empire", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The mother encouraged her daughter to sing a difficult song so she would be challenged. Who is she referring to in this sentence?", "targets": "her daughter", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Prince Goro lectured Cano about the greatness of the emperor, because he was ignorant on realizing how powerful he really was. Who is he referring to in this sentence?", "targets": "Cano", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "There is currently more work on coreference resolution than on chunking because it is a problem that is still far from being solved. Who is it referring to in this sentence?", "targets": "coreference resolution", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Knights preferred dragons over horses because they could not fly. Who is they referring to in this sentence?", "targets": "horses", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The separatists launched a surprise attack against the empire so they could turn the tide of battle. Who is they referring to in this sentence?", "targets": "The separatists", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Batman is always teaching Robin new techniques and tips, since he is his mentor. Who is he referring to in this sentence?", "targets": "Batman", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mary asked Jim not to annoy the crazy person, as he might attack him. Who is he referring to in this sentence?", "targets": "the crazy person", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The veterans defeated the newcomers because they were less experienced. Who is they referring to in this sentence?", "targets": "the newcomers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Terranova has better ratings than House since they have attracted more new audiences. Who is they referring to in this sentence?", "targets": "Terranova", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The NBA will most likely have a lockout this year due to players rejecting their latest compromise, because they wanted better terms to be presented to them. Who is they referring to in this sentence?", "targets": "players", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Joe earned more money than Rob on the Price is Right because he kept guessing wrong. Who is he referring to in this sentence?", "targets": "Rob", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The red team defeated the blue team because they missed the last penalty kick. Who is they referring to in this sentence?", "targets": "the blue team", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The ball broke the window because it was fragile. Who is it referring to in this sentence?", "targets": "the window", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The authorities detained the hikers because they were trespassing. Who is they referring to in this sentence?", "targets": "the hikers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Batman is always teaching Robin new techniques and tips so he will one day be equal in skill. Who is he referring to in this sentence?", "targets": "Robin", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Pat tried to talk to Jill but she was ignored. Who is she referring to in this sentence?", "targets": "Pat", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Commissioner Gordon has to constantly call upon Batman since he is an extremely efficient crime fighter. Who is he referring to in this sentence?", "targets": "Batman", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The company accepted the resolution because it was well-written. Who is it referring to in this sentence?", "targets": "the resolution", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The wolves ate the cows because they were hungry. Who is they referring to in this sentence?", "targets": "The wolves", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police arrested the rioters because they were causing trouble. Who is they referring to in this sentence?", "targets": "the rioters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Joy was jealous of Jenny because she was making more money than her. Who is she referring to in this sentence?", "targets": "Jenny", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Mavericks are able to sell much merchandise to fans this season, and they just want it since they are the hottest team at the moment. Who is they referring to in this sentence?", "targets": "fans", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Video games are outselling movies because they are fun to play. Who is they referring to in this sentence?", "targets": "Video games", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John chose Bill because he was the best choice. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Alexandra told Kelly not to get a tattoo because she would seem unprofessional. Who is she referring to in this sentence?", "targets": "Kelly", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Ken scanned photos for Neil since he owned a scanner. Who is he referring to in this sentence?", "targets": "Ken", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The government officials publicly apologized to the people because they were forced to. Who is they referring to in this sentence?", "targets": "The government officials", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Amazon offers a generous credit program for college books because they want students to come back and use their credit for more purchases. Who is they referring to in this sentence?", "targets": "Amazon", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Emancipation Proclamation made slavery illegal, but it did not actually cause many slaves to be freed. Who is it referring to in this sentence?", "targets": "The Emancipation Proclamation", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Monkeys hate lions because they eat them. Who is they referring to in this sentence?", "targets": "Monkeys", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Herald Simmons has tremendous skill in rousing up the audience for Knight Keller because he has such excellent speaking qualities. Who is he referring to in this sentence?", "targets": "Herald Simmons", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police captured the criminals because they were more prepared. Who is they referring to in this sentence?", "targets": "The police", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Microsoft discontinued plans for the Courier tablet due to the success of the tablets from Apple, so they have eliminated another competitor in the tablet market. Who is they referring to in this sentence?", "targets": "Apple", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Skype has entered a partnership with Facebook, and they hope that this can help to promote their video calling. Who is they referring to in this sentence?", "targets": "Skype", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Adrian Peterson has more touchdowns than Reggie Bush because he is better at running the ball. Who is he referring to in this sentence?", "targets": "Adrian Peterson", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John chose Bill because he was choosing. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Ann helped Kim with her cooking skills, because she felt sorry for her. Who is she referring to in this sentence?", "targets": "Ann", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gladiators are viewed better than Slaves because they live in a life of servitude instead of dying in glory. Who is they referring to in this sentence?", "targets": "Slaves", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cat broke the glass because it was fragile. Who is it referring to in this sentence?", "targets": "the glass", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rammstein performed their latest hit single to the masses of Germany since they wanted to perform for this native country first. Who is they referring to in this sentence?", "targets": "Rammstein", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The government wanted to issue weapons to the US border patrol, since they need them to patrol effectively. Who is they referring to in this sentence?", "targets": "the US border patrol", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Entertainmart has to win over the consumers with their low prices, or they will most likely go out of business. Who is they referring to in this sentence?", "targets": "Entertainmart", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jesus appeared to Thomas in order to show that he had risen. Who is he referring to in this sentence?", "targets": "Jesus", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The band loves their fans because they come to every show. Who is they referring to in this sentence?", "targets": "their fans", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The youth outran the old man because he was in shape. Who is he referring to in this sentence?", "targets": "The youth", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The new knives are better than the old knives since they are much sharper. Who is they referring to in this sentence?", "targets": "new knives", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The United States sanctions Iran since they recently were caught in plotting an assassination. Who is they referring to in this sentence?", "targets": "Iran", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The government tried to free the journalists from North Korea, but they were held captive. Who is they referring to in this sentence?", "targets": "the journalists", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "David hit Bill and he cried. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chase Freedom provides quarterly bonuses as incentives for accounts but they do not always consider the incentive as much value. Who is they referring to in this sentence?", "targets": "accounts", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "James cheated off Henry's test, and the Teacher failed him. Who is him referring to in this sentence?", "targets": "James", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The company declared bonus for the employees because they made huge profits. Who is they referring to in this sentence?", "targets": "The company", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "My brother put a Barbie that has metal parts in the microwave, so it does not work anymore. Who is it referring to in this sentence?", "targets": "the microwave", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Hill joined Obama because Bill trusted him. Who is him referring to in this sentence?", "targets": "Obama", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Beowulf was granted the crown to succeed King Henry because he did not have a son to secede him instead. Who is he referring to in this sentence?", "targets": "King Henry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bill returned Jim twenty dollars because he lent money. Who is he referring to in this sentence?", "targets": "Jim", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Axis forces lost the war to the Allied forces because they fought on too many fronts. Who is they referring to in this sentence?", "targets": "The Axis forces", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The plane shot the rocket at the target, then it blew up. Who is it referring to in this sentence?", "targets": "the target", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Deal sites that monitor stores will be active during Thanksgiving weekend because they will be offering huge discount during this shopping weekend. Who is they referring to in this sentence?", "targets": "stores", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Black Eyed Peas hosted a huge event for the partners of Intel, since they have lots of money to hire them to perform. Who is they referring to in this sentence?", "targets": "the partners of Intel", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Drill Sergeants trained the troops aggressively because they need to be trained well to survive in war. Who is they referring to in this sentence?", "targets": "the troops", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Brock understood the material better than Tracy because he was not paying attention. Who is he referring to in this sentence?", "targets": "Tracy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John shot Jack, the elephant, in my pajamas, but how he got there is still a mystery. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Master Sifu passes wisdom on to Jack so he listens very intently to what he has to say. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Saudi government beheaded eight Bangladeshis because they wanted to adhere to Islamic laws. Who is they referring to in this sentence?", "targets": "The Saudi government", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The school denied parents parking permits because they did not want the parking lots to be over crowded with cars. Who is they referring to in this sentence?", "targets": "The school", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chase Sapphire has a 24 hour service line for card holders so they would be available to help if their customer encounters trouble. Who is they referring to in this sentence?", "targets": "Chase Sapphire", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Lions love gazelles because they are delicious. Who is they referring to in this sentence?", "targets": "gazelles", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The University declared holiday to students because they requested them. Who is they referring to in this sentence?", "targets": "students", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kenny attacked Ben, and then he attacked back. Who is he referring to in this sentence?", "targets": "Ben", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Derrick begged his boss for a raise but he did not give one. Who is he referring to in this sentence?", "targets": "his boss", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Starbuck employees make all the drinks on the spot for morning customers so they get their drinks nice and hot. Who is they referring to in this sentence?", "targets": "morning customers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "When the preschoolers visited the senior citizens, they were surprisingly well behaved. Who is they referring to in this sentence?", "targets": "the preschoolers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The jurors deliberated on the defendants' fate for hours, but they didn't receive the death penalty. Who is they referring to in this sentence?", "targets": "the defendants", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Paul made fun of Henry since he was such an easy target. Who is he referring to in this sentence?", "targets": "Henry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The forensic team managed to link the criminals to the crime since they analyzed the blood samples at the crime scene. Who is they referring to in this sentence?", "targets": "The forensic team", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gas powered fireplaces are environmentally friendly as compared to traditional fireplaces since they do not need wood to burn. Who is they referring to in this sentence?", "targets": "Gas powered fireplaces", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The artist told the model that she needed to stand up straighter. Who is she referring to in this sentence?", "targets": "the model", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Taco needs hot sauce because it does not taste as good alone. Who is it referring to in this sentence?", "targets": "Taco", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The hippo ate the food the trainer brought when he put it in the trough. Who is he referring to in this sentence?", "targets": "the trainer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rick Davis campaigned for John McCain since he could best support him in office. Who is he referring to in this sentence?", "targets": "Rick Davis", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jackie gave Beth a present because it was her birthday. Who is her referring to in this sentence?", "targets": "Beth", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Ryan has much less hair than Gary, so he does not go out in public without a hat. Who is he referring to in this sentence?", "targets": "Ryan", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The nurse gave the girl a lollypop because she had too many. Who is she referring to in this sentence?", "targets": "The nurse", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The big brother always beats the little brother at board games since he is not very good at games. Who is he referring to in this sentence?", "targets": "the little brother", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Coins are better than dollars because they wrinkle too easily. Who is they referring to in this sentence?", "targets": "dollars", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "NATO forces did precision predator strikes for the Libyan rebels since they had the predator vehicles. Who is they referring to in this sentence?", "targets": "NATO forces", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kim Kardashian has already followed in the steps of Demi Moore and getting divorced, because she also could not come to terms with her husband. Who is she referring to in this sentence?", "targets": "Kim Kardashian", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The other student corrected Robert because he better understood the problem. Who is he referring to in this sentence?", "targets": "The other student", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "King Leonidas was more respected then King Henry because he unfairly taxed the people. Who is he referring to in this sentence?", "targets": "King Henry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "DVD Players are slowly being replaced by Blu Ray Systems, but they will still exist for years to come. Who is they referring to in this sentence?", "targets": "DVD Players", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The students read the books because they were interesting. Who is they referring to in this sentence?", "targets": "the books", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The environmentalists were angry at the corporation because they saw them polluting the creek. Who is they referring to in this sentence?", "targets": "The environmentalists", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "McDonalds has many more restaurants than Chick Filet worldwide because they are a globally known. Who is they referring to in this sentence?", "targets": "McDonalds", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The security forces were not able to stop the mass of apes since they did not have the manpower to stop that many. Who is they referring to in this sentence?", "targets": "The security forces", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The NBA will most likely have a lockout this year due to players rejecting their latest compromise, but they refuse to write up a new compromise with them. Who is they referring to in this sentence?", "targets": "The NBA", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Pirates are always compared to ninjas, but they prefer to fight at sea. Who is they referring to in this sentence?", "targets": "Pirates", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The wolves ate the cows because they were delicious. Who is they referring to in this sentence?", "targets": "the cows", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "New York is very crowded compared to South Dakota, but they are also much smaller in square miles. Who is they referring to in this sentence?", "targets": "New York", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Consultants are hired by companies to perform specialized tasks, but they do not always have money in the budget to hire these services. Who is they referring to in this sentence?", "targets": "companies", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Frosted Flakes is tastier than Fiber One because they use frosting on the cereal. Who is they referring to in this sentence?", "targets": "Frosted Flakes", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The starships transported the colonists to their new planet since they will be creating a new settlement. Who is they referring to in this sentence?", "targets": "the colonists", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Hunters excel in tracking animals because they can see the trail they leave in the forest. Who is they referring to in this sentence?", "targets": "Hunters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jimbo was running from Bobbert because he smelled awful. Who is he referring to in this sentence?", "targets": "Bobbert", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Student A beat student B, because he studied. Who is he referring to in this sentence?", "targets": "Student A", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The advisor told the President that he should declare war. Who is he referring to in this sentence?", "targets": "the President", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Stars did not have many viewers watching the game last Friday because they were playing at the same time as the World Series. Who is they referring to in this sentence?", "targets": "The Stars", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Animal Control takes control of lost animals in the city so they will not pose any threats to the pedestrians. Who is they referring to in this sentence?", "targets": "lost animals", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The military prepared to go to battle with an Amish colony because they felt threatened. Who is they referring to in this sentence?", "targets": "The military", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Windows is worse than Linux because it has a lot of viruses. Who is it referring to in this sentence?", "targets": "Windows", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Robert fired Chris because he no longer needed workers. Who is he referring to in this sentence?", "targets": "Robert", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "New Orleans is renown for their unique style of crawfish, because they are flavored and cooked to be delicious. Who is they referring to in this sentence?", "targets": "crawfish", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Katie accused Jane but she felt badly about it. Who is she referring to in this sentence?", "targets": "Katie", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Nicole was angry at Sammie since she caught her in a lie. Who is she referring to in this sentence?", "targets": "Sammie", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "MIT accepted the students, because they had good grades. Who is they referring to in this sentence?", "targets": "the students", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Herman Cain has been rising in the polls, causing concern for Rick Perry, since he has been appealing to a wider audience. Who is he referring to in this sentence?", "targets": "Herman Cain", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Lucas is younger than Claus because he was born first. Who is he referring to in this sentence?", "targets": "Claus", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The pyramids are a maze which contains a great deal of treasure, so they constantly attract treasure hunters exploring the depths. Who is they referring to in this sentence?", "targets": "The pyramids", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Johnson wanted to make friendship with David, because he wanted help. Who is he referring to in this sentence?", "targets": "Johnson", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Seth is a smarter than Sai, and consequently he did worse in the job interview. Who is he referring to in this sentence?", "targets": "Sai", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Yuji was a fan of Michael Jackson because he was famous. Who is he referring to in this sentence?", "targets": "Michael Jackson", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Misty was replaced by May because she was the only one available. Who is she referring to in this sentence?", "targets": "May", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Right after work Angelina took Sandy to the park because she knew the place. Who is she referring to in this sentence?", "targets": "Angelina", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack the ripper killed John, but he was not caught yet. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Apple recently had to recall 1st generation IPods because they had a defect in their batteries. Who is they referring to in this sentence?", "targets": "1st generation IPods", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Crusaders fought many unholy enemies since they were considered unholy by the priests. Who is they referring to in this sentence?", "targets": "many unholy enemies", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The professor told John that he passed the exam. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Raccoons constantly play dead when people come near since they hope they will be ignored. Who is they referring to in this sentence?", "targets": "Raccoons", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "James asked Robert for a favor, but he refused. Who is he referring to in this sentence?", "targets": "Robert", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Americans preferred Obama to McCain because he chose Joe Biden as his runing-mate. Who is he referring to in this sentence?", "targets": "Obama", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Some citizens of the kingdom were put in chains by the royal guard because they have a duty to uphold the King's rule. Who is they referring to in this sentence?", "targets": "the royal guard", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The NSA sent their agents in the field to retrieve intelligence, but they were not able to gather the intelligence for them. Who is they referring to in this sentence?", "targets": "their agents", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The rock melted in the lava because it was hot. Who is it referring to in this sentence?", "targets": "the lava", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bob cooked omelets for Jack, because he knew how. Who is he referring to in this sentence?", "targets": "Bob", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The judges monitor the performance of the competitors to measure their abilities, but they do not decide if they move on to the next round. Who is they referring to in this sentence?", "targets": "The judges", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Technician Stepanic crafted advanced opticals for Leforge, but he would still prefer to see without such devices. Who is he referring to in this sentence?", "targets": "Leforge", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "James asked Robert for a favor, but he was refused. Who is he referring to in this sentence?", "targets": "James", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The computer could not run the program because it did not have enough memory. Who is it referring to in this sentence?", "targets": "The computer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kate Middleton is viewed as a newer generation Princess Diana because she is also being compared as a fashion symbol. Who is she referring to in this sentence?", "targets": "Kate Middleton", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "In last week's tennis match, Djokovic imitated Roddick's serve because he was the better player. Who is he referring to in this sentence?", "targets": "Roddick", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Dan modified Harry's car because he had the tools. Who is he referring to in this sentence?", "targets": "Dan", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The government tried to free the journalists from North Korea, but they were unsuccessful. Who is they referring to in this sentence?", "targets": "The government", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Apple defeated Microsoft in the war because they were creative. Who is they referring to in this sentence?", "targets": "Apple", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Beowulf was granted the crown to succeed King Henry since he was the best man for the job due to a lack of a rightful heir. Who is he referring to in this sentence?", "targets": "Beowulf", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "When the preschoolers visited the senior citizens, they were very hospitable. Who is they referring to in this sentence?", "targets": "the senior citizens", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jessica did not like Selma cutting her hair short, so she tried to be conservative in the length she cut it. Who is she referring to in this sentence?", "targets": "Selma", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bus driver yelled at a kid after she drove her vehicle. Who is she referring to in this sentence?", "targets": "The bus driver", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jackie gave Beth a present because it was her friend's birthday. Who is her referring to in this sentence?", "targets": "Jackie", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sue visited Nadia for dinner because she was free. Who is she referring to in this sentence?", "targets": "Sue", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mary stabbed Jennifer, so John reported her to the police. Who is her referring to in this sentence?", "targets": "Mary", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "HP sold a new LED monitor for a heavily discounted price to consumers, so they ended up buying mass amounts of monitors. Who is they referring to in this sentence?", "targets": "consumers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The airline unions constantly go on strike against the airlines because they do not care for the employees. Who is they referring to in this sentence?", "targets": "the airlines", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The listener did not complain about the singer because he was autotuned. Who is he referring to in this sentence?", "targets": "the singer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A series of injections are used to battle a type of cancer in patients, but they do not always provide a hundred percent success rate. Who is they referring to in this sentence?", "targets": "A series of injections", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "When Sue went to Nadia's home for dinner, she showed her a big teddy bear. Who is she referring to in this sentence?", "targets": "Sue", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The employer let John have the assignment even though he wanted it. Who is he referring to in this sentence?", "targets": "The employer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The monsters at the haunted house chased the children because they are trying to scare them. Who is they referring to in this sentence?", "targets": "The monsters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The military prepared to go to battle with an Amish colony because they were amassing a dangerous number of goats without a permit. Who is they referring to in this sentence?", "targets": "an Amish colony", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police officer shot the protester because he lost composure. Who is he referring to in this sentence?", "targets": "The police officer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Ryan won the presidency against Tom because he was not fit for office. Who is he referring to in this sentence?", "targets": "Tom", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Thor was banished from the kingdom by his father because he felt his son was too eager to become king. Who is he referring to in this sentence?", "targets": "his father", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The dumpsters arrived each day to retrieve the garbage of the population because they produced a lot of garbage every day. Who is they referring to in this sentence?", "targets": "the population", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Shawn Jun performed a huge upset over four time champion Leon Sung because he has more desire to win. Who is he referring to in this sentence?", "targets": "Shawn Jun", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Doctor Chen prescribed glasses to Egore, since he needs glasses to see. Who is he referring to in this sentence?", "targets": "Egore", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "James went to Sully's arcade but he refused to let him in. Who is he referring to in this sentence?", "targets": "Sully", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Alice helped Gwen move because she could not handle the job alone. Who is she referring to in this sentence?", "targets": "Gwen", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Master Wong had to come to the defense of his pupil, Lun-Xiu, since he managed to anger numerous thugs. Who is he referring to in this sentence?", "targets": "Lun-Xiu", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack shouted at Bill because he was angry. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Planet Express was bought out by Mom's Friendly Delivery Service so they can eliminate the competition. Who is they referring to in this sentence?", "targets": "Mom's Friendly Delivery Service", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A biker sped past an officer and he turned on his siren. Who is he referring to in this sentence?", "targets": "an officer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Parents send their children to bed, because they want them to have enough sleep for school in the morning. Who is they referring to in this sentence?", "targets": "Parents", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Hybrid cars produce less pollution than diesel trucks because they use pure gasoline. Who is they referring to in this sentence?", "targets": "diesel trucks", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tobias is upset with William because he was mean. Who is he referring to in this sentence?", "targets": "William", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Ebay is often considered a great source by deal hunters to buy products, even though they often contain misleading descriptions. Who is they referring to in this sentence?", "targets": "Ebay", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Will Smith and his new movie is highly anticipated by movie critic, John Billic, because he has thus far been a huge hit. Who is he referring to in this sentence?", "targets": "Will Smith", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jackie Chan learned some things from watching Bruce Lee because he was a popular kung fu actor in the past. Who is he referring to in this sentence?", "targets": "Jackie Chan", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tom likes John because he has a cool name. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boy ran from the cop because he committed the crime. Who is he referring to in this sentence?", "targets": "The boy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Steve Urkel was always annoying Carl Winslow in the show, \"Family Matters\", because he is quite annoying by nature. Who is he referring to in this sentence?", "targets": "Steve Urkel", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chris was running after John, because he stole his watch. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "NATO forces did precision predator strikes for the Libyan rebels because they did not have the capabilities themselves. Who is they referring to in this sentence?", "targets": "Libyan rebels", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sheila made chicken noodle soup for her daughter, but she wanted cereal instead. Who is she referring to in this sentence?", "targets": "her daughter", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Clinton wanted Obama to run for president because he could not win. Who is he referring to in this sentence?", "targets": "Clinton", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The elephant trampled a fish and it continued on its way. Who is it referring to in this sentence?", "targets": "The elephant", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The older male cat is bullying the new younger male cat so that he can assert his dominance. Who is he referring to in this sentence?", "targets": "The older male cat", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The NSA sent their agents in the field to retrieve intelligence because they need people in the field to do the field work. Who is they referring to in this sentence?", "targets": "The NSA", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jean is making fun of Kyle because he won. Who is he referring to in this sentence?", "targets": "Jean", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Michael asked Jacob to dance because he felt sorry for him. Who is he referring to in this sentence?", "targets": "Michael", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John kicked Bill because he was angry. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Steve threw the bowling ball down the lane when it was clear. Who is it referring to in this sentence?", "targets": "the lane", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Santa Claus and his elves distributed millions of presents worldwide to the children of the world, but they do not all believe in them being able to give presents worldwide in a night. Who is they referring to in this sentence?", "targets": "the children of the world", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A person is more productive on an IDE than a text editor, therefore it should not be used in general practice. Who is it referring to in this sentence?", "targets": "a text editor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The sailors fell off the boats because they were drunk. Who is they referring to in this sentence?", "targets": "The sailors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Misty was replaced by May because she had to go back home. Who is she referring to in this sentence?", "targets": "Misty", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Centurion lent Doctor Who his ear since he had saved the Centurion's life. Who is he referring to in this sentence?", "targets": "Doctor Who", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The lion bit the gazelle because it had horns. Who is it referring to in this sentence?", "targets": "the gazelle", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Republicans preferred Romney to Perry because he would not think his supporters were heartless. Who is he referring to in this sentence?", "targets": "Romney", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boy tried to address his friend, but he could not speak. Who is he referring to in this sentence?", "targets": "The boy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Blizzard Entertainment does not sell their games on Steam because they require part of the profits for each sale. Who is they referring to in this sentence?", "targets": "Steam", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Luigi rescued Mario because he was the only one who can. Who is he referring to in this sentence?", "targets": "Luigi", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Will Smith got his son in a movie since he is the son of a famous movie actor. Who is he referring to in this sentence?", "targets": "his son", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Terranova has better ratings than House since they have a small target audience. Who is they referring to in this sentence?", "targets": "House", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Hybrid cars produce less pollution than diesel trucks because they use less gas and more electricity. Who is they referring to in this sentence?", "targets": "Hybrid cars", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Backstreet Boys were much more popular than N-Sync since they were not very good overall. Who is they referring to in this sentence?", "targets": "N-Sync", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Excalibur spent time with the stone because it was very smooth and sturdy. Who is it referring to in this sentence?", "targets": "the stone", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "U.S. Authors are fighting against Amazon's book lending program because they allow users a free book every month. Who is they referring to in this sentence?", "targets": "Amazon's book lending program", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rocky beat Drago because the crowd was not supporting him. Who is him referring to in this sentence?", "targets": "Drago", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chuck Norris can beat any man in a fight, unless he is tied up and blindfolded. Who is he referring to in this sentence?", "targets": "Chuck Norris", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jacob gave William money because he needed some. Who is he referring to in this sentence?", "targets": "William", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Policemen advocated the use of wire taps to track terrorists, because they could not catch them without those tools. Who is they referring to in this sentence?", "targets": "Policemen", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Crusaders fought many unholy enemies because they viewed their crusade as their divine right. Who is they referring to in this sentence?", "targets": "The Crusaders", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police officer shot the protester because he tried to attack the governor. Who is he referring to in this sentence?", "targets": "the protester", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jesus appeared to Thomas in order to show that he had unfounded doubts. Who is he referring to in this sentence?", "targets": "Thomas", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The United Federation of Worlds attempts to bring civilization and rule to the population of millions of planets, because they want to unite the planets under the same rules. Who is they referring to in this sentence?", "targets": "The United Federation of Worlds", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Henry changed Jack's oil, because he gave him money. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rocky won the match with Richard because he had no energy. Who is he referring to in this sentence?", "targets": "Richard", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Malachi's program would not run on the computer because it was full of bugs. Who is it referring to in this sentence?", "targets": "Malachi's program", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The authorities detained the hikers because they were prejudiced. Who is they referring to in this sentence?", "targets": "The authorities", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Alice helped Gwen move because she was nice. Who is she referring to in this sentence?", "targets": "Alice", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bob cooked omelets for Jack, because he was hungry. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Liu Kang threw the bags of Johnny Cage into the water because he was annoyed that he thought he was a baggage boy. Who is he referring to in this sentence?", "targets": "Liu Kang", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Soldiers of the armed forces were slowly being phased out by genetically engineered soldiers since they were physically inferior to their new counterparts. Who is they referring to in this sentence?", "targets": "Soldiers of the armed forces", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John fired Dave because he had too many employees. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The zombies chased the survivors because they were tasty. Who is they referring to in this sentence?", "targets": "the survivors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The civilians had to flee the encampment from the thugs because they feared for their lives. Who is they referring to in this sentence?", "targets": "The civilians", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gamestop pulled Square Enix's game, \"Dues Ex\" from the shelves, because they would not sell a game that promoted another game service. Who is they referring to in this sentence?", "targets": "Square Enix", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police called headquarters for help and they refused. Who is they referring to in this sentence?", "targets": "headquarters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Michael asked Jacob to dance because he was lonely. Who is he referring to in this sentence?", "targets": "Jacob", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The government wanted to issue weapons to the US border patrol, so they asked the Congress to approve the budget on weapons. Who is they referring to in this sentence?", "targets": "The government", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Uncharted 3 did not introduce any new ideas since their last game, Uncharted 2, but it is still going to be a fun game. Who is it referring to in this sentence?", "targets": "Uncharted 2", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Merchant Smith purchased the trophy from Knight Louis, but he did not pay very well for it. Who is he referring to in this sentence?", "targets": "Merchant Smith", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Stephen King called Spielberg so that he could call him back. Who is he referring to in this sentence?", "targets": "Spielberg", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The school denied parents parking permits because they violated parking rules. Who is they referring to in this sentence?", "targets": "parents", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Republicans preferred Romney to Perry because he said his supporters were heartless. Who is he referring to in this sentence?", "targets": "Perry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The space marines killed the aliens because they were ordered to. Who is they referring to in this sentence?", "targets": "The space marines", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John could not understand his waiter, because he spoke Spanish. Who is he referring to in this sentence?", "targets": "his waiter", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Seth is smarter than Sai, and consequently he got a better job. Who is he referring to in this sentence?", "targets": "Seth", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Subways has always been considered a healthy choice by athletes since they offer such healthy ingredients in their sandwiches. Who is they referring to in this sentence?", "targets": "Subways", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Commissioner Gordon has to constantly call upon Batman because he is not able to stop the criminals himself. Who is he referring to in this sentence?", "targets": "Commissioner Gordon", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chris was running after John, because he wanted to talk to him. Who is he referring to in this sentence?", "targets": "Chris", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The academic clubs lost their members because they did not have free time. Who is they referring to in this sentence?", "targets": "their members", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The advisor told the President that he was resigning. Who is he referring to in this sentence?", "targets": "The advisor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Treasure hunters have to constantly fear running into bandits, even though they are rarely out to get them. Who is they referring to in this sentence?", "targets": "bandits", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "My parents gave the neighbors tickets to Six Flags since they had extras. Who is they referring to in this sentence?", "targets": "My parents", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Obama had a meeting with Cantor, where he attempted to secure his support of the jobs bill. Who is he referring to in this sentence?", "targets": "Obama", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Herman Cain has fallen in the polls while Mitt Romney has increased his foothold, but he may have a comeback in the polls after the next debate. Who is he referring to in this sentence?", "targets": "Herman Cain", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John picked Bill because he was in need of talent. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Cathy let Joanna into her car, so she could sell the car. Who is she referring to in this sentence?", "targets": "Cathy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Deal sites that monitor stores will be active during Thanksgiving weekend, but they do not necessarily guarantee you will get it first. Who is they referring to in this sentence?", "targets": "Deal sites", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mike tried to follow Tom but he could not keep up. Who is he referring to in this sentence?", "targets": "Mike", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Drill Sergeants trained the troops aggressively so they could prepare them for the impending war. Who is they referring to in this sentence?", "targets": "The Drill Sergeants", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Peacocks are considered very majestic birds by bird watchers because they are considered quite beautiful due to their vivid colors. Who is they referring to in this sentence?", "targets": "Peacocks", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The University declared holiday to students because they were worried about them. Who is they referring to in this sentence?", "targets": "The University", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jimbo ate the fish that Bobbert prepared because he was hungry. Who is he referring to in this sentence?", "targets": "Jimbo", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A person is more productive on an IDE than a text editor, therefore it should be used in general practice. Who is it referring to in this sentence?", "targets": "an IDE", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The company declared bonus for the employees because they worked hard. Who is they referring to in this sentence?", "targets": "the employees", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The salesman sold a hot tub to the customer because he was trying to sell his products. Who is he referring to in this sentence?", "targets": "The salesman", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack pays more for the things Jim gets for nothing, because he was desperate. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Knights preferred dragons over horses because they could fly. Who is they referring to in this sentence?", "targets": "dragons", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Harrison looked into illegal accusations against his partner, Bryan, but he may of been falsely accused. Who is he referring to in this sentence?", "targets": "Bryan", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Allen chased the leprechaun because he wanted a pot of gold. Who is he referring to in this sentence?", "targets": "Allen", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The teachers failed the students because they graded the test incorrectly. Who is they referring to in this sentence?", "targets": "The teachers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bee landed on the flower because it wanted pollen. Who is it referring to in this sentence?", "targets": "The bee", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Dance Instructor Kate offers advice to Shelly because she is eager to soak up as much experience as possible. Who is she referring to in this sentence?", "targets": "Shelly", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The veterans defeated the newcomers because they were more experienced. Who is they referring to in this sentence?", "targets": "The veterans", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The robots tried to negotiate a cease-fire with the squirrel-men, but negotiations broke down when they sabotaged the acorn processing facility. Who is they referring to in this sentence?", "targets": "The robots", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A motorboat turns the propeller pushing the water backwards, thus it moves forward. Who is it referring to in this sentence?", "targets": "A motorboat", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Blizzard Entertainment does not sell their games on Steam because they prefer to keep their own profits. Who is they referring to in this sentence?", "targets": "Blizzard Entertainment", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The DEA raided the Mexican Cartel's warehouse because they suspected a drug business was occurring. Who is they referring to in this sentence?", "targets": "DEA", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The man stole the neighbor's bike because he needed one. Who is he referring to in this sentence?", "targets": "The man", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jill loves Jamie and she does not feel the same way. Who is she referring to in this sentence?", "targets": "Jamie", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The zombies chased the survivors because they were hungry. Who is they referring to in this sentence?", "targets": "The zombies", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bartenders threw ice at the Jersey Shore cast because they were not wanted in the club. Who is they referring to in this sentence?", "targets": "the Jersey Shore cast", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rosie beat Mary in Scrabble because she was bad at word games. Who is she referring to in this sentence?", "targets": "Mary", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The teacher did not recommend William because he was not a good student. Who is he referring to in this sentence?", "targets": "William", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "NASA helped the Autobots to exile from the planet after they were told to leave. Who is they referring to in this sentence?", "targets": "the Autobots", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police called headquarters for help and they continued to fight the criminals. Who is they referring to in this sentence?", "targets": "The police", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The construction workers hollered at the girls when they walked by. Who is they referring to in this sentence?", "targets": "the girls", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Peter managed to win the lottery and loaned money to Rick, because he has enough money to freely loan to his friends. Who is he referring to in this sentence?", "targets": "Peter", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Blackberry alienated a lot of users because they were angered by the service being taken down for days. Who is they referring to in this sentence?", "targets": "a lot of users", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bioware recently announced a stress test to beta users this weekend so they are eagerly awaiting to play the much anticipated game. Who is they referring to in this sentence?", "targets": "beta users", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The game distribution platform \"Origin\" will have exclusive EA games that competitor \"Steam\" will not have, because they are trying to entice users to their platform. Who is they referring to in this sentence?", "targets": "Origin", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Angelina Jolie played the role of the mother of Grendell, but she is a fictional character which would have to be created using CGI. Who is she referring to in this sentence?", "targets": "the mother of Grendell", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Nancy adopted a baby girl because she always wanted a daughter. Who is she referring to in this sentence?", "targets": "Nancy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kathy looked after the children of Mrs. Faith since she wanted to have a night out at town. Who is she referring to in this sentence?", "targets": "Mrs. Faith", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Officer Kennedy saved Roger from the criminals because he upholds the peace. Who is he referring to in this sentence?", "targets": "Officer Kennedy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kevin stared at Michael and he got his attention. Who is he referring to in this sentence?", "targets": "Kevin", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The space marines killed the aliens because they were a threat. Who is they referring to in this sentence?", "targets": "the aliens", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Nicole was angry at Sammie since she lied to her. Who is she referring to in this sentence?", "targets": "Nicole", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bill was robbed by John, so the officer arrested him. Who is him referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boy scouts were able to raise more money for charity over the girl scouts since they were not able to raise funds as actively. Who is they referring to in this sentence?", "targets": "the girl scouts", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Stephen Colbert is funnier than John Stewart since his comedy is better. Who is his referring to in this sentence?", "targets": "Stephen Colbert", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John visited his son so he could spent time with him. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John thanked Bill because he was helpful. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Amazon offers a generous credit program for college books since they can be resold again to other buyers. Who is they referring to in this sentence?", "targets": "college books", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Minecraft developers managed to win their case regarding copyright infringement against Bethesda Studios, but they will probably file another lawsuit again. Who is they referring to in this sentence?", "targets": "Bethesda Studios", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Dallas Cowboys lost their lead to the Redskins because they started to perform very well in the second half. Who is they referring to in this sentence?", "targets": "the Redskins", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tim bought Eric a gecko, because he liked him. Who is he referring to in this sentence?", "targets": "Tim", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Seagate recently announced to their investors that production will not go back to normal until the end of 2012 because they had their factories flooded last month. Who is they referring to in this sentence?", "targets": "Seagate", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Samsonite makes luggage which is highly rated by Luggage Ratings Inc. because they thought the product they rated was highly desirable due to its quality. Who is they referring to in this sentence?", "targets": "Luggage Ratings Inc.", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gas powered fireplaces are environmentally friendly as compared to traditional fireplaces since they require wood to function. Who is they referring to in this sentence?", "targets": "traditional fireplaces", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The FBI usually take over the crime scene from the police because they sometimes need help to investigate the crime. Who is they referring to in this sentence?", "targets": "the police", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The assembly line workers were told they had been fired by the company, because they had moved the jobs overseas. Who is they referring to in this sentence?", "targets": "The assembly line workers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Shigeru Miyamoto was the mentor of Satoshi Tajiri, so he taught many things. Who is he referring to in this sentence?", "targets": "Shigeru Miyamoto", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The employees of Six Flags denied the customers access to the ride, but they can still go on other rides. Who is they referring to in this sentence?", "targets": "the customers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The policeman finally caught the criminal, because he used pepper spray and handcuffs. Who is he referring to in this sentence?", "targets": "The policeman", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The band connected well to their fans, so they continued to buy albums. Who is they referring to in this sentence?", "targets": "their fans", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The preservation society managed to rescue a rare species of birds so they will have the chance to survive. Who is they referring to in this sentence?", "targets": "a rare species of birds", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "American Airlines offers upgrades for their preferred passengers so they continue choosing their airlines over others. Who is they referring to in this sentence?", "targets": "their preferred passengers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John asked the scientist what he was working on. Who is he referring to in this sentence?", "targets": "the scientist", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The orchestra was booed by the audience because they had expected a rock band. Who is they referring to in this sentence?", "targets": "the audience", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Secretary and the President met about him being elected. Who is him referring to in this sentence?", "targets": "the President", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bird ate the pie and it was ruined. Who is it referring to in this sentence?", "targets": "the pie", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Americans preferred Obama to McCain because he was too old. Who is he referring to in this sentence?", "targets": "McCain", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Doctor Conrad Murray is accused of negligence in Michael Jackson's death because he overdosed on drugs when the doctor was present. Who is he referring to in this sentence?", "targets": "Michael Jackson", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Steven assassinated the president because he was paid to do it. Who is he referring to in this sentence?", "targets": "Steven", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Customer Support fields the questions of their customers so they could provide immediate assistance. Who is they referring to in this sentence?", "targets": "Customer Support", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "James always gives orders to Owen because he is very bossy. Who is he referring to in this sentence?", "targets": "James", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Ashton Kutcher replaced Charlie Sheen as the main character of Two and a Half Men, but he did not leave the show willingly. Who is he referring to in this sentence?", "targets": "Charlie Sheen", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack is an optimist, and Adam is a pessimist, then he looks at the cup half full. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mary cleaned Susan's room and she asked a favor. Who is she referring to in this sentence?", "targets": "Mary", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Scrooge was moved by the appearance of Timmy since he has an effect on people due to him being crippled and loving. Who is he referring to in this sentence?", "targets": "Timmy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Microsoft Azure provides cloud servers for consumers because they are providing the infrastructure for a future in cloud computing. Who is they referring to in this sentence?", "targets": "Microsoft Azure", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police officer chased the thief because he was stealing from the bank. Who is he referring to in this sentence?", "targets": "the thief", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Verizon Fios provides hundreds of channels to millions of viewers, because they want them to have a plethora of options to choose from. Who is they referring to in this sentence?", "targets": "Verizon Fios", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The academic clubs lost their members because they were poorly funded. Who is they referring to in this sentence?", "targets": "The academic clubs", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jeremy annoyed Justin so he can leave the room. Who is he referring to in this sentence?", "targets": "Justin", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Magnificent Five will battle it out with Shen Yu's forces, but they may try and run away. Who is they referring to in this sentence?", "targets": "Shen Yu's forces", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The students read the books because they were learning. Who is they referring to in this sentence?", "targets": "The students", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The chef made breakfast for the captain because he was required to. Who is he referring to in this sentence?", "targets": "The chef", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Alex Rodriguez is paid much higher than Brandon Hughs because he is a less sought after player. Who is he referring to in this sentence?", "targets": "Brandon Hughs", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Computers outsell laptops because they are not worth the money. Who is they referring to in this sentence?", "targets": "laptops", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jennifer Aniston does not like Angelina Jolie because she stole her boyfriend. Who is she referring to in this sentence?", "targets": "Angelina Jolie", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The painting was at the museum because it was on display. Who is it referring to in this sentence?", "targets": "The painting", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John bought a beer for Bill because he likes cool guys. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "When Debbie splashed Tina, she got wet. Who is she referring to in this sentence?", "targets": "Tina", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Scribes were often hired by nobles in the Medieval period although they were able to read and write themselves. Who is they referring to in this sentence?", "targets": "nobles", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Aaron kissed Dan because he wanted him to. Who is he referring to in this sentence?", "targets": "Dan", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Shawn hit Joe but he did not scream. Who is he referring to in this sentence?", "targets": "Joe", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Treasure hunters have to constantly fear running into bandits because they could be risking their lives if they encounter them. Who is they referring to in this sentence?", "targets": "Treasure hunters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Retail stores have been trying to pass an internet tax on online retailers for the past few years because they feel it would level the playing field. Who is they referring to in this sentence?", "targets": "Retail stores", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "UPS provides much convenience to the customers with their drop off service since they make the shipping of packages extremely easy. Who is they referring to in this sentence?", "targets": "UPS", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The man gave the beggar some money because he was too persistent. Who is he referring to in this sentence?", "targets": "the beggar", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Stark Industries produces the best technology for the military because they have a number of brilliant scientists. Who is they referring to in this sentence?", "targets": "Stark Industries", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Batman caught the thief, and he recovered the stolen diamonds. Who is he referring to in this sentence?", "targets": "Batman", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John flicked Bill because he had a fly on his shirt. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The big brother always beats the little brother at board games since he was older and wiser. Who is he referring to in this sentence?", "targets": "The big brother", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Scribes were often hired by nobles in the Medieval period since they had the ability to read and write. Who is they referring to in this sentence?", "targets": "Scribes", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Cheesecake is better than fruitcake because it tastes better. Who is it referring to in this sentence?", "targets": "Cheesecake", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The knife cut through the fence because it was sharp. Who is it referring to in this sentence?", "targets": "The knife", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The farmer proudly revealed his favorite chicken, because he won the prize money. Who is he referring to in this sentence?", "targets": "The farmer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The judge was fond of the contestant so he received the gold medal. Who is he referring to in this sentence?", "targets": "the contestant", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John flicked Bill because he saw a fly on his shirt. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boy lent his friend a pencil because the teacher told him to write. Who is him referring to in this sentence?", "targets": "his friend", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The sailors fell off the boats because they were capsizing. Who is they referring to in this sentence?", "targets": "the boats", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "When Sue went to Nadia's home for dinner, she told the security guard to let her in. Who is she referring to in this sentence?", "targets": "Sue", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The wine busted the cask because it was too carbonated. Who is it referring to in this sentence?", "targets": "The wine", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John wanted to vote for Doe, but he did not seem like the right candidate. Who is he referring to in this sentence?", "targets": "Doe", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chase will have a cyber monday sale for credit users since they want to entice users to continue using their cards. Who is they referring to in this sentence?", "targets": "Chase", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "William enforced a mandatory choir practice for Ryan since he is a mean teacher. Who is he referring to in this sentence?", "targets": "William", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack raced past Dan since his car is much faster. Who is his referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sherry called Karla but she did not answer. Who is she referring to in this sentence?", "targets": "Karla", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The car hop brought the man his tray, but he was not in the car. Who is he referring to in this sentence?", "targets": "the man", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Walmart is promoting their Black Friday sale heavily in commercials, since they are the best medium to get information out to the average consumer. Who is they referring to in this sentence?", "targets": "commercials", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Martial Arts actors are often accused as being frauds by the public since they can only fight in fake scenarios. Who is they referring to in this sentence?", "targets": "Martial Arts actors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Buy More Book Store sends brand new books to customers, but they sometimes end up sending used books instead. Who is they referring to in this sentence?", "targets": "Buy More Book Store", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "To save the world, Liu Kang must defeat Shang Hai in mortal combat, since he would be able to invade the world if he is not defeated. Who is he referring to in this sentence?", "targets": "Shang Hai", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The hammer hit the bullet, so it stopped. Who is it referring to in this sentence?", "targets": "The hammer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cabbage was in the freezer and it became full. Who is it referring to in this sentence?", "targets": "the freezer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kate Middleton is viewed as a newer generation Princess Diana because she was a symbol of fashion as the previous queen. Who is she referring to in this sentence?", "targets": "Princess Diana", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The AirForce is more appealing than the Army, but they require higher qualifications. Who is they referring to in this sentence?", "targets": "The AirForce", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sega lost to Nintendo because they were inferior. Who is they referring to in this sentence?", "targets": "Sega", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Software gives more profit over hardware since they have little cost associated with selling more. Who is they referring to in this sentence?", "targets": "Software", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Janet Jackson is more popular than Latoya Jackson since she is the better performer. Who is she referring to in this sentence?", "targets": "Janet Jackson", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The lumberjacks cut the trees so they could be sold. Who is they referring to in this sentence?", "targets": "the trees", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The US president had a meeting with the Chinese president, where he told him to release political prisoners. Who is he referring to in this sentence?", "targets": "The US president", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Ryan has much less hair than Gary, so he has to cut his hair constantly. Who is he referring to in this sentence?", "targets": "Gary", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Western Digital may disappoint their shareholders this season, but they will probably tough out the momentary losses and remain shareholders. Who is they referring to in this sentence?", "targets": "their shareholders", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A monkey ate a lizard and it screamed in pain. Who is it referring to in this sentence?", "targets": "a lizard", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "James cheated off Henry's test, and the Teacher told him. Who is him referring to in this sentence?", "targets": "Henry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "David hit Bill because Mary asked him to. Who is him referring to in this sentence?", "targets": "David", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Hitler conquered Alex in the war because nobody supported him. Who is him referring to in this sentence?", "targets": "Alex", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kevin stared at Michael and he got angry. Who is he referring to in this sentence?", "targets": "Michael", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The couple took the car to the shop on Tuesday, but they will not charge until next week. Who is they referring to in this sentence?", "targets": "the shop", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The citizens rebelled against the government because they were being repressed. Who is they referring to in this sentence?", "targets": "The citizens", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "James always gives orders to Owen because he is very obedient. Who is he referring to in this sentence?", "targets": "Owen", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Our professor told the TA that he could have the day off. Who is he referring to in this sentence?", "targets": "the TA", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The celebrities who agreed to go to the Marine Corp dance with their dates stayed true to their word, because they felt that this was the least they could do to thank the troops. Who is they referring to in this sentence?", "targets": "The celebrities", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jimbo attacked Bobbert because he could not control his rage. Who is he referring to in this sentence?", "targets": "Jimbo", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The kitten played with the yarn because it was bored. Who is it referring to in this sentence?", "targets": "The kitten", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Peter Griffin often pokes fun at Chris, so he always ends up being angry. Who is he referring to in this sentence?", "targets": "Chris", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gold is more popular than black because it does not sparkle. Who is it referring to in this sentence?", "targets": "black", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The wolves attacked the travelers in the forest since they were not welcomed near their home. Who is they referring to in this sentence?", "targets": "The wolves", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "There is more NLP work on English than on Bengali because it has little linguistic resources. Who is it referring to in this sentence?", "targets": "Bengali", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "I think the referee treats Vick like a running back because he has distinct style of play. Who is he referring to in this sentence?", "targets": "Vick", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The DEA raided the Mexican Cartel's warehouse because they had their drug business discovered. Who is they referring to in this sentence?", "targets": "Mexican Cartel", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The museum curator looked at the patron and said he should leave. Who is he referring to in this sentence?", "targets": "the patron", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Zidane headbutted Zambrotta because he was being insulting. Who is he referring to in this sentence?", "targets": "Zambrotta", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Amazon's Kindle Fire may surpass Apple's IPad because they offer a very competitive low price. Who is they referring to in this sentence?", "targets": "Amazon", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The master rewarded the dog because he was a good companion. Who is he referring to in this sentence?", "targets": "the dog", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The coach told the captain that he was proud of him. Who is he referring to in this sentence?", "targets": "The coach", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Penguins tend to stay on land to avoid killer whales, but they do need to go in the water for food at times. Who is they referring to in this sentence?", "targets": "Penguins", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The ski instructors taught the children the basics of skiing since they are trying to learn. Who is they referring to in this sentence?", "targets": "the children", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mary stabbed Jennifer, so John took her to the hospital. Who is her referring to in this sentence?", "targets": "Jennifer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The music player did not open the file because it was in the wrong format. Who is it referring to in this sentence?", "targets": "the file", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Apes were determined to be contaminated by disease specialists, but they refused to admit their fault. Who is they referring to in this sentence?", "targets": "disease specialists", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Mavericks are able to sell much merchandise to fans this season since they are idolized due to their last NBA championship win. Who is they referring to in this sentence?", "targets": "The Mavericks", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The master rewarded the dog because he was a good owner. Who is he referring to in this sentence?", "targets": "The master", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The sword was stuck in the tree because it grew up around it. Who is it referring to in this sentence?", "targets": "the tree", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The mother punishes the daughter because she was disobedient. Who is she referring to in this sentence?", "targets": "the daughter", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tom likes John because he likes people with cool names. Who is he referring to in this sentence?", "targets": "Tom", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The FBI usually take over the crime scene from the police since they are more qualified in handling these situations. Who is they referring to in this sentence?", "targets": "The FBI", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rammstein performed their latest hit single to the masses of Germany because they wanted to hear their newest masterpieces. Who is they referring to in this sentence?", "targets": "the masses of Germany", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The youth outran the old man because he broke his hip. Who is he referring to in this sentence?", "targets": "the old man", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bumblebee was sent home with Sam Witwicky to protect him so he is on watch 7 days a week. Who is he referring to in this sentence?", "targets": "Sam Witwicky", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Pizza hut pizzas are tastier than Papa John pizzas because they give less ingredients and cheeses. Who is they referring to in this sentence?", "targets": "Papa John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Hybrid cars are much more fuel efficient than gasoline powered cars, but they are still the most used cars today. Who is they referring to in this sentence?", "targets": "gasoline powered cars", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Yamato Hisaki returned as the Grand Champion to face new challenger, Yoshi Osaka, and despite being new, he hopes to win his title. Who is he referring to in this sentence?", "targets": "Yoshi Osaka", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mike helped Jack with his assignment because he politely asked him to. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Dan modified Harry's car because he asked politely. Who is he referring to in this sentence?", "targets": "Harry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jimbo eats more than Bobbert because he is not on a diet. Who is he referring to in this sentence?", "targets": "Jimbo", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mike helped Jack with his assignment because he felt like doing so. Who is he referring to in this sentence?", "targets": "Mike", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Doctor Jenner continued his work on a vaccine for John, but he is not have much success. Who is he referring to in this sentence?", "targets": "Doctor Jenner", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mike tried to follow Tom but he was hard to see. Who is he referring to in this sentence?", "targets": "Tom", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Positive SSL sells wildcard certificates to Web hosting companies because they require encrypted sites for interaction with customers. Who is they referring to in this sentence?", "targets": "Positive SSL", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The computer could not run the program because it had too many errors. Who is it referring to in this sentence?", "targets": "the program", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack is an optimist, and Adam is a pessimist, then he looks at the cup half empty. Who is he referring to in this sentence?", "targets": "Adam", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The collections agency often goes after delinquent accounts since they try and get the money owed if a person did not pay for several months. Who is they referring to in this sentence?", "targets": "delinquent accounts", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Steve loved Bush but he did not tell. Who is he referring to in this sentence?", "targets": "Steve", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The glass told the toaster that it was fat. Who is it referring to in this sentence?", "targets": "the toaster", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Neil Patrick Harris is a better singer than Dave Chappelle,since he does not have time to become a good singer due to his comedy career. Who is he referring to in this sentence?", "targets": "Dave Chappelle", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Morpheous believed Neo was \"the one\", because he had the potential to be \"the one\". Who is he referring to in this sentence?", "targets": "Neo", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Saudi government beheaded eight Bangladeshis because they killed the Egyptian guard. Who is they referring to in this sentence?", "targets": "eight Bangladeshis", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John tried to bake with Michael, but he said \"I don't like kitchens!\" Who is he referring to in this sentence?", "targets": "Michael", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Lorenze took his son to the hospital because he fell off his bike and hurt his leg. Who is he referring to in this sentence?", "targets": "his son", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "James went to Sully's arcade and he asked for tickets. Who is he referring to in this sentence?", "targets": "James", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Medvedev will cede the presidency to Putin because he is more popular. Who is he referring to in this sentence?", "targets": "Putin", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Katie accused Jane but she was not found guilty. Who is she referring to in this sentence?", "targets": "Jane", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Conservatives differ from Democrats since they normally promote change. Who is they referring to in this sentence?", "targets": "Democrats", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Planet Express was bought out by Mom's Friendly Delivery Service so they can no longer be a threat. Who is they referring to in this sentence?", "targets": "Planet Express", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rosie beat Mary in Scrabble because she had a good vocabulary. Who is she referring to in this sentence?", "targets": "Rosie", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The lifeguards evacuated the swimmers from the public pool because they were in danger of getting sick from human wastes in the water. Who is they referring to in this sentence?", "targets": "the swimmers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Cartman finally decided to get rid of his stuffed animal, Clyde Frog, so he was donated to charity. Who is he referring to in this sentence?", "targets": "Clyde Frog", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John gave a large sum of money to Bill because he had extra. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The infection spread throughout the building because it was ventilated. Who is it referring to in this sentence?", "targets": "the building", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jill outran Kate because she was faster. Who is she referring to in this sentence?", "targets": "Jill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Hill joined Obama because Bill suggested him. Who is him referring to in this sentence?", "targets": "Hill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Student A beat student B, because he slacked off. Who is he referring to in this sentence?", "targets": "student B", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The students protested against the new policies because they were angry. Who is they referring to in this sentence?", "targets": "The students", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Americans preferred Obama to McCain because he chose Sarah Palin as his running-mate. Who is he referring to in this sentence?", "targets": "McCain", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The professor highly recommends the student because he appreciates an inquisitive mind. Who is he referring to in this sentence?", "targets": "The professor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jim Carrey convinced Jeff to travel with him to Aspen, since he had wanted to travel to Aspen for a long time. Who is he referring to in this sentence?", "targets": "Jeff", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The ski instructors taught the children the basics of skiing because they have much experience to share and teach. Who is they referring to in this sentence?", "targets": "The ski instructors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The jocks did not like the nerds because they were losers. Who is they referring to in this sentence?", "targets": "the nerds", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Blue Thunder scored more goals than Green Hogs since they are the better team. Who is they referring to in this sentence?", "targets": "Blue Thunder", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The manager fired the intern because she was too rebellious. Who is she referring to in this sentence?", "targets": "the intern", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Apple customer support is constantly voted better than Microsoft support, because they do not really offer a competitive support plan. Who is they referring to in this sentence?", "targets": "Microsoft support", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "England won the bid over Spain because they did not prepare thoroughly. Who is they referring to in this sentence?", "targets": "Spain", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The golfers waved on the players because they were waiting. Who is they referring to in this sentence?", "targets": "the players", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John hit Carl and he did not like it. Who is he referring to in this sentence?", "targets": "Carl", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Consultants are hired by companies to perform specialized tasks because they are easier to hire than trying to perform a task oneself. Who is they referring to in this sentence?", "targets": "Consultants", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Students hate exams because they are tedious. Who is they referring to in this sentence?", "targets": "exams", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Morpheous believed Neo was \"the one\", because he was fortold by the Oracle this would happen. Who is he referring to in this sentence?", "targets": "Morpheous", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Google bought Motorola because they were bankrupt. Who is they referring to in this sentence?", "targets": "Motorola", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Michael backed Bill because John asked him to. Who is him referring to in this sentence?", "targets": "Michael", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Adam defeated Brandon in a fight because he was weaker. Who is he referring to in this sentence?", "targets": "Brandon", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The professor grading the student's paper said that he was stupid. Who is he referring to in this sentence?", "targets": "the student", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Heath Ledger was considered the greatest Joker of all time by Ebert, but he cannot make that decision for all critics. Who is he referring to in this sentence?", "targets": "Ebert", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Knight Commander Roddick was plagued by a vision of his dead son, so he became crazy from being reminded constantly. Who is he referring to in this sentence?", "targets": "Knight Commander Roddick", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Cowboys formed a trailer defense against the Indians since they are about to attack. Who is they referring to in this sentence?", "targets": "the Indians", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Santa Claus and his elves distributed millions of presents worldwide to the children of the world, because they wish to reward those who behaved. Who is they referring to in this sentence?", "targets": "Santa Claus and his elves", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Cartman wanted Kenny to go to the same school as him because he enjoyed his company. Who is he referring to in this sentence?", "targets": "Cartman", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The company accepted the resolution because it was desperate. Who is it referring to in this sentence?", "targets": "The company", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "George talked to Bill because he had experience. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John picked Bill because he was talented. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chelsea hate Manchester United because they are too cocky. Who is they referring to in this sentence?", "targets": "Manchester United", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bank of America had to charge their members checking fees unlike Chase since they are not struggling in the current economy. Who is they referring to in this sentence?", "targets": "Chase", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The graduate students spend every waking moment studying for their classes since they offer much knowledge and tests as part of their itinerary. Who is they referring to in this sentence?", "targets": "their classes", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cap fell off the bottle because it was untwisted. Who is it referring to in this sentence?", "targets": "The cap", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The mother punished the daughter because she was provoked. Who is she referring to in this sentence?", "targets": "The mother", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The model frowned at her manager because she forgot to call. Who is she referring to in this sentence?", "targets": "her manager", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The pilots saved the passengers because they begged them to. Who is they referring to in this sentence?", "targets": "the passengers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The hammer hit the bullet, so it shot. Who is it referring to in this sentence?", "targets": "the bullet", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Doctor Conrad Murray is accused of negligence in Michael Jackson's death because he was the doctor on site when the drug overdose took place. Who is he referring to in this sentence?", "targets": "Doctor Conrad Murray", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bethesda launched a new title, Skyrim, to raving reviews by gamers so they will now most likely buy their next title as well. Who is they referring to in this sentence?", "targets": "gamers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jacob misled Amen so David fired him. Who is him referring to in this sentence?", "targets": "Jacob", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The waitress noticed that Rebecca's glass was empty, so she handed her the glass to fill it. Who is she referring to in this sentence?", "targets": "Rebecca", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The gardener watered the owner's rose because he was doing his job. Who is he referring to in this sentence?", "targets": "The gardener", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Anna tucked Olivia into bed because she fell asleep on the couch. Who is she referring to in this sentence?", "targets": "Olivia", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Emily asked Anna to stir the pot, but she did not do it. Who is she referring to in this sentence?", "targets": "Anna", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jennifer Aniston does not like Angelina Jolie because she is jealous of her relationship. Who is she referring to in this sentence?", "targets": "Jennifer Aniston", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Swiss bank freezed the accounts of a crime syndicate because they were helping law enforcement catch the criminals. Who is they referring to in this sentence?", "targets": "The Swiss bank", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The army crossed the river because it was shallow. Who is it referring to in this sentence?", "targets": "the river", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The coach criticized the player because he did not adhere to the team's formation. Who is he referring to in this sentence?", "targets": "the player", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The security forces were not able to stop the mass of apes because they simply had them outnumbered. Who is they referring to in this sentence?", "targets": "the mass of apes", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The product fair showed Office 365, and it had a lot of attendees. Who is it referring to in this sentence?", "targets": "The product fair", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Hybrid cars are much more fuel efficient than gasoline powered cars, but they have not caught on in popularity yet. Who is they referring to in this sentence?", "targets": "Hybrid cars", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Caesar the ape found out the door code by watching Morris, because he was careless when typing in the code. Who is he referring to in this sentence?", "targets": "Morris", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Stephanie gave Brandy flowers because she was sick. Who is she referring to in this sentence?", "targets": "Brandy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mark tackled the quarterback, but he was penalized. Who is he referring to in this sentence?", "targets": "Mark", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Lions eat zebras because they are predators. Who is they referring to in this sentence?", "targets": "Lions", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bill returned Jim twenty dollars because he borrowed money. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John appreciated Bill because he had been in need. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The judge was fond of the contestant so he voted favorably. Who is he referring to in this sentence?", "targets": "The judge", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Naruto has about 200 more episodes than Code Geass because they have a long interesting storyline. Who is they referring to in this sentence?", "targets": "Naruto", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The carpenters came before the painters since they need to build the furniture first. Who is they referring to in this sentence?", "targets": "The carpenters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kenmore is known for making superb appliances which is sold at Sears since they constantly leave customers happy with their high quality brand. Who is they referring to in this sentence?", "targets": "Kenmore", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rocky won the match with Richard because he worked hard. Who is he referring to in this sentence?", "targets": "Rocky", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The junior football team likes the Dallas Cowboys because they get to watch quality football. Who is they referring to in this sentence?", "targets": "The junior football team", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jimbo attacked Bobbert because he stole an elephant from the zoo. Who is he referring to in this sentence?", "targets": "Bobbert", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Space Marines are played more often than Orks, but they are noticed more often at tournaments due to their uniqueness. Who is they referring to in this sentence?", "targets": "Orks", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Peacocks are considered very majestic birds by bird watchers, but they know it is just a perception of how they see things. Who is they referring to in this sentence?", "targets": "bird watchers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cap fell off the bottle because it was pressurized. Who is it referring to in this sentence?", "targets": "the bottle", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The environmentalists were angry at the corporation because they had ignored their proposal. Who is they referring to in this sentence?", "targets": "the corporation", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jimbo eats more than Bobbert because he is on a diet. Who is he referring to in this sentence?", "targets": "Bobbert", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bill triumphed over John in the boxing ring because he fought smarter. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jill loves Jamie and she bought her a ring. Who is she referring to in this sentence?", "targets": "Jill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Coach Jay provided instruction to his son on how to eat healthy so that he can live longer. Who is he referring to in this sentence?", "targets": "his son", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The security patrol searched the land for survivors because they might still be alive. Who is they referring to in this sentence?", "targets": "survivors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John hit Carl and he hit back. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The heavy weapons team bombarded the settlement with their mortars since they needed to soften up the enemy before moving in. Who is they referring to in this sentence?", "targets": "The heavy weapons team", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Doctor Igor was interrogated by Colonel Marshall because he had vital information on the location of enemy forces. Who is he referring to in this sentence?", "targets": "Doctor Igor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mr. Sanders gave James a promotion because he has done good work. Who is he referring to in this sentence?", "targets": "James", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Emma did not pass the ball to Janie, although she should have. Who is she referring to in this sentence?", "targets": "Emma", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "We gave the toys to the toddlers, because they wanted to play. Who is they referring to in this sentence?", "targets": "the toddlers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John shot Jack, the elephant, in my pajamas, but he did not know how it got there. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Amazon predicted that oldies fans would like the Queen, Led Zeppelin, Frank Sinatra, The Beatles, and the Dave Matthews Band, but they do not actually care for any of these bands. Who is they referring to in this sentence?", "targets": "oldies fans", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gun instructors provide the best tips and practices to keep their students safe from firearm usage since they have years of experience from handling guns in their lifetime. Who is they referring to in this sentence?", "targets": "Gun instructors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Doctor Chen prescribed glasses to Egore, since he conducted the eye exam. Who is he referring to in this sentence?", "targets": "Doctor Chen", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rocky lost to Clubber Lang because he was not ready for the fight. Who is he referring to in this sentence?", "targets": "Rocky", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Burt installed Joey's software, and he installed his hardware too. Who is he referring to in this sentence?", "targets": "Burt", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The counselor gave the student advice because he is on the wrong track in life. Who is he referring to in this sentence?", "targets": "the student", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The peace emissaries arrived to negotiate a peace treaty for the warring population, but they will be difficult to find common ground for. Who is they referring to in this sentence?", "targets": "the warring population", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The shipping company harvests lobster for their business, since they are considered an exquisite meal. Who is they referring to in this sentence?", "targets": "lobster", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gary envied Bill because he was rich. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "People raise dogs because they are afraid of thieves. Who is they referring to in this sentence?", "targets": "People", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Joe tried to get Tom to wake up, but he wouldn't. Who is he referring to in this sentence?", "targets": "Tom", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Naruto has about 200 more episodes then Code Geass because they finished the story in much fewer episodes. Who is they referring to in this sentence?", "targets": "Code Geass", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A policeman saw John Edwards commit the crime, so he apprehended the criminal. Who is he referring to in this sentence?", "targets": "A policeman", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jerrica saw the guard as she snuck past. Who is she referring to in this sentence?", "targets": "Jerrica", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Apple sued Samsung because they felt their intellectual properties were being infringed upon. Who is they referring to in this sentence?", "targets": "Apple", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Apple customer support is constantly voted better than Microsoft support, because they provide a much better plan for a subscription price. Who is they referring to in this sentence?", "targets": "Apple customer support", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Simon Cowell makes fun of Ryan Seacrest since he is viewed as feminine. Who is he referring to in this sentence?", "targets": "Ryan Seacrest", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The food in the refrigerator went bad because it was past the expiration date. Who is it referring to in this sentence?", "targets": "The food", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Allen laughed at Jimmy because he told a funny joke. Who is he referring to in this sentence?", "targets": "Jimmy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The students fell asleep during the professor's lectures because they were bored. Who is they referring to in this sentence?", "targets": "The students", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "T-Mobile's data plan is better than AT&T's data plan since it throttles user for excessive data usage. Who is it referring to in this sentence?", "targets": "AT&T", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Insurance companies charge a premium if people had an accident before, so they try to maintain a clean record in order to avoid having to pay more. Who is they referring to in this sentence?", "targets": "people", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Batman caught the thief, and he plead innocence. Who is he referring to in this sentence?", "targets": "the thief", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "When Sue went to Nadia's home for dinner, she ate sukiyaki au gratin. Who is she referring to in this sentence?", "targets": "Nadia", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Fry's Electronics is more successful than Comp USA since they price their products much lower. Who is they referring to in this sentence?", "targets": "Fry's Electronics", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Hunters excel in tracking animals because they often leave some sort of mark when traveling through the forest. Who is they referring to in this sentence?", "targets": "animals", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "New York is very crowded compared to South Dakota, but they have much more land instead. Who is they referring to in this sentence?", "targets": "South Dakota", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Janice bought Kenda a car because she has money to spend. Who is she referring to in this sentence?", "targets": "Janice", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Apple sued Samsung because they made a product that has similarities with their own. Who is they referring to in this sentence?", "targets": "Samsung", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "American Airlines offers upgrades for their preferred passengers since they want them to continue flying with them. Who is they referring to in this sentence?", "targets": "American Airlines", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Harrison looked into illegal accusations against his partner, Bryan, because he needed to know if these allegations would hurt his business. Who is he referring to in this sentence?", "targets": "Harrison", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Computers outsell laptops because they are more powerful. Who is they referring to in this sentence?", "targets": "Computers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The father convinced his son that it is possible for him to one day become a knight, but he may never achieve such status coming from a peasant family. Who is he referring to in this sentence?", "targets": "his son", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack raced past Dan since his car is old. Who is his referring to in this sentence?", "targets": "Dan", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John thanked Bill because he had needed help. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The group grew tired of making these sentences because they are lazy. Who is they referring to in this sentence?", "targets": "The group", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "New York City was grateful for the sacrifices the American Armed Forces did to save their city because they managed to divert a devastating attack. Who is they referring to in this sentence?", "targets": "the American Armed Forces", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bob killed Vincent because he was stealing drugs. Who is he referring to in this sentence?", "targets": "Vincent", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jim was staring at the guy with the snowboard, because he was doing tricks. Who is he referring to in this sentence?", "targets": "the guy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Our professor told the TA that he needed his help. Who is he referring to in this sentence?", "targets": "Our professor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Todd told Bill that he needed some money. Who is he referring to in this sentence?", "targets": "Todd", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "When Sue went to Nadia's home for dinner, she caught the wrong bus and arrived late. Who is she referring to in this sentence?", "targets": "Nadia", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police arrested the criminals since they break the law. Who is they referring to in this sentence?", "targets": "the criminals", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Adrian Peterson has more touchdowns than Reggie Bush because he cannot run the ball as well. Who is he referring to in this sentence?", "targets": "Reggie Bush", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "AOL finally had their CEO step down to respect the wishes of the stakeholders because they needed to listen to their investors. Who is they referring to in this sentence?", "targets": "AOL", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Thor was banished from the kingdom by his father because he was too eager to become the new king. Who is he referring to in this sentence?", "targets": "Thor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Spiderman defeated Magnito because he is a bad guy. Who is he referring to in this sentence?", "targets": "Magnito", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Johnson wanted to make friendship with David, because he is well connected. Who is he referring to in this sentence?", "targets": "David", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Fred drove to Mack's tire shop, and he sold a tire. Who is he referring to in this sentence?", "targets": "Mack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The coach criticized the player because he explicitly told everyone not to break the team's formation. Who is he referring to in this sentence?", "targets": "The coach", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Professors do a lot for students, but they are rarely respected. Who is they referring to in this sentence?", "targets": "Professors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chelsea hate Manchester United because they always come in second. Who is they referring to in this sentence?", "targets": "Chelsea", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Olivia tried to counsel Emily, but she was not interested. Who is she referring to in this sentence?", "targets": "Emily", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Katy cried for Susan since she died. Who is she referring to in this sentence?", "targets": "Susan", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Beowulf was granted a magical artifact by King Henry that emitted a light so he would be able to see in the dark caves. Who is he referring to in this sentence?", "targets": "Beowulf", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Michael backed Bill because John really liked him. Who is him referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The game distribution platform \"Origin\" will have exclusive EA games that competitor \"Steam\" will not have, because they could not obtain rights to those titles. Who is they referring to in this sentence?", "targets": "Steam", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The hippo ate the food the trainer brought when he was hungry. Who is he referring to in this sentence?", "targets": "The hippo", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Obama had a meeting with Cantor, where he showed his disapproval of his jobs bill. Who is he referring to in this sentence?", "targets": "Cantor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Modern Warfare has big expectations to live up to due to the successful release of Battlefield 3 since they need to pull fans to their game instead. Who is they referring to in this sentence?", "targets": "Modern Warfare", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sir Rodrick was made specialized fitted armor by Jack, but he charged top coin for such a piece. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Caesar the ape found out the door code by watching Morris, so he was able to escape. Who is he referring to in this sentence?", "targets": "Caesar the ape", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Prince Goro lectured Cano about the greatness of the emperor since he wanted to make him understand his power. Who is he referring to in this sentence?", "targets": "Prince Goro", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The US president had a meeting with the Chinese president, where he told him not to interfere with China's internal policy. Who is he referring to in this sentence?", "targets": "the Chinese president", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Keith fired Blaine even though he is diligent. Who is he referring to in this sentence?", "targets": "Blaine", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The waitress noticed that Rebecca's glass was empty, so she filled it. Who is she referring to in this sentence?", "targets": "The waitress", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The invaders showed no mercy to the defenders because they are a vicious and unforgiving people. Who is they referring to in this sentence?", "targets": "The invaders", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Amazon recently upstaged Gamestop on Battlefield 3 pre-orders because they lowered their price 30 percent below the competitor. Who is they referring to in this sentence?", "targets": "Amazon", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cow ran into the fence and it got hurt. Who is it referring to in this sentence?", "targets": "The cow", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The professor grading the student's paper said that he loved it. Who is he referring to in this sentence?", "targets": "The professor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Caroline quickly defeated Sue because she regained her confidence. Who is she referring to in this sentence?", "targets": "Caroline", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The citizens rebelled against the government because they were being mean. Who is they referring to in this sentence?", "targets": "the government", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sally was really happy that Beth finally got a job because she had been unemployed for years. Who is she referring to in this sentence?", "targets": "Beth", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Intel sued IntelSpec since they happen to have a trademarked brand in their company name. Who is they referring to in this sentence?", "targets": "IntelSpec", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Four wheel drive cars are used for rally racing instead of rear wheel cars because they do not race well off road. Who is they referring to in this sentence?", "targets": "rear wheel cars", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The orchestra was booed by the audience because they had performed poorly. Who is they referring to in this sentence?", "targets": "The orchestra", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Roman legion attacked the Persians because they had invaded. Who is they referring to in this sentence?", "targets": "the Persians", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Walmart is enforcing strict guidelines for customers this Black Friday because they do not want a recap of the disaster that occurred the previous year. Who is they referring to in this sentence?", "targets": "Walmart", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The glass hit the floor and it broke. Who is it referring to in this sentence?", "targets": "The glass", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Allen chased the leprechaun because he had a pot of gold. Who is he referring to in this sentence?", "targets": "the leprechaun", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Brock understood the material better than Tracy because he was paying attention. Who is he referring to in this sentence?", "targets": "Brock", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The coach told the captain that he was fired. Who is he referring to in this sentence?", "targets": "the captain", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jimbo ate the fish that Bobbert prepared because he was a good cook. Who is he referring to in this sentence?", "targets": "Bobbert", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The other student corrected Robert because he had misunderstood the problem. Who is he referring to in this sentence?", "targets": "Robert", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Professors give a lot of advice to students, but they rarely care. Who is they referring to in this sentence?", "targets": "students", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Will Smith and his new movie is highly anticipated by movie critic, John Billic, because he felt his role was well played in the previous movies. Who is he referring to in this sentence?", "targets": "John Billic", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mary cleaned Susan's room and she was thankful. Who is she referring to in this sentence?", "targets": "Susan", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "DC Universe went free to play while World of Warcraft is subscription based, because they have maintained enough users to continue with their current payment model. Who is they referring to in this sentence?", "targets": "World of Warcraft", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cops maced the protesters because they do not blindly follow orders. Who is they referring to in this sentence?", "targets": "the protesters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Nvidia is giving away two top of the line laptops to its users, so they have a chance to get them for free. Who is they referring to in this sentence?", "targets": "its users", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John asked the scientist what he could do to help. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police arrested 700 protesters in New York since they had to prevent them from blocking the Manhatten bridge. Who is they referring to in this sentence?", "targets": "700 protesters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gary envied Bill because he was poor. Who is he referring to in this sentence?", "targets": "Gary", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mark almost made a deal with Slimy Jack, but backed down when the man thought of his reputation for honesty. Who is the man referring to in this sentence?", "targets": "Mark", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The ball hit the window and Bill repaired it. Who is it referring to in this sentence?", "targets": "the window", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The older male cat is bullying the new younger male cat so he has been submissive. Who is he referring to in this sentence?", "targets": "the new younger male cat", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Horses are faster at short distances than camels, but they can travel much further distances. Who is they referring to in this sentence?", "targets": "camels", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "New Orleans is renown for their unique style of crawfish so they have many restaurants which sell it. Who is they referring to in this sentence?", "targets": "New Orleans", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The US army fought the Taliban because they are trying to prevent terrorism. Who is they referring to in this sentence?", "targets": "The US army", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Snooki got angry at Kendra since she would not emotionally support her in her time of need. Who is she referring to in this sentence?", "targets": "Kendra", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Lions eat zebras because they are meaty. Who is they referring to in this sentence?", "targets": "zebras", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The lifeguards evacuated the swimmers from the public pool since they needed to clean the pool. Who is they referring to in this sentence?", "targets": "The lifeguards", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "U.S. Authors are fighting against Amazon's book lending program since they feel it violated their publishing rights. Who is they referring to in this sentence?", "targets": "U.S. Authors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Conservatives differ from Democrats since they normally resist change. Who is they referring to in this sentence?", "targets": "Conservatives", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "England won the bid over Spain because they prepared better. Who is they referring to in this sentence?", "targets": "England", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Daryel told Ross that he was the ugliest person he knew of after examining himself disapprovingly in the mirror. Who is he referring to in this sentence?", "targets": "Daryel", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Soldiers of the armed forces were slowly being phased out by genetically engineered soldiers because they were created solely for the purpose of excelled warfare. Who is they referring to in this sentence?", "targets": "genetically engineered soldiers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The computer rejected the password because it was incorrect. Who is it referring to in this sentence?", "targets": "the password", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Amazon predicted that oldies fans would like the Queen, Led Zeppelin, Frank Sinatra, The Beatles, and the Dave Matthews Band, but they were totally inaccurate. Who is they referring to in this sentence?", "targets": "Amazon", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Medics have a tough job of trying to heal the wounded since they normally have to fix them in hostile environments. Who is they referring to in this sentence?", "targets": "Medics", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mark almost made a deal with Slimy Jack, but backed down when the man was caught embezzling. Who is the man referring to in this sentence?", "targets": "Slimy Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Paper beats rock, but it is able to beat scissors. Who is it referring to in this sentence?", "targets": "rock", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "There is currently more work on coreference resolution than on chunking because it is a problem that is nearly solved. Who is it referring to in this sentence?", "targets": "chunking", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "It annoyed Chris when Sebastian jangled his keys because he was in a bad mood. Who is he referring to in this sentence?", "targets": "Chris", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The river destroyed the bridge because it was low. Who is it referring to in this sentence?", "targets": "the bridge", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Martial Arts actors are often accused as being frauds by the public since they think they can only fight in fake scenarios. Who is they referring to in this sentence?", "targets": "the public", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Google bought Motorola because they want its customer base. Who is they referring to in this sentence?", "targets": "Google", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tom gave James a coat because he was generous. Who is he referring to in this sentence?", "targets": "Tom", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Paul made fun of Henry since he knew everyone else did. Who is he referring to in this sentence?", "targets": "Paul", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The glass told the toaster that it liked chocolate. Who is it referring to in this sentence?", "targets": "The glass", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John visited his son so he would feel loved. Who is he referring to in this sentence?", "targets": "his son", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John kicked Bill because he was being mean. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sharon was not able to share her supplies with Molly because she did not have enough to spare. Who is she referring to in this sentence?", "targets": "Sharon", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mary lied to Sue and she slapped her. Who is she referring to in this sentence?", "targets": "Sue", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The US army fought the Taliban because they are the root of much terrorism. Who is they referring to in this sentence?", "targets": "the Taliban", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gladiators are viewed better than Slaves because they fight to the death in the arena. Who is they referring to in this sentence?", "targets": "Gladiators", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The children played games because they were bored. Who is they referring to in this sentence?", "targets": "The children", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The teachers failed the students because they answered the test incorrectly. Who is they referring to in this sentence?", "targets": "the students", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cat broke the glass because it was clumsy. Who is it referring to in this sentence?", "targets": "The cat", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bioware recently announced a stress test to beta users this weekend since they need to see the performance of their servers. Who is they referring to in this sentence?", "targets": "Bioware", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The man asked Mark the question again because he was curious. Who is he referring to in this sentence?", "targets": "The man", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John tricked Bill because he was mischievous. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "MIT accepted the students, because they decided that they were the best. Who is they referring to in this sentence?", "targets": "MIT", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Pirates are always compared to ninjas, but they are more specific to Japanese culture. Who is they referring to in this sentence?", "targets": "ninjas", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Randy went to Nick's store, and looked at his groceries. Who is his referring to in this sentence?", "targets": "Nick", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police arrested the criminals since they enforce the law. Who is they referring to in this sentence?", "targets": "The police", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The mouse ran from the cat all the way to the kitchen because it chased him. Who is it referring to in this sentence?", "targets": "the cat", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Ken has Adam's bike, because he took it from him. Who is he referring to in this sentence?", "targets": "Ken", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "McDonalds has many more restaurants than Chick Filet worldwide because they are not able to expand their business outside the United States. Who is they referring to in this sentence?", "targets": "Chick Filet", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sam helped Davey fortify their bunker because he thought the Mexicans were invading. Who is he referring to in this sentence?", "targets": "Davey", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Fry's Electronics is more successful than Comp USA since they cannot compete competitively in price. Who is they referring to in this sentence?", "targets": "Comp USA", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John remembered Bill because he was memorable. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The army organized their forces to sneak past the Decepticons in the city because they needed to use stealth to their advantage. Who is they referring to in this sentence?", "targets": "The army", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Coach Jay provided instruction to his son on how to eat healthy, because he wants him to grow up being fit and strong. Who is he referring to in this sentence?", "targets": "Coach Jay", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sarah went to Kelly's house because she was home. Who is she referring to in this sentence?", "targets": "Kelly", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The mysterious creature is drinking whiskey because it tastes good. Who is it referring to in this sentence?", "targets": "whiskey", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sharon was not able to share her supplies with Molly, even though she desperately needs supplies. Who is she referring to in this sentence?", "targets": "Molly", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The ball hit the window and Bill caught it. Who is it referring to in this sentence?", "targets": "The ball", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Aaron kissed Dan because he wanted to. Who is he referring to in this sentence?", "targets": "Aaron", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Liu Kang used the element of water against Sub Zero since he was able to turn it into ice as a weapon. Who is he referring to in this sentence?", "targets": "Liu Kang", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The students fell asleep during the professor's lectures because they were boring. Who is they referring to in this sentence?", "targets": "the professor's lectures", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The heavy weapons team bombarded the settlement with their mortars even though they were unarmed. Who is they referring to in this sentence?", "targets": "the settlement", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Centurion lent Doctor Who his ear since he had pledged his loyalty. Who is he referring to in this sentence?", "targets": "The Centurion", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The kidnapper will not return Trent Reznor until he agrees to a private performance. Who is he referring to in this sentence?", "targets": "Trent Reznor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Japanese eat a lot more seafood than the Americans because they have a lot of people who do not live near the ocean. Who is they referring to in this sentence?", "targets": "the Americans", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Board of Directors fired the management from the company since they were not managing the company well. Who is they referring to in this sentence?", "targets": "the management", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Magnificent Five will battle it out with Shen Yu's forces because they will need to end his rein of terror. Who is they referring to in this sentence?", "targets": "The Magnificent Five", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The employees of Six Flags denied the customers access to the ride since they deemed the ride unsafe. Who is they referring to in this sentence?", "targets": "The employees of Six Flags", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "People like dogs but they do not like cats. Who is they referring to in this sentence?", "targets": "People", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The glass hit the floor and it scratched. Who is it referring to in this sentence?", "targets": "the floor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Blue Thunder scored more goals than Green Hogs since they are not very good at the game. Who is they referring to in this sentence?", "targets": "Green Hogs", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Master Sifu passes wisdom on to Jack because he has much to teach him. Who is he referring to in this sentence?", "targets": "Master Sifu", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The golfers waved on the players because they were holding them up. Who is they referring to in this sentence?", "targets": "The golfers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Pizza hut pizzas are tastier than Papa John pizzas because they give more ingredients and cheeses. Who is they referring to in this sentence?", "targets": "Pizza", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jessica did not like Selma cutting her hair short, but she ended up loving her new style. Who is she referring to in this sentence?", "targets": "Jessica", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "William enforced a mandatory choir practice for Ryan since he is struggling with his singing abilities. Who is he referring to in this sentence?", "targets": "Ryan", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Neil Patrick Harris is a better singer than Dave Chappelle, since he had experience from Broadway. Who is he referring to in this sentence?", "targets": "Neil Patrick Harris", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The invaders showed no mercy to the defenders, but they would not surrender anyway. Who is they referring to in this sentence?", "targets": "the defenders", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Some people proclaimed at the Ontario conventions that we need to colonize planets in the near future because they think we may face extinction if Aliens ever came for our resources. Who is they referring to in this sentence?", "targets": "Some people", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jim went to Hal's house, and brought his dog. Who is his referring to in this sentence?", "targets": "Jim", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cat looked at the big dog, and it was terrified. Who is it referring to in this sentence?", "targets": "The cat", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The spider ate the fly because he looked tasty. Who is he referring to in this sentence?", "targets": "the fly", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The home team lost to the Giants because they were better players. Who is they referring to in this sentence?", "targets": "the Giants", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Steve Ballmer took over as CEO of Microsoft after Bill Gates because he was a unicorn. Who is he referring to in this sentence?", "targets": "Steve Ballmer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Taco needs hot sauce because it improves the flavor. Who is it referring to in this sentence?", "targets": "hot sauce", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Ebay is often considered a great source by deal hunters to buy products, even though they often see misleading descriptions. Who is they referring to in this sentence?", "targets": "deal hunters", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "A dog chewed a bone and it barked. Who is it referring to in this sentence?", "targets": "A dog", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Nvidia is giving away two top of the line laptops to its users, so they will be giving them away for free. Who is they referring to in this sentence?", "targets": "Nvidia", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cops maced the protesters because they blindly follow orders. Who is they referring to in this sentence?", "targets": "The cops", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bethesda launched a new title, Skyrim, to raving reviews by gamers because they produced an excellent story to immense the player. Who is they referring to in this sentence?", "targets": "Bethesda", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Medvedev will cede the presidency to Putin because he is less popular. Who is he referring to in this sentence?", "targets": "Medvedev", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John bored Bill because he was boring. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sir Rodrick was made specialized fitted armor by Jack, because he needed armor that could withstand the power of a lance. Who is he referring to in this sentence?", "targets": "Sir Rodrick", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The car hop brought the man his tray, but he forgot his french fries. Who is he referring to in this sentence?", "targets": "The car hop", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jimbo was running from Bobbert because he wanted to get to the car first. Who is he referring to in this sentence?", "targets": "Jimbo", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Field Reporter Chris Johnson interviewed Corporal Mason because he can provide information from fighting on the front line. Who is he referring to in this sentence?", "targets": "Corporal Mason", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Adam defeated Brandon in a fight because he was stronger. Who is he referring to in this sentence?", "targets": "Adam", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The mechanic charged the man one hundred dollars although he only had eighty dollars. Who is he referring to in this sentence?", "targets": "the man", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Darth Vader said to Luke Skywalker, \"I am your father\", because he was his son. Who is he referring to in this sentence?", "targets": "Luke Skywalker", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Zidane headbutted Zambrotta because he could not control his anger. Who is he referring to in this sentence?", "targets": "Zidane", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The employer let John have the assignment even though he did not want it. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Shigeru Miyamoto was the mentor of Satoshi Tajiri, so he learned many things. Who is he referring to in this sentence?", "targets": "Satoshi Tajiri", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The AirForce is more appealing than the Army, but they are just as important. Who is they referring to in this sentence?", "targets": "the Army", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bill punched Larry and he was hurt. Who is he referring to in this sentence?", "targets": "Larry", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jim pooped on Jack and he vomited. Who is he referring to in this sentence?", "targets": "Jack", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The pilots saved the passengers because they had a civic duty. Who is they referring to in this sentence?", "targets": "The pilots", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Justin Bieber sold many more albums than Jack Johnson, but he is also very unpopular among older adults. Who is he referring to in this sentence?", "targets": "Justin Bieber", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tom asked his son to drive so that he could sleep. Who is he referring to in this sentence?", "targets": "Tom", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The cougar tried to befriend the rabbit because it was loved by everybody. Who is it referring to in this sentence?", "targets": "the rabbit", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Cheesecake is better than fruitcake because it is gross. Who is it referring to in this sentence?", "targets": "fruitcake", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sally kicked Mary and she apologized. Who is she referring to in this sentence?", "targets": "Sally", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Cathy let Joanna into her car, so she could take a test drive. Who is she referring to in this sentence?", "targets": "Joanna", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jackie Chan is starting to become like Chuck Norris since he retired at the age he has now reached. Who is he referring to in this sentence?", "targets": "Chuck Norris", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John nicked Bill because he was gullible. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "To save the world, Liu Kang must defeat Shang Hai in mortal combat, but if he fails, then the world as he knows it will fall. Who is he referring to in this sentence?", "targets": "Liu Kang", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Males always outnumber females at Comic Con since they are generally more interested in games and comics. Who is they referring to in this sentence?", "targets": "Males", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Lions love gazelles because they eat them. Who is they referring to in this sentence?", "targets": "Lions", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Penguins tend to stay on land to avoid killer whales, because they cannot go on land. Who is they referring to in this sentence?", "targets": "killer whales", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jacob gave William money because he sold the car. Who is he referring to in this sentence?", "targets": "Jacob", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Gates is richer than Jobs, so he is not richest person. Who is he referring to in this sentence?", "targets": "Jobs", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The mechanic charged the man one hundred dollars although he had done no work. Who is he referring to in this sentence?", "targets": "The mechanic", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chase will have a cyber monday sale for credit users, but they may not necessarily care about the sale. Who is they referring to in this sentence?", "targets": "credit users", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bob Marley shot the sheriff, but he survived. Who is he referring to in this sentence?", "targets": "the sheriff", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chevrolet had to recently recall their cars so they could receive a repair in their brakes. Who is they referring to in this sentence?", "targets": "their cars", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The gun owner fired at the burglar because he stole items. Who is he referring to in this sentence?", "targets": "the burglar", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The government placed a tax on the product so it got more expensive. Who is it referring to in this sentence?", "targets": "the product", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "People like dogs because they look like them. Who is they referring to in this sentence?", "targets": "dogs", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The teacher told the student that he needed to practice. Who is he referring to in this sentence?", "targets": "the student", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police arrested the rioters because they were preventing trouble. Who is they referring to in this sentence?", "targets": "The police", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Union defeated the Confederates in the Civil war since they had better resources and numbers. Who is they referring to in this sentence?", "targets": "The Union", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tiger Woods dropped Randy as his caddy because he was not satisfied with his work. Who is he referring to in this sentence?", "targets": "Tiger Woods", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Roman legion attacked the Persians because they felt threatened. Who is they referring to in this sentence?", "targets": "The Roman legion", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bengali is morphologically richer than English, so its vocabulary is larger. Who is its referring to in this sentence?", "targets": "Bengali", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Apes were determined to be contaminated by disease specialists, so they were forced to be released in secured captivity. Who is they referring to in this sentence?", "targets": "The Apes", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Board of Directors fired the management from the company since they did not think they were doing a good job. Who is they referring to in this sentence?", "targets": "The Board of Directors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Lucy gave a tutorial on how to install IOS 5 to Cindy because she is not very technologically savvy. Who is she referring to in this sentence?", "targets": "Cindy", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The police captured the criminals because they were less prepared. Who is they referring to in this sentence?", "targets": "the criminals", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "My parents gave the neighbors tickets to Six Flags since they needed them. Who is they referring to in this sentence?", "targets": "the neighbors", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rob was granted a gun license while Jon was not, because he had a criminal past. Who is he referring to in this sentence?", "targets": "Jon", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The young up-and-comer destroyed the old veteran Star in the shootout, so he got benched for the rest of the season. Who is he referring to in this sentence?", "targets": "the old veteran Star", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jill was writing on a pad for Jane because she wanted to leave her address. Who is she referring to in this sentence?", "targets": "Jill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack pushed Tim down the stairs and he slipped to the ground. Who is he referring to in this sentence?", "targets": "Tim", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The sheep chased the pig because it was fat. Who is it referring to in this sentence?", "targets": "the pig", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The peace emissaries arrived to negotiate a peace treaty for the warring population, since they wish to assist in ending the war. Who is they referring to in this sentence?", "targets": "The peace emissaries", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Buy More Book Store sends brand new books to customers because they like quality in the books they read. Who is they referring to in this sentence?", "targets": "customers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Parents send their children to bed, and they have to listen to authority since they are dependents. Who is they referring to in this sentence?", "targets": "their children", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kenmore is known for making superb appliances which is sold at Sears, because they are the best place to sell top brand appliances. Who is they referring to in this sentence?", "targets": "Sears", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jill was writing on a pad for Jane because she needed directions. Who is she referring to in this sentence?", "targets": "Jane", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jim taught John rhetoric to become a lawyer, but he did not pay him. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The US Health inspection board shut down several food factories since they were violating many rules and regulations. Who is they referring to in this sentence?", "targets": "several food factories", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The forensic team managed to link the criminals to the crime, so they are now going to go to prison. Who is they referring to in this sentence?", "targets": "the criminals", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The man gave the beggar some money because he was very generous. Who is he referring to in this sentence?", "targets": "The man", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The infection spread throughout the building because it was airborne. Who is it referring to in this sentence?", "targets": "The infection", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Police sweep bums off the benches of the park although they do not have a place to stay and sleep at night. Who is they referring to in this sentence?", "targets": "bums", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The chef made breakfast for the captain because he required food. Who is he referring to in this sentence?", "targets": "the captain", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Simpsons have lasted 23 seasons while The Sarah Connor Chronicles lasted two seasons, since they did not provide a very good show. Who is they referring to in this sentence?", "targets": "The Sarah Connor Chronicles", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sarah tried to ignore the elephant in the room, but she would not stop trumpeting. Who is she referring to in this sentence?", "targets": "the elephant in the room", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Kyle purchased three new monitors due to a recommendation by his brother, because he provided information on how his productivity increased with more working space. Who is he referring to in this sentence?", "targets": "his brother", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Medics have a tough job of trying to heal the wounded because they are normally hurt in dangerous scenarios. Who is they referring to in this sentence?", "targets": "the wounded", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Keith fired Blaine but he did not regret. Who is he referring to in this sentence?", "targets": "Keith", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The starships transported the colonists to their new planet, but they still need to transport several more waves of people. Who is they referring to in this sentence?", "targets": "The starships", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The bird ate the pie and it died. Who is it referring to in this sentence?", "targets": "The bird", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Jack shouted at Bill because he crashed the car. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The elephant trampled a fish and it died. Who is it referring to in this sentence?", "targets": "a fish", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The X-Factor is starting to overtake American Idol in the ratings race since they have the popular Simon Cowell as the judge. Who is they referring to in this sentence?", "targets": "The X-Factor", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Simon Cowell makes fun of Ryan Seacrest since he feels superior. Who is he referring to in this sentence?", "targets": "Simon Cowell", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Peter Griffin often pokes fun at Chris, because he enjoys doing it. Who is he referring to in this sentence?", "targets": "Peter Griffin", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Alexandra told Kelly not to get a tattoo because she raised her conservatively. Who is she referring to in this sentence?", "targets": "Alexandra", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "I think the referee treats Vick like a running back because he does not understand the game. Who is he referring to in this sentence?", "targets": "the referee", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Johnny Cage had to trick Scorpion into stretching himself out too thin since he could not win without fighting smart. Who is he referring to in this sentence?", "targets": "Johnny Cage", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Stephen Colbert is funnier than John Stewart since his show has less viewers. Who is his referring to in this sentence?", "targets": "John Stewart", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sally kicked Mary and she was hurt. Who is she referring to in this sentence?", "targets": "Mary", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mike cut his finger while watching Chef Michaels on TV because he was not paying attention to his task at hand. Who is he referring to in this sentence?", "targets": "Mike", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The band loves their fans because they cannot exist without support. Who is they referring to in this sentence?", "targets": "The band", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Sam hates Martha Stewart, because she felt that she was hypocritical. Who is she referring to in this sentence?", "targets": "Sam", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The model frowned at her manager because she was sad. Who is she referring to in this sentence?", "targets": "The model", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The nurse gave the girl a lollypop so that she would stop crying. Who is she referring to in this sentence?", "targets": "the girl", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The boy tried to address his friend, but he could not hear. Who is he referring to in this sentence?", "targets": "his friend", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The junior football team likes the Dallas Cowboys because they are an inspiration. Who is they referring to in this sentence?", "targets": "the Dallas Cowboys", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The mother encouraged her daughter to sing a difficult song so she could see her become better. Who is she referring to in this sentence?", "targets": "The mother", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Butters wanted to steal the movie Spiderman from Kenny because he would not lend it to him. Who is he referring to in this sentence?", "targets": "Kenny", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The gun owner fired at the burglar because he saw a shadow. Who is he referring to in this sentence?", "targets": "The gun owner", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Clinton wanted Obama to run for president because he would win. Who is he referring to in this sentence?", "targets": "Obama", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Samsonite makes luggage which is highly rated by Luggage Ratings Inc. since they make a quality and good looking product. Who is they referring to in this sentence?", "targets": "Samsonite", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John gave a large sum of money to Bill because he needed a loan. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Merchant Smith purchased the trophy from Knight Louis because he desperately needed the money. Who is he referring to in this sentence?", "targets": "Knight Louis", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Robert fired Chris because he couldn't do the job. Who is he referring to in this sentence?", "targets": "Chris", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The NFL generates obscene amounts of revenue compared to the MLB, because they are not as popular to watch. Who is they referring to in this sentence?", "targets": "the MLB", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The lion bit the gazelle because it had sharp teeth. Who is it referring to in this sentence?", "targets": "The lion", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The policeman finally caught the criminal, because he turned himself in. Who is he referring to in this sentence?", "targets": "the criminal", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Godzilla will stomp all over Tokyo if it does not build better defenses. Who is it referring to in this sentence?", "targets": "Tokyo", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John nicked Bill because he needed money. Who is he referring to in this sentence?", "targets": "John", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Americans preferred Obama to McCain because he was younger. Who is he referring to in this sentence?", "targets": "Obama", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Google is catching up to Firefox in the percentage of users because they have a faster and more reliable browser. Who is they referring to in this sentence?", "targets": "Google", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Steve scratched Johnny so he became angry. Who is he referring to in this sentence?", "targets": "Johnny", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tim bought Eric a gecko, but he did not like it. Who is he referring to in this sentence?", "targets": "Eric", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mary lied to Sue and she asked for forgiveness. Who is she referring to in this sentence?", "targets": "Mary", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The kidnapper will not return Trent Reznor until he is given a private performance. Who is he referring to in this sentence?", "targets": "The kidnapper", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Chuck Norris can beat any man in a fight, unless he is invincible. Who is he referring to in this sentence?", "targets": "any man", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Four wheel drive cars are used for rally racing instead of rear wheel cars because they are better for off-road racing. Who is they referring to in this sentence?", "targets": "Four wheel drive cars", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Police sweep bums off the benches of the park since they need to enforce the law of no sleeping in the park overnight. Who is they referring to in this sentence?", "targets": "Police", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Tech Analysts have speculated that Amazon will be releasing a phone next year since they have made a contract with vendors for phone parts. Who is they referring to in this sentence?", "targets": "Amazon", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "John disliked Bill, but he did not know. Who is he referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Rocky lost to Clubber Lang because he was ready for the fight. Who is he referring to in this sentence?", "targets": "Clubber Lang", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Iphones are selling more than androids because they are trendy. Who is they referring to in this sentence?", "targets": "Iphones", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Union defeated the Confederates in the Civil war since they did not have the resources to continue the fight. Who is they referring to in this sentence?", "targets": "the Confederates", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The zookeepers make sure to feed the chimps on a daily schedule because they are required to do so under animal cruelty regulations. Who is they referring to in this sentence?", "targets": "The zookeepers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Backstreet Boys were much more popular than N-Sync since they had the better music. Who is they referring to in this sentence?", "targets": "The Backstreet Boys", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "David hit Bill because Mary really liked him. Who is him referring to in this sentence?", "targets": "Bill", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Dad yelled at Sam because he did not go to school. Who is he referring to in this sentence?", "targets": "Sam", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "The Minecraft developers managed to win their case regarding copyright infringement against Bethesda Studios since they did not violate any laws. Who is they referring to in this sentence?", "targets": "The Minecraft developers", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Technician Stepanic crafted advanced opticals for Leforge since he needed to be able to see well for his duties. Who is he referring to in this sentence?", "targets": "Technician Stepanic", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Claudia lost all her money to Valarie because she is stupid. Who is she referring to in this sentence?", "targets": "Claudia", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Malachi's program would not run on the computer because it had a faulty hard drive. Who is it referring to in this sentence?", "targets": "the computer", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Bob killed Vincent because he wanted to kill someone. Who is he referring to in this sentence?", "targets": "Bob", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Mr. Sanders gave James a promotion because he appreciated his good work. Who is he referring to in this sentence?", "targets": "Mr. Sanders", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "Apple recently had to recall 1st generation IPods, but they did so six years after it was initially released. Who is they referring to in this sentence?", "targets": "Apple", "task": "definite_pronoun_resolution_template_2_no_opt"}
{"inputs": "He put snow on the smiley face because it was wet. Who is it referring to in this sentence?", "targets": "snow", "task": "definite_pronoun_resolution_template_2_no_opt"}
