{"inputs": "IN: Which person is it? The bird ate the pie and it died. OPTIONS: - The bird - the pie OUT:", "targets": "The bird", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? When the preschoolers visited the senior citizens, they were very hospitable. OPTIONS: - the preschoolers - the senior citizens A:", "targets": "the senior citizens", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is she? Jill outran Kate because she was slower. OPTIONS: - Jill - Kate OUT:", "targets": "Kate", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Jack pays more for the things Jim gets for nothing, because he was desperate. OPTIONS: - Jack - Jim OUT:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Dan modified Harry's car because he had the tools. Who is \"he\"? OPTIONS: - Dan - Harry ANS:", "targets": "Dan", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: A monkey ate a lizard and it screamed in pain. Who is it referring to in this sentence? OPTIONS: - A monkey - a lizard --- Answer:", "targets": "a lizard", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Adrian Peterson has more touchdowns than Reggie Bush because he cannot run the ball as well. OPTIONS: - Adrian Peterson - Reggie Bush A:", "targets": "Reggie Bush", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Commissioner Gordon has to constantly call upon Batman because he is not able to stop the criminals himself. Who is \"he\" in this prior sentence? OPTIONS: - Commissioner Gordon - Batman", "targets": "Commissioner Gordon", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "John nicked Bill because he was gullible. Who is \"he\" in this prior sentence? OPTIONS: - John - Bill", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Morpheous believed Neo was \"the one\", because he was fortold by the Oracle this would happen. Who is \"he\" in this prior sentence? OPTIONS: - Morpheous - Neo", "targets": "Morpheous", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Steve loved Bush but he did not tell. Who is he referring to in this sentence? OPTIONS: - Steve - Bush --- Answer:", "targets": "Steve", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Seth is a smarter than Sai, and consequently he did worse in the job interview. Who is he referring to in this sentence? OPTIONS: - Seth - Sai --- Answer:", "targets": "Sai", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Lorenze took his son to the hospital because he fell off his bike and hurt his leg. Who is \"he\"? OPTIONS: - Lorenze - his son ANS:", "targets": "his son", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The citizens rebelled against the government because they were being mean. Based on this sentence, who is they? OPTIONS: - The citizens - the government Answer:", "targets": "the government", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The Apes were determined to be contaminated by disease specialists, so they were forced to be released in secured captivity. Who is \"they\" in this prior sentence? OPTIONS: - The Apes - disease specialists", "targets": "The Apes", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The music player did not open the file because it was in the wrong format. Who is it referring to in this sentence? OPTIONS: - The music player - the file --- Answer:", "targets": "the file", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? The cougar tried to befriend the rabbit because it had a bad reputation as an evil predator. OPTIONS: - The cougar - the rabbit OUT:", "targets": "The cougar", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? Gold is more popular than black because it does not sparkle. OPTIONS: - Gold - black OUT:", "targets": "black", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Caesar the ape found out the door code by watching Morris, so he was able to escape. Who is \"he\"? OPTIONS: - Caesar the ape - Morris ANS:", "targets": "Caesar the ape", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Doctor Jenner continued his work on a vaccine for John, but he is not have much success. OPTIONS: - Doctor Jenner - John OUT:", "targets": "Doctor Jenner", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The zombies chased the survivors because they were tasty. OPTIONS: - The zombies - the survivors ANS:", "targets": "the survivors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? The model frowned at her manager because she forgot to call. OPTIONS: - The model - her manager A:", "targets": "her manager", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The Texas Rangers lost the world series to the Cardinals since they had a stronger desire to win the series. Who is \"they\" in this prior sentence? OPTIONS: - The Texas Rangers - the Cardinals", "targets": "the Cardinals", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Amazon offers a generous credit program for college books because they want students to come back and use their credit for more purchases. OPTIONS: - Amazon - college books A:", "targets": "Amazon", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Will Smith got his son in a movie since he has much influence in the movie scene. OPTIONS: - Will Smith - his son OUT:", "targets": "Will Smith", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jackie Chan is starting to become like Chuck Norris since he retired at the age he has now reached. Based on this sentence, who is he? OPTIONS: - Jackie Chan - Chuck Norris Answer:", "targets": "Chuck Norris", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Walmart is promoting their Black Friday sale heavily in commercials because they want to start off the Christmas season successfully in sales. Based on this sentence, who is they? OPTIONS: - Walmart - commercials Answer:", "targets": "Walmart", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Microsoft Azure provides cloud servers for consumers because they are providing the infrastructure for a future in cloud computing. OPTIONS: - Microsoft Azure - consumers A:", "targets": "Microsoft Azure", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Tiger Woods dropped Randy as his caddy, but he does not agree with his decision. OPTIONS: - Tiger Woods - Randy A:", "targets": "Randy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Justin Bieber sold many more albums than Jack Johnson, but he is also very unpopular among older adults. Who is he referring to in this sentence? OPTIONS: - Justin Bieber - Jack Johnson --- Answer:", "targets": "Justin Bieber", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Bethesda launched a new title, Skyrim, to raving reviews by gamers so they will now most likely buy their next title as well. Who is \"they\"? OPTIONS: - Bethesda - gamers ANS:", "targets": "gamers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The Secretary and the President met about him being appointed. Who him is? OPTIONS: - The Secretary - the President A:", "targets": "The Secretary", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The government wants to prohibit the people from playing chess on Monday because they have to work. OPTIONS: - The government - the people OUT:", "targets": "the people", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The Apes were determined to be contaminated by disease specialists, but they refused to admit their fault. Who is \"they\"? OPTIONS: - The Apes - disease specialists ANS:", "targets": "disease specialists", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Bush beat Gore because he rigged the election. he OPTIONS: - Bush - Gore Answer:", "targets": "Bush", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Misty was replaced by May because she had to go back home. Who she is? OPTIONS: - Misty - May A:", "targets": "Misty", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Katie accused Jane but she was not found guilty. OPTIONS: - Katie - Jane A:", "targets": "Jane", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Monkeys hate lions because they eat them. Who is \"they\" in this prior sentence? OPTIONS: - Monkeys - lions", "targets": "Monkeys", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Sue visited Nadia for dinner because she was free. Who she is? OPTIONS: - Sue - Nadia A:", "targets": "Sue", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: When Sue went to Nadia's home for dinner, she ate sukiyaki au gratin. Based on this sentence, who is she? OPTIONS: - Sue - Nadia Answer:", "targets": "Nadia", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The NBA will most likely have a lockout this year due to players rejecting their latest compromise, because they wanted better terms to be presented to them. OPTIONS: - The NBA - players OUT:", "targets": "players", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The bus driver yelled at a kid after she broke a window. Based on this sentence, who is she? OPTIONS: - The bus driver - a kid Answer:", "targets": "a kid", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Males always outnumber females at Comic Con since they are generally more interested in games and comics. Based on this sentence, who is they? OPTIONS: - Males - females Answer:", "targets": "Males", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Jessica did not like Selma cutting her hair short, so she tried to be conservative in the length she cut it. Who she is? OPTIONS: - Jessica - Selma A:", "targets": "Selma", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The construction company could not rezone the area due to endangered butterflies since they could not violate state law and endanger a species. Who is \"they\" in this prior sentence? OPTIONS: - The construction company - endangered butterflies", "targets": "The construction company", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: People raise dogs because they are afraid of thieves. Who is they referring to in this sentence? OPTIONS: - People - dogs --- Answer:", "targets": "People", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Ebay is often considered a great source by deal hunters to buy products, even though they often contain misleading descriptions. OPTIONS: - Ebay - deal hunters OUT:", "targets": "Ebay", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Terranova has better ratings than House since they have a small target audience. they OPTIONS: - Terranova - House Answer:", "targets": "House", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? The professor grading the student's paper said that he loved it. OPTIONS: - The professor - the student A:", "targets": "The professor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The man stole the neighbor's bike because he had one extra. Who is \"he\"? OPTIONS: - The man - the neighbor ANS:", "targets": "the neighbor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Groupon lied about their earnings to the stakeholders since they wanted to keep the value of the company high. Based on this sentence, who is they? OPTIONS: - Groupon - the stakeholders Answer:", "targets": "Groupon", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Sue visited Nadia for dinner because she invited her. Based on this sentence, who is she? OPTIONS: - Sue - Nadia Answer:", "targets": "Nadia", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "David hit Bill and he cried. Who is \"he\" in this prior sentence? OPTIONS: - David - Bill", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is she in the following sentence? Nicole was angry at Sammie since she lied to her. OPTIONS: - Nicole - Sammie ANS:", "targets": "Nicole", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Rocky won the match with Richard because he worked hard. Based on this sentence, who is he? OPTIONS: - Rocky - Richard Answer:", "targets": "Rocky", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The security patrol searched the land for survivors because they might still be alive. OPTIONS: - The security patrol - survivors A:", "targets": "survivors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Consultants are hired by companies to perform specialized tasks, but they do not always have money in the budget to hire these services. OPTIONS: - Consultants - companies OUT:", "targets": "companies", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The NFL generates obscene amounts of revenue compared to the MLB, because they are not as popular to watch. Who is \"they\" in this prior sentence? OPTIONS: - The NFL - the MLB", "targets": "the MLB", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Jennifer Aniston does not like Angelina Jolie because she is jealous of her relationship. Who she is? OPTIONS: - Jennifer Aniston - Angelina Jolie A:", "targets": "Jennifer Aniston", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The game distribution platform \"Origin\" will have exclusive EA games that competitor \"Steam\" will not have, because they could not obtain rights to those titles. Who is \"they\"? OPTIONS: - Origin - Steam ANS:", "targets": "Steam", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Centurion lent Doctor Who his ear since he had saved the Centurion's life. Who is he referring to in this sentence? OPTIONS: - The Centurion - Doctor Who --- Answer:", "targets": "Doctor Who", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Brock understood the material better than Tracy because he was paying attention. OPTIONS: - Brock - Tracy ANS:", "targets": "Brock", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Tim asked Jerry to run to the store so that he would be late for home. Who is \"he\"? OPTIONS: - Tim - Jerry ANS:", "targets": "Jerry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Professors do a lot for students, but they are rarely respected. OPTIONS: - Professors - students ANS:", "targets": "Professors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Sherry called Karla but she did not answer. she OPTIONS: - Sherry - Karla Answer:", "targets": "Karla", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Herman Cain has fallen in the polls while Mitt Romney has increased his foothold, but he may have a comeback in the polls after the next debate. he OPTIONS: - Herman Cain - Mitt Romney Answer:", "targets": "Herman Cain", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The government officials publicly apologized to the people because they demanded an apology. OPTIONS: - The government officials - the people ANS:", "targets": "the people", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Mary asked Jim not to annoy the crazy person, as he might attack him. Who is he referring to in this sentence? OPTIONS: - Jim - the crazy person --- Answer:", "targets": "the crazy person", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The striker scored on the goalie because he was caught off guard. Based on this sentence, who is he? OPTIONS: - The striker - the goalie Answer:", "targets": "the goalie", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Entertainmart has to win over the consumers with their low prices because they are the ones that contribute to making a business successful. Based on this sentence, who is they? OPTIONS: - Entertainmart - the consumers Answer:", "targets": "the consumers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Brock understood the material better than Tracy because he was not paying attention. OPTIONS: - Brock - Tracy OUT:", "targets": "Tracy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The dumpsters arrived each day to retrieve the garbage of the population, but they can be called to arrive if requested. Who is \"they\"? OPTIONS: - The dumpsters - the population ANS:", "targets": "The dumpsters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: T-Mobile's data plan is better than AT&T's data plan since it throttles user for excessive data usage. Who is it referring to in this sentence? OPTIONS: - T-Mobile - AT&T --- Answer:", "targets": "AT&T", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Battlefield 3 is garnering more attention than Modern Warfare because they have graphics that are on a whole new level. Who is they referring to in this sentence? OPTIONS: - Battlefield 3 - Modern Warfare --- Answer:", "targets": "Battlefield 3", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Cheesecake is better than fruitcake because it is gross. Based on this sentence, who is it? OPTIONS: - Cheesecake - fruitcake Answer:", "targets": "fruitcake", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? There is more NLP work on English than on Bengali because it has little linguistic resources. OPTIONS: - English - Bengali A:", "targets": "Bengali", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The mechanic charged the man one hundred dollars although he had done no work. he OPTIONS: - The mechanic - the man Answer:", "targets": "The mechanic", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "New Orleans is renown for their unique style of crawfish, because they are flavored and cooked to be delicious. Who is \"they\" in this prior sentence? OPTIONS: - New Orleans - crawfish", "targets": "crawfish", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Ebay is often considered a great source by deal hunters to buy products, even though they often see misleading descriptions. Who is they referring to in this sentence? OPTIONS: - Ebay - deal hunters --- Answer:", "targets": "deal hunters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "When Sue went to Nadia's home for dinner, she told the security guard to let her in. Who is \"she\" in this prior sentence? OPTIONS: - Sue - Nadia", "targets": "Sue", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Mike helped Jack with his assignment because he felt like doing so. OPTIONS: - Mike - Jack OUT:", "targets": "Mike", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Computers outsell laptops because they are more powerful. Who is \"they\" in this prior sentence? OPTIONS: - Computers - laptops", "targets": "Computers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [she] Snooki got angry at Kendra since she is upset that her friend would not comfort her. OPTIONS: - Snooki - Kendra OUT:", "targets": "Snooki", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jack pushed Tim down the stairs and he slipped to the ground. Who is he referring to in this sentence? OPTIONS: - Jack - Tim --- Answer:", "targets": "Tim", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Godzilla will stomp all over Tokyo if it rises from the ocean. Who is \"it\"? OPTIONS: - Godzilla - Tokyo ANS:", "targets": "Godzilla", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Burt installed Joey's software, and he installed his hardware too. Who he is? OPTIONS: - Burt - Joey A:", "targets": "Burt", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Peacocks are considered very majestic birds by bird watchers because they are considered quite beautiful due to their vivid colors. OPTIONS: - Peacocks - bird watchers ANS:", "targets": "Peacocks", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Batman caught the thief, and he plead innocence. Who is \"he\"? OPTIONS: - Batman - the thief ANS:", "targets": "the thief", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Board of Directors fired the management from the company since they did not think they were doing a good job. Who is they referring to in this sentence? OPTIONS: - The Board of Directors - the management --- Answer:", "targets": "The Board of Directors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Cartman wanted Kenny to go to the same school as him because he enjoyed his company. OPTIONS: - Cartman - Kenny ANS:", "targets": "Cartman", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Clinton wanted Obama to run for president because he could not win. OPTIONS: - Clinton - Obama A:", "targets": "Clinton", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Liu Kang threw the bags of Johnny Cage into the water since he mistakenly asked him to carry his bags. he OPTIONS: - Liu Kang - Johnny Cage Answer:", "targets": "Johnny Cage", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Bethesda launched a new title, Skyrim, to raving reviews by gamers because they produced an excellent story to immense the player. Who is \"they\" in this prior sentence? OPTIONS: - Bethesda - gamers", "targets": "Bethesda", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The children played games because they were bored. OPTIONS: - The children - games ANS:", "targets": "The children", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Commissioner Gordon has to constantly call upon Batman since he is an extremely efficient crime fighter. Who he is? OPTIONS: - Commissioner Gordon - Batman A:", "targets": "Batman", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is it in the following sentence? Windows is worse than Linux because it has a lot of viruses. OPTIONS: - Windows - Linux ANS:", "targets": "Windows", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Several energy companies are under investigation by Congress since they need to find out if the money was mishandled. Who is they referring to in this sentence? OPTIONS: - Several energy companies - Congress --- Answer:", "targets": "Congress", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The sword was stuck in the tree because it grew up around it. Based on this sentence, who is it? OPTIONS: - The sword - the tree Answer:", "targets": "the tree", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The Drill Sergeants trained the troops aggressively so they could prepare them for the impending war. OPTIONS: - The Drill Sergeants - the troops ANS:", "targets": "The Drill Sergeants", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The school denied parents parking permits because they violated parking rules. OPTIONS: - The school - parents A:", "targets": "parents", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Charles Dickinson shot at Andrew Jackson, so he started reloading. Who is \"he\"? OPTIONS: - Charles Dickinson - Andrew Jackson ANS:", "targets": "Charles Dickinson", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Apple recently had to recall 1st generation IPods because they had a defect in their batteries. OPTIONS: - Apple - 1st generation IPods OUT:", "targets": "1st generation IPods", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Knight Commander Roddick was plagued by a vision of his dead son, so he became crazy from being reminded constantly. Who is he referring to in this sentence? OPTIONS: - Knight Commander Roddick - his dead son --- Answer:", "targets": "Knight Commander Roddick", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? The bespeckled old man slowly waved at the passing trolley passenger because he waves at everybody. OPTIONS: - The bespeckled old man - the passing trolley passenger ANS:", "targets": "The bespeckled old man", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Bumblebee was sent home with Sam Witwicky to protect him so he is on watch 7 days a week. Who is \"he\"? OPTIONS: - Bumblebee - Sam Witwicky ANS:", "targets": "Sam Witwicky", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Kurt sang to Jon since he was the judge. Based on this sentence, who is he? OPTIONS: - Kurt - Jon Answer:", "targets": "Jon", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [it] The Emancipation Proclamation made slavery illegal, but it did not actually cause many slaves to be freed. OPTIONS: - The Emancipation Proclamation - slavery OUT:", "targets": "The Emancipation Proclamation", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? The elephant trampled a fish and it continued on its way. OPTIONS: - The elephant - a fish OUT:", "targets": "The elephant", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John bought a beer for Bill because he likes cool guys. Based on this sentence, who is he? OPTIONS: - John - Bill Answer:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Google bought Motorola because they want its customer base. OPTIONS: - Google - Motorola OUT:", "targets": "Google", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The home team lost to the Giants because they were better players. Who is \"they\" in this prior sentence? OPTIONS: - The home team - the Giants", "targets": "the Giants", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Ann helped Kim with her cooking skills, because she was unable to make rice. Who is \"she\" in this prior sentence? OPTIONS: - Ann - Kim", "targets": "Kim", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Western Digital may disappoint their shareholders this season, but they will probably tough out the momentary losses and remain shareholders. Who is \"they\"? OPTIONS: - Western Digital - their shareholders ANS:", "targets": "their shareholders", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Consultants are hired by companies to perform specialized tasks because they are easier to hire than trying to perform a task oneself. Based on this sentence, who is they? OPTIONS: - Consultants - companies Answer:", "targets": "Consultants", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The NBA will most likely have a lockout this year due to players rejecting their latest compromise, but they refuse to write up a new compromise with them. OPTIONS: - The NBA - players A:", "targets": "The NBA", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? NASA helped the Autobots to exile from the planet after they were told to leave. OPTIONS: - NASA - the Autobots ANS:", "targets": "the Autobots", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Computers outsell laptops because they are not worth the money. Who they is? OPTIONS: - Computers - laptops A:", "targets": "laptops", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Samsonite makes luggage which is highly rated by Luggage Ratings Inc. since they make a quality and good looking product. Who they is? OPTIONS: - Samsonite - Luggage Ratings Inc. A:", "targets": "Samsonite", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The Simpsons have lasted 23 seasons while The Sarah Connor Chronicles lasted two seasons, since they did not provide a very good show. OPTIONS: - The Simpsons - The Sarah Connor Chronicles OUT:", "targets": "The Sarah Connor Chronicles", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Johnson wanted to make friendship with David, because he wanted help. Who he is? OPTIONS: - Johnson - David A:", "targets": "Johnson", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Martial Arts actors are often accused as being frauds by the public since they think they can only fight in fake scenarios. OPTIONS: - Martial Arts actors - the public ANS:", "targets": "the public", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Kate Middleton is viewed as a newer generation Princess Diana because she was a symbol of fashion as the previous queen. Who she is? OPTIONS: - Kate Middleton - Princess Diana A:", "targets": "Princess Diana", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The hippo ate the food the trainer brought when he put it in the trough. Who is he referring to in this sentence? OPTIONS: - The hippo - the trainer --- Answer:", "targets": "the trainer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Keith fired Blaine even though he is diligent. Based on this sentence, who is he? OPTIONS: - Keith - Blaine Answer:", "targets": "Blaine", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Retail stores have been trying to pass an internet tax on online retailers for the past few years, but they are adamant on fighting against this regulation they are trying to impose. OPTIONS: - Retail stores - online retailers OUT:", "targets": "online retailers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Sir Rodrick was made specialized fitted armor by Jack, but he charged top coin for such a piece. OPTIONS: - Sir Rodrick - Jack ANS:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Scrooge was moved by the appearance of Timmy since he has an effect on people due to him being crippled and loving. he OPTIONS: - Scrooge - Timmy Answer:", "targets": "Timmy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: My brother put a Barbie that has metal parts in the microwave, so it melted. Who it is? OPTIONS: - a Barbie - the microwave A:", "targets": "a Barbie", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Chevrolet had to recently recall their cars so they could receive a repair in their brakes. OPTIONS: - Chevrolet - their cars OUT:", "targets": "their cars", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Peter managed to win the lottery and loaned money to Rick, because he has enough money to freely loan to his friends. OPTIONS: - Peter - Rick A:", "targets": "Peter", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Animal Control takes control of lost animals in the city because they are hired by the city to perform these duties. OPTIONS: - Animal Control - lost animals ANS:", "targets": "Animal Control", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: John nicked Bill because he needed money. Who is \"he\"? OPTIONS: - John - Bill ANS:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Luigi rescued Mario because he was the only one who can. Based on this sentence, who is he? OPTIONS: - Luigi - Mario Answer:", "targets": "Luigi", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Mary stabbed Jennifer, so John took her to the hospital. Who is \"her\" in this prior sentence? OPTIONS: - Mary - Jennifer", "targets": "Jennifer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Daryel told Ross that he was the ugliest person he knew of after examining himself disapprovingly in the mirror. OPTIONS: - Daryel - Ross A:", "targets": "Daryel", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Shawn Jun performed a huge upset over four time champion Leon Sung but he still received a large sum of money for being a runner up. OPTIONS: - Shawn Jun - Leon Sung OUT:", "targets": "Leon Sung", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Nicole was angry at Sammie since she caught her in a lie. she OPTIONS: - Nicole - Sammie Answer:", "targets": "Sammie", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Michael backed Bill because John really liked him. Based on this sentence, who is him? OPTIONS: - Michael - Bill Answer:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Jacob gave William money because he sold the car. OPTIONS: - Jacob - William OUT:", "targets": "Jacob", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is him? Bill was robbed by John, so the officer arrested him. OPTIONS: - Bill - John OUT:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is she in the following sentence? Jimbo was afraid of Bobbert because she gets scared around new people. OPTIONS: - Jimbo - Bobbert ANS:", "targets": "Jimbo", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Lions eat zebras because they are predators. OPTIONS: - Lions - zebras OUT:", "targets": "Lions", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Space Marines are played more often than Orks, so they are always the most played at tournaments. OPTIONS: - Space Marines - Orks ANS:", "targets": "Space Marines", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The shipping company harvests lobster for their business, since they are considered an exquisite meal. OPTIONS: - The shipping company - lobster OUT:", "targets": "lobster", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The police officer shot the protester because he lost composure. Who is he referring to in this sentence? OPTIONS: - The police officer - the protester --- Answer:", "targets": "The police officer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The lion bit the gazelle because it had sharp teeth. Who is \"it\" in this prior sentence? OPTIONS: - The lion - the gazelle", "targets": "The lion", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Janet Jackson is more popular than Latoya Jackson since she is the better performer. Who she is? OPTIONS: - Janet Jackson - Latoya Jackson A:", "targets": "Janet Jackson", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John asked the scientist what he was working on. Who is he referring to in this sentence? OPTIONS: - John - the scientist --- Answer:", "targets": "the scientist", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The poor steal from the rich because they possess more items of value. Who is \"they\"? OPTIONS: - The poor - the rich ANS:", "targets": "the rich", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [it] The river destroyed the bridge because it was low. OPTIONS: - The river - the bridge OUT:", "targets": "the bridge", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The cat broke the glass because it was fragile. Who is it referring to in this sentence? OPTIONS: - The cat - the glass --- Answer:", "targets": "the glass", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The academic clubs lost their members because they did not have free time. they OPTIONS: - The academic clubs - their members Answer:", "targets": "their members", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Janice bought Kenda a car because she has money to spend. Who is \"she\" in this prior sentence? OPTIONS: - Janice - Kenda", "targets": "Janice", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Katy cried for Susan since she died. Who is \"she\"? OPTIONS: - Katy - Susan ANS:", "targets": "Susan", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: John remembered Bill because he was memorable. Who he is? OPTIONS: - John - Bill A:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jerrica saw the guard as she marched past. Who is she referring to in this sentence? OPTIONS: - Jerrica - the guard --- Answer:", "targets": "the guard", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The security forces were not able to stop the mass of apes because they simply had them outnumbered. Who is \"they\" in this prior sentence? OPTIONS: - The security forces - the mass of apes", "targets": "the mass of apes", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The AirForce is more appealing than the Army, but they require higher qualifications. OPTIONS: - The AirForce - the Army A:", "targets": "The AirForce", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Bill returned Jim twenty dollars because he lent money. Who he is? OPTIONS: - Bill - Jim A:", "targets": "Jim", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Policemen advocated the use of wire taps to track terrorists, because they are hard to track. OPTIONS: - Policemen - terrorists OUT:", "targets": "terrorists", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Kyle purchased three new monitors due to a recommendation by his brother, because he provided information on how his productivity increased with more working space. OPTIONS: - Kyle - his brother OUT:", "targets": "his brother", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Apple indicated that the Siri program would not be available for previous IPhones because they do not have the capabilities to run such a program. Who is they referring to in this sentence? OPTIONS: - Apple - previous IPhones --- Answer:", "targets": "previous IPhones", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The NSA sent their agents in the field to retrieve intelligence because they need people in the field to do the field work. Based on this sentence, who is they? OPTIONS: - The NSA - their agents Answer:", "targets": "The NSA", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Caroline quickly defeated Sue because she regained her confidence. OPTIONS: - Caroline - Sue A:", "targets": "Caroline", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Batman caught the thief, and he recovered the stolen diamonds. OPTIONS: - Batman - the thief OUT:", "targets": "Batman", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? John gave a large sum of money to Bill because he had extra. OPTIONS: - John - Bill A:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Gamestop pulled Square Enix's game, \"Dues Ex\" from the shelves, because they offered a coupon for a game service in their game. OPTIONS: - Gamestop - Square Enix OUT:", "targets": "Gamestop", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "John kicked Bill because he was angry. Who is \"he\" in this prior sentence? OPTIONS: - John - Bill", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Insurance companies charge a premium if people had an accident before, so they try to maintain a clean record in order to avoid having to pay more. Who is \"they\"? OPTIONS: - Insurance companies - people ANS:", "targets": "people", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? The bird perched on the limb and it bent. OPTIONS: - The bird - the limb A:", "targets": "the limb", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Positive SSL sells wildcard certificates to Web hosting companies, but they have multiple options to purchase certificates from. Who is they referring to in this sentence? OPTIONS: - Positive SSL - Web hosting companies --- Answer:", "targets": "Web hosting companies", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The waitress noticed that Rebecca's glass was empty, so she handed her the glass to fill it. Who she is? OPTIONS: - The waitress - Rebecca A:", "targets": "Rebecca", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The kidnapper will not return Trent Reznor until he is given a private performance. Based on this sentence, who is he? OPTIONS: - The kidnapper - Trent Reznor Answer:", "targets": "The kidnapper", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The Cowboys formed a trailer defense against the Indians since they are about to attack. Who is \"they\"? OPTIONS: - The Cowboys - the Indians ANS:", "targets": "the Indians", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The US army fought the Taliban because they are trying to prevent terrorism. OPTIONS: - The US army - the Taliban OUT:", "targets": "The US army", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [she] Pat tried to talk to Jill but she was ignored. OPTIONS: - Pat - Jill OUT:", "targets": "Pat", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Bill triumphed over John in the boxing ring because he fought smarter. Who is \"he\" in this prior sentence? OPTIONS: - Bill - John", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: NATO forces did precision predator strikes for the Libyan rebels since they had the predator vehicles. Who is they referring to in this sentence? OPTIONS: - NATO forces - Libyan rebels --- Answer:", "targets": "NATO forces", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The carpenters came before the painters since they need to build the furniture first. OPTIONS: - The carpenters - the painters OUT:", "targets": "The carpenters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jack pushed John up the hill because he is a good samaritan. Who is he referring to in this sentence? OPTIONS: - Jack - John --- Answer:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Conan O'Brien replaced Jay Leno as host of Late Night, however, he was soon asked to come back and have his previous time slot. OPTIONS: - Conan O'Brien - Jay Leno OUT:", "targets": "Jay Leno", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Bob Marley shot the sheriff, but he swears it was in self-defense. OPTIONS: - Bob Marley - the sheriff A:", "targets": "Bob Marley", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Nancy adopted a baby girl because she always wanted a daughter. she OPTIONS: - Nancy - a baby girl Answer:", "targets": "Nancy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The authorities detained the hikers because they were trespassing. Based on this sentence, who is they? OPTIONS: - The authorities - the hikers Answer:", "targets": "the hikers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Americans preferred Obama to McCain because he chose Sarah Palin as his running-mate. he OPTIONS: - Obama - McCain Answer:", "targets": "McCain", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The forensic team managed to link the criminals to the crime, so they are now going to go to prison. Who is \"they\" in this prior sentence? OPTIONS: - The forensic team - the criminals", "targets": "the criminals", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Penguins tend to stay on land to avoid killer whales, because they cannot go on land. Based on this sentence, who is they? OPTIONS: - Penguins - killer whales Answer:", "targets": "killer whales", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? The bee landed on the flower because it wanted pollen. OPTIONS: - The bee - the flower OUT:", "targets": "The bee", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Master Wong had to come to the defense of his pupil, Lun-Xiu, since he managed to anger numerous thugs. Who he is? OPTIONS: - Master Wong - Lun-Xiu A:", "targets": "Lun-Xiu", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Mark tackled the quarterback, but he managed to complete the pass. Who is \"he\"? OPTIONS: - Mark - the quarterback ANS:", "targets": "the quarterback", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The police arrested the criminals since they enforce the law. Who is \"they\" in this prior sentence? OPTIONS: - The police - the criminals", "targets": "The police", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jack pays more for the things Jim gets for nothing, because he had it available. he OPTIONS: - Jack - Jim Answer:", "targets": "Jim", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Saturday Night Live often has politicians as one of their main centers of attention because they want to keep viewers entertained. Who is \"they\"? OPTIONS: - Saturday Night Live - politicians ANS:", "targets": "Saturday Night Live", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The space marines killed the aliens because they were a threat. OPTIONS: - The space marines - the aliens ANS:", "targets": "the aliens", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Johnny Cage had to trick Scorpion into stretching himself out too thin since he had abilities which gave him the advantage. he OPTIONS: - Johnny Cage - Scorpion Answer:", "targets": "Scorpion", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? The US president had a meeting with the Chinese president, where he told him to release political prisoners. OPTIONS: - The US president - the Chinese president ANS:", "targets": "The US president", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Gun instructors provide the best tips and practices to keep their students safe from firearm usage since they have years of experience from handling guns in their lifetime. Who they is? OPTIONS: - Gun instructors - their students A:", "targets": "Gun instructors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The University declared holiday to students because they requested them. Who they is? OPTIONS: - The University - students A:", "targets": "students", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Americans preferred Obama to McCain because he was younger. Who is \"he\"? OPTIONS: - Obama - McCain ANS:", "targets": "Obama", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? The listener did not complain about the singer because he was autotuned. OPTIONS: - The listener - the singer ANS:", "targets": "the singer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Medics have a tough job of trying to heal the wounded because they are normally hurt in dangerous scenarios. OPTIONS: - Medics - the wounded ANS:", "targets": "the wounded", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The hippo ate the food the trainer brought when he was hungry. Who is \"he\"? OPTIONS: - The hippo - the trainer ANS:", "targets": "The hippo", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The Roman legion attacked the Persians because they felt threatened. OPTIONS: - The Roman legion - the Persians OUT:", "targets": "The Roman legion", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The mechanic charged the man one hundred dollars although he only had eighty dollars. OPTIONS: - The mechanic - the man OUT:", "targets": "the man", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The robots tried to negotiate a cease-fire with the squirrel-men, but negotiations broke down when they sabotaged the acorn processing facility. Who is \"they\"? OPTIONS: - The robots - the squirrel-men ANS:", "targets": "The robots", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Steve Ballmer took over as CEO of Microsoft after Bill Gates because he retired. OPTIONS: - Steve Ballmer - Bill Gates OUT:", "targets": "Bill Gates", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Adrian Peterson has more touchdowns than Reggie Bush because he is better at running the ball. OPTIONS: - Adrian Peterson - Reggie Bush A:", "targets": "Adrian Peterson", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? The government placed a tax on the product so it got more expensive. OPTIONS: - The government - the product OUT:", "targets": "the product", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Buy More Book Store sends brand new books to customers because they like quality in the books they read. OPTIONS: - Buy More Book Store - customers A:", "targets": "customers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Michael backed Bill because John asked him to. Based on this sentence, who is him? OPTIONS: - Michael - Bill Answer:", "targets": "Michael", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The model frowned at her manager because she was sad. Who is she referring to in this sentence? OPTIONS: - The model - her manager --- Answer:", "targets": "The model", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Dad yelled at Sam because he did not go to school. Who is he referring to in this sentence? OPTIONS: - Dad - Sam --- Answer:", "targets": "Sam", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Doctor Igor was interrogated by Colonel Marshall because he had vital information on the location of enemy forces. OPTIONS: - Doctor Igor - Colonel Marshall ANS:", "targets": "Doctor Igor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? The man gave the beggar some money because he was very generous. OPTIONS: - The man - the beggar OUT:", "targets": "The man", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Hybrid cars produce less pollution than diesel trucks because they use pure gasoline. they OPTIONS: - Hybrid cars - diesel trucks Answer:", "targets": "diesel trucks", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Claudia lost all her money to Valarie because she is stupid. Who is she referring to in this sentence? OPTIONS: - Claudia - Valarie --- Answer:", "targets": "Claudia", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The preservation society managed to rescue a rare species of birds so they will have the chance to survive. OPTIONS: - The preservation society - a rare species of birds ANS:", "targets": "a rare species of birds", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jill loves Jamie and she bought her a ring. she OPTIONS: - Jill - Jamie Answer:", "targets": "Jill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Ken scanned photos for Neil since he owned a scanner. OPTIONS: - Ken - Neil ANS:", "targets": "Ken", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Lucas is younger than Claus because he was born first. Who is he referring to in this sentence? OPTIONS: - Lucas - Claus --- Answer:", "targets": "Claus", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Simon Cowell makes fun of Ryan Seacrest since he feels superior. Who is \"he\"? OPTIONS: - Simon Cowell - Ryan Seacrest ANS:", "targets": "Simon Cowell", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The United States sanctions Iran since they recently were caught in plotting an assassination. Based on this sentence, who is they? OPTIONS: - The United States - Iran Answer:", "targets": "Iran", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Neil Patrick Harris is a better singer than Dave Chappelle, since he had experience from Broadway. Who is \"he\"? OPTIONS: - Neil Patrick Harris - Dave Chappelle ANS:", "targets": "Neil Patrick Harris", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The Union defeated the Confederates in the Civil war since they did not have the resources to continue the fight. Who is \"they\"? OPTIONS: - The Union - the Confederates ANS:", "targets": "the Confederates", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Rammstein performed their latest hit single to the masses of Germany since they wanted to perform for this native country first. OPTIONS: - Rammstein - the masses of Germany ANS:", "targets": "Rammstein", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "John chose Bill because he was the best choice. Who is \"he\" in this prior sentence? OPTIONS: - John - Bill", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Cartman wanted Kenny to go to the same school as him, but he refused. Who is \"he\"? OPTIONS: - Cartman - Kenny ANS:", "targets": "Kenny", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Paul made fun of Henry since he knew everyone else did. Who he is? OPTIONS: - Paul - Henry A:", "targets": "Paul", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Butters wanted to steal the movie Spiderman from Kenny because he would not lend it to him. Who is \"he\" in this prior sentence? OPTIONS: - Butters - Kenny", "targets": "Kenny", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The wolves ate the cows because they were hungry. Who they is? OPTIONS: - The wolves - the cows A:", "targets": "The wolves", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The professor highly recommends the student because he appreciates an inquisitive mind. Who is he referring to in this sentence? OPTIONS: - The professor - the student --- Answer:", "targets": "The professor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is she in the following sentence? Right after work Angelina took Sandy to the park because she knew the place. OPTIONS: - Angelina - Sandy ANS:", "targets": "Angelina", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Doctor Chen prescribed glasses to Egore, since he needs glasses to see. Who he is? OPTIONS: - Doctor Chen - Egore A:", "targets": "Egore", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The police called headquarters for help and they continued to fight the criminals. OPTIONS: - The police - headquarters ANS:", "targets": "The police", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] AOL finally had their CEO step down to respect the wishes of the stakeholders because they needed to listen to their investors. OPTIONS: - AOL - the stakeholders OUT:", "targets": "AOL", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? People like dogs because they look like them. OPTIONS: - People - dogs A:", "targets": "dogs", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Jackie Chan learned some things from watching Bruce Lee because he could watch his acting from the past. Who is \"he\" in this prior sentence? OPTIONS: - Jackie Chan - Bruce Lee", "targets": "Bruce Lee", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "There is currently more work on coreference resolution than on chunking because it is a problem that is nearly solved. Who is \"it\" in this prior sentence? OPTIONS: - coreference resolution - chunking", "targets": "chunking", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Scrooge was moved by the appearance of Timmy because he felt bad for the crippled, nice boy. OPTIONS: - Scrooge - Timmy ANS:", "targets": "Scrooge", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The Axis forces lost the war to the Allied forces because they fought on too many fronts. Who they is? OPTIONS: - The Axis forces - the Allied forces A:", "targets": "The Axis forces", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? It annoyed Chris when Sebastian jangled his keys because he was in a bad mood. OPTIONS: - Chris - Sebastian ANS:", "targets": "Chris", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The United Federation of Worlds attempts to bring civilization and rule to the population of millions of planets, because they want to unite the planets under the same rules. Who is \"they\"? OPTIONS: - The United Federation of Worlds - the population of millions of planets ANS:", "targets": "The United Federation of Worlds", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Mary stabbed Jennifer, so John reported her to the police. Who her is? OPTIONS: - Mary - Jennifer A:", "targets": "Mary", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: England won the bid over Spain because they did not prepare thoroughly. Who is they referring to in this sentence? OPTIONS: - England - Spain --- Answer:", "targets": "Spain", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The father convinced his son that it is possible for him to one day become a knight, but he may never achieve such status coming from a peasant family. Based on this sentence, who is he? OPTIONS: - The father - his son Answer:", "targets": "his son", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Adam defeated Brandon in a fight because he was weaker. OPTIONS: - Adam - Brandon OUT:", "targets": "Brandon", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The lifeguards evacuated the swimmers from the public pool because they were in danger of getting sick from human wastes in the water. Based on this sentence, who is they? OPTIONS: - The lifeguards - the swimmers Answer:", "targets": "the swimmers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Gas powered fireplaces are environmentally friendly as compared to traditional fireplaces since they require wood to function. they OPTIONS: - Gas powered fireplaces - traditional fireplaces Answer:", "targets": "traditional fireplaces", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Bioware recently announced a stress test to beta users this weekend since they need to see the performance of their servers. Who is \"they\"? OPTIONS: - Bioware - beta users ANS:", "targets": "Bioware", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? New York is very crowded compared to South Dakota, but they are also much smaller in square miles. OPTIONS: - New York - South Dakota OUT:", "targets": "New York", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Beowulf was granted the crown to succeed King Henry because he did not have a son to secede him instead. Who is \"he\" in this prior sentence? OPTIONS: - Beowulf - King Henry", "targets": "King Henry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Allen chased the leprechaun because he wanted a pot of gold. Based on this sentence, who is he? OPTIONS: - Allen - the leprechaun Answer:", "targets": "Allen", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Apple sued Samsung because they made a product that has similarities with their own. OPTIONS: - Apple - Samsung ANS:", "targets": "Samsung", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The product fair showed Office 365, and it showed off with a game. Who is it referring to in this sentence? OPTIONS: - The product fair - Office 365 --- Answer:", "targets": "Office 365", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Cartman finally decided to get rid of his stuffed animal, Clyde Frog, because he was told by his friends to grow up. Who is \"he\" in this prior sentence? OPTIONS: - Cartman - Clyde Frog", "targets": "Cartman", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Chelsea hate Manchester United because they always come in second. Who is \"they\" in this prior sentence? OPTIONS: - Chelsea - Manchester United", "targets": "Chelsea", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Derrick begged his boss for a raise but he did not give one. OPTIONS: - Derrick - his boss OUT:", "targets": "his boss", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Todd was offered a recruitment letter from the Dean of Admissions himself because he had an athletic ability that was highly regarded by the university. Who is he referring to in this sentence? OPTIONS: - Todd - the Dean of Admissions --- Answer:", "targets": "Todd", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The starships transported the colonists to their new planet since they will be creating a new settlement. they OPTIONS: - The starships - the colonists Answer:", "targets": "the colonists", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: John hit Carl and he hit back. Who he is? OPTIONS: - John - Carl A:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The doctor told Susan that she had cancer. Based on this sentence, who is she? OPTIONS: - The doctor - Susan Answer:", "targets": "Susan", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The spider ate the fly because he looked tasty. Who is \"he\" in this prior sentence? OPTIONS: - The spider - the fly", "targets": "the fly", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The construction workers hollered at the girls when they walked by. Who they is? OPTIONS: - The construction workers - the girls A:", "targets": "the girls", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The employer let John have the assignment even though he did not want it. OPTIONS: - The employer - John OUT:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The sailors fell off the boats because they were drunk. OPTIONS: - The sailors - the boats OUT:", "targets": "The sailors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Jim Carrey convinced Jeff to travel with him to Aspen, since he had wanted to travel to Aspen for a long time. Who he is? OPTIONS: - Jim Carrey - Jeff A:", "targets": "Jeff", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: When Debbie splashed Tina, she got wet. Based on this sentence, who is she? OPTIONS: - Debbie - Tina Answer:", "targets": "Tina", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Medics have a tough job of trying to heal the wounded since they normally have to fix them in hostile environments. OPTIONS: - Medics - the wounded A:", "targets": "Medics", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The coach told the captain that he was fired. Who is \"he\" in this prior sentence? OPTIONS: - The coach - the captain", "targets": "the captain", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Henry changed Jack's oil, because he gave him money. he OPTIONS: - Henry - Jack Answer:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Pat tried to talk to Jill but she did not seem to hear it. Who is she referring to in this sentence? OPTIONS: - Pat - Jill --- Answer:", "targets": "Jill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Coach Jay provided instruction to his son on how to eat healthy, because he wants him to grow up being fit and strong. he OPTIONS: - Coach Jay - his son Answer:", "targets": "Coach Jay", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Hunters excel in tracking animals because they often leave some sort of mark when traveling through the forest. Based on this sentence, who is they? OPTIONS: - Hunters - animals Answer:", "targets": "animals", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Samsonite makes luggage which is highly rated by Luggage Ratings Inc. because they thought the product they rated was highly desirable due to its quality. Based on this sentence, who is they? OPTIONS: - Samsonite - Luggage Ratings Inc. Answer:", "targets": "Luggage Ratings Inc.", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? The coach told the captain that he was proud of him. OPTIONS: - The coach - the captain ANS:", "targets": "The coach", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The red team defeated the blue team because they missed the last penalty kick. Who is \"they\"? OPTIONS: - The red team - the blue team ANS:", "targets": "the blue team", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? The artist told the model that she needed to stand up straighter. OPTIONS: - The artist - the model A:", "targets": "the model", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Prince Goro lectured Cano about the greatness of the emperor since he wanted to make him understand his power. OPTIONS: - Prince Goro - Cano OUT:", "targets": "Prince Goro", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Disney characters at Disney World entertain the audience since they are paying good money to having an enjoyable experience. Who is they referring to in this sentence? OPTIONS: - The Disney characters - the audience --- Answer:", "targets": "the audience", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Robert fired Chris because he no longer needed workers. OPTIONS: - Robert - Chris OUT:", "targets": "Robert", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? T-Mobile's data plan is better than AT&T's data plan since it does not cap data usage. OPTIONS: - T-Mobile - AT&T OUT:", "targets": "T-Mobile", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Mary cleaned Susan's room and she was thankful. OPTIONS: - Mary - Susan A:", "targets": "Susan", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Johnny Cage had to trick Scorpion into stretching himself out too thin since he could not win without fighting smart. OPTIONS: - Johnny Cage - Scorpion ANS:", "targets": "Johnny Cage", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The University declared holiday to students because they were worried about them. OPTIONS: - The University - students OUT:", "targets": "The University", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Luigi rescued Mario because he was in trouble. OPTIONS: - Luigi - Mario A:", "targets": "Mario", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is she? Jill loves Jamie and she does not feel the same way. OPTIONS: - Jill - Jamie OUT:", "targets": "Jamie", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Bill triumphed over John in the boxing ring because he fought cowardly. Who is \"he\" in this prior sentence? OPTIONS: - Bill - John", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The sheep chased the pig because it was fat. Who is it referring to in this sentence? OPTIONS: - The sheep - the pig --- Answer:", "targets": "the pig", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The army organized their forces to sneak past the Decepticons in the city because they needed to use stealth to their advantage. Who is \"they\" in this prior sentence? OPTIONS: - The army - the Decepticons", "targets": "The army", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Space Marines are played more often than Orks, but they are noticed more often at tournaments due to their uniqueness. Who is \"they\"? OPTIONS: - Space Marines - Orks ANS:", "targets": "Orks", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Thor was banished from the kingdom by his father because he was too eager to become the new king. OPTIONS: - Thor - his father OUT:", "targets": "Thor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The Backstreet Boys were much more popular than N-Sync since they were not very good overall. Who is \"they\" in this prior sentence? OPTIONS: - The Backstreet Boys - N-Sync", "targets": "N-Sync", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Rosie beat Mary in Scrabble because she had a good vocabulary. Who is \"she\" in this prior sentence? OPTIONS: - Rosie - Mary", "targets": "Rosie", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Sheila made chicken noodle soup for her daughter, but she wanted cereal instead. she OPTIONS: - Sheila - her daughter Answer:", "targets": "her daughter", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Steve Ballmer took over as CEO of Microsoft after Bill Gates because he was a unicorn. he OPTIONS: - Steve Ballmer - Bill Gates Answer:", "targets": "Steve Ballmer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The Philadelphia Eagles lost to the St. Louis Rams, but it was because they had the home field advantage. Who is \"they\"? OPTIONS: - Philadelphia Eagles - St. Louis Rams ANS:", "targets": "St. Louis Rams", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The manager fired the intern because she was too rebellious. Who she is? OPTIONS: - The manager - the intern A:", "targets": "the intern", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Technician Stepanic crafted advanced opticals for Leforge since he needed to be able to see well for his duties. OPTIONS: - Technician Stepanic - Leforge OUT:", "targets": "Technician Stepanic", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Allen chased the leprechaun because he had a pot of gold. OPTIONS: - Allen - the leprechaun A:", "targets": "the leprechaun", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: A series of injections are used to battle a type of cancer in patients because they have a special type of drug which counteracts this sickness. Who they is? OPTIONS: - A series of injections - patients A:", "targets": "patients", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Youtube has paid out over a million dollars to their channel partners, because they are responsible for bringing millions of viewers to watch their videos. Based on this sentence, who is they? OPTIONS: - Youtube - their channel partners Answer:", "targets": "their channel partners", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The glass hit the floor and it broke. Who it is? OPTIONS: - The glass - the floor A:", "targets": "The glass", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The computer could not run the program because it had too many errors. it OPTIONS: - The computer - the program Answer:", "targets": "the program", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Jack is an optimist, and Adam is a pessimist, then he looks at the cup half empty. Who is \"he\"? OPTIONS: - Jack - Adam ANS:", "targets": "Adam", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Doctor Conrad Murray is accused of negligence in Michael Jackson's death because he overdosed on drugs when the doctor was present. Who is he referring to in this sentence? OPTIONS: - Doctor Conrad Murray - Michael Jackson --- Answer:", "targets": "Michael Jackson", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The dog hunted the fox because it was hungry. Who is it referring to in this sentence? OPTIONS: - The dog - the fox --- Answer:", "targets": "The dog", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Some citizens of the kingdom were put in chains by the royal guard because they have a duty to uphold the King's rule. Who is \"they\" in this prior sentence? OPTIONS: - Some citizens of the kingdom - the royal guard", "targets": "the royal guard", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Black Eyed Peas hosted a huge event for the partners of Intel, since they have lots of money to hire them to perform. Who is \"they\" in this prior sentence? OPTIONS: - Black Eyed Peas - the partners of Intel", "targets": "the partners of Intel", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Cartman finally decided to get rid of his stuffed animal, Clyde Frog, so he was donated to charity. OPTIONS: - Cartman - Clyde Frog ANS:", "targets": "Clyde Frog", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Jim went to Hal's house, and brought his dog. Who is \"his\"? OPTIONS: - Jim - Hal ANS:", "targets": "Jim", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The forensic team managed to link the criminals to the crime since they analyzed the blood samples at the crime scene. OPTIONS: - The forensic team - the criminals A:", "targets": "The forensic team", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? The infection spread throughout the building because it was airborne. OPTIONS: - The infection - the building OUT:", "targets": "The infection", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Battlefield 3 is garnering more attention than Modern Warfare because they contain outdated graphics. OPTIONS: - Battlefield 3 - Modern Warfare OUT:", "targets": "Modern Warfare", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: In last week's tennis match, Djokovic imitated Roddick's serve because he was the better player. Who is he referring to in this sentence? OPTIONS: - Djokovic - Roddick --- Answer:", "targets": "Roddick", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Frosted Flakes is tastier than Fiber One because they use frosting on the cereal. OPTIONS: - Frosted Flakes - Fiber One OUT:", "targets": "Frosted Flakes", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Iphones are selling more than androids because they are trendy. Based on this sentence, who is they? OPTIONS: - Iphones - androids Answer:", "targets": "Iphones", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Ryan won the presidency against Tom because he was not fit for office. Who he is? OPTIONS: - Ryan - Tom A:", "targets": "Tom", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? A monkey ate a lizard and it licked its lips. OPTIONS: - A monkey - a lizard A:", "targets": "A monkey", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Bank of America had to charge their members checking fees unlike Chase since they are not struggling in the current economy. Based on this sentence, who is they? OPTIONS: - Bank of America - Chase Answer:", "targets": "Chase", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The military prepared to go to battle with an Amish colony because they felt threatened. OPTIONS: - The military - an Amish colony ANS:", "targets": "The military", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jack the ripper killed John, but he was not caught yet. Who is he referring to in this sentence? OPTIONS: - Jack - John --- Answer:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: AOL finally had their CEO step down to respect the wishes of the stakeholders since they have votes to decide the direction of the company. Who is \"they\"? OPTIONS: - AOL - the stakeholders ANS:", "targets": "the stakeholders", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Stephen Colbert is funnier than John Stewart since his show has less viewers. Who is \"his\" in this prior sentence? OPTIONS: - Stephen Colbert - John Stewart", "targets": "John Stewart", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Mavericks are able to sell much merchandise to fans this season since they are idolized due to their last NBA championship win. Based on this sentence, who is they? OPTIONS: - The Mavericks - fans Answer:", "targets": "The Mavericks", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Doctor Chen prescribed glasses to Egore, since he conducted the eye exam. OPTIONS: - Doctor Chen - Egore A:", "targets": "Doctor Chen", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The shipping company harvests lobster for their business, because they receive a high demand for this type of seafood. OPTIONS: - The shipping company - lobster OUT:", "targets": "The shipping company", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: William enforced a mandatory choir practice for Ryan since he is struggling with his singing abilities. Who he is? OPTIONS: - William - Ryan A:", "targets": "Ryan", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Gladiators are viewed better than Slaves because they fight to the death in the arena. OPTIONS: - Gladiators - Slaves OUT:", "targets": "Gladiators", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Herald Simmons has tremendous skill in rousing up the audience for Knight Keller because he has such excellent speaking qualities. Based on this sentence, who is he? OPTIONS: - Herald Simmons - Knight Keller Answer:", "targets": "Herald Simmons", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Verizon Fios provides hundreds of channels to millions of viewers, but they sometimes want even more than what is available. OPTIONS: - Verizon Fios - millions of viewers OUT:", "targets": "millions of viewers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Shigeru Miyamoto was the mentor of Satoshi Tajiri, so he taught many things. he OPTIONS: - Shigeru Miyamoto - Satoshi Tajiri Answer:", "targets": "Shigeru Miyamoto", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The police arrested suspected members of Anonymous because they are cracking down on hackers. Who is \"they\"? OPTIONS: - The police - Anonymous ANS:", "targets": "The police", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [it] The knife cut through the fence because it was rusty. OPTIONS: - The knife - the fence OUT:", "targets": "the fence", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Chris was running after John, because he stole his watch. Who is \"he\" in this prior sentence? OPTIONS: - Chris - John", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Skype has entered a partnership with Facebook, and they hope that this can help to promote their video calling. Based on this sentence, who is they? OPTIONS: - Skype - Facebook Answer:", "targets": "Skype", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The orchestra was booed by the audience because they had performed poorly. Who is they referring to in this sentence? OPTIONS: - The orchestra - the audience --- Answer:", "targets": "The orchestra", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The wolves ate the cows because they were delicious. Who is \"they\"? OPTIONS: - The wolves - the cows ANS:", "targets": "the cows", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The kids asked their neighbors if they had any candy on Halloween. Who is \"they\" in this prior sentence? OPTIONS: - The kids - their neighbors", "targets": "their neighbors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Clinton wanted Obama to run for president because he would win. OPTIONS: - Clinton - Obama A:", "targets": "Obama", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Gold is more popular than black because it is shiny. Who is \"it\"? OPTIONS: - Gold - black ANS:", "targets": "Gold", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The counselor gave the student advice because he is on the wrong track in life. Who is \"he\"? OPTIONS: - The counselor - the student ANS:", "targets": "the student", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jimbo attacked Bobbert because he stole an elephant from the zoo. he OPTIONS: - Jimbo - Bobbert Answer:", "targets": "Bobbert", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Chelsea hate Manchester United because they are too cocky. OPTIONS: - Chelsea - Manchester United OUT:", "targets": "Manchester United", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Jimbo ate the fish that Bobbert prepared because he was a good cook. OPTIONS: - Jimbo - Bobbert OUT:", "targets": "Bobbert", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Starbuck employees make all the drinks on the spot for morning customers so they get their drinks nice and hot. Who is they referring to in this sentence? OPTIONS: - The Starbuck employees - morning customers --- Answer:", "targets": "morning customers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Medvedev will cede the presidency to Putin because he is less popular. he OPTIONS: - Medvedev - Putin Answer:", "targets": "Medvedev", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is she in the following sentence? Kate Middleton is viewed as a newer generation Princess Diana because she is also being compared as a fashion symbol. OPTIONS: - Kate Middleton - Princess Diana ANS:", "targets": "Kate Middleton", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Martial Arts actors are often accused as being frauds by the public since they can only fight in fake scenarios. Based on this sentence, who is they? OPTIONS: - Martial Arts actors - the public Answer:", "targets": "Martial Arts actors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Henry changed Jack's oil, because he needed money. Who is \"he\"? OPTIONS: - Henry - Jack ANS:", "targets": "Henry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Knights preferred dragons over horses because they could fly. they OPTIONS: - horses - dragons Answer:", "targets": "dragons", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Scribes were often hired by nobles in the Medieval period although they were able to read and write themselves. Based on this sentence, who is they? OPTIONS: - Scribes - nobles Answer:", "targets": "nobles", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The lion bit the gazelle because it had horns. it OPTIONS: - The lion - the gazelle Answer:", "targets": "the gazelle", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The boy ran from the cop because he saw the crime. Who is he referring to in this sentence? OPTIONS: - The boy - the cop --- Answer:", "targets": "the cop", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Channel 6 news team gave a play by play coverage of the escaped convicts, so they had their escape reported to the world. Based on this sentence, who is they? OPTIONS: - Channel 6 news team - the escaped convicts Answer:", "targets": "the escaped convicts", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The Magnificent Five will battle it out with Shen Yu's forces, but they may try and run away. OPTIONS: - The Magnificent Five - Shen Yu's forces ANS:", "targets": "Shen Yu's forces", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The cops maced the protesters because they blindly follow orders. OPTIONS: - The cops - the protesters A:", "targets": "The cops", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: New York City was grateful for the sacrifices the American Armed Forces did to save their city because they managed to divert a devastating attack. Who is they referring to in this sentence? OPTIONS: - New York City - the American Armed Forces --- Answer:", "targets": "the American Armed Forces", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Students hate exams because they are lazy. OPTIONS: - Students - exams OUT:", "targets": "Students", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Chase Sapphire has a 24 hour service line for card holders so they would be available to help if their customer encounters trouble. Based on this sentence, who is they? OPTIONS: - Chase Sapphire - card holders Answer:", "targets": "Chase Sapphire", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The students fell asleep during the professor's lectures because they were boring. OPTIONS: - The students - the professor's lectures ANS:", "targets": "the professor's lectures", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: We gave the toys to the toddlers, because they wanted to play. Based on this sentence, who is they? OPTIONS: - the toys - the toddlers Answer:", "targets": "the toddlers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Bill punched Larry and he was hurt. OPTIONS: - Bill - Larry ANS:", "targets": "Larry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The security forces were not able to stop the mass of apes since they did not have the manpower to stop that many. OPTIONS: - The security forces - the mass of apes OUT:", "targets": "The security forces", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The military prepared to go to battle with an Amish colony because they were amassing a dangerous number of goats without a permit. Who is they referring to in this sentence? OPTIONS: - The military - an Amish colony --- Answer:", "targets": "an Amish colony", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jesus appeared to Thomas in order to show that he had unfounded doubts. Who is he referring to in this sentence? OPTIONS: - Jesus - Thomas --- Answer:", "targets": "Thomas", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The Centurion lent Doctor Who his ear since he had pledged his loyalty. Who is \"he\"? OPTIONS: - The Centurion - Doctor Who ANS:", "targets": "The Centurion", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Lions eat zebras because they are meaty. Who they is? OPTIONS: - Lions - zebras A:", "targets": "zebras", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The elephant trampled a fish and it died. it OPTIONS: - The elephant - a fish Answer:", "targets": "a fish", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The preservation society managed to rescue a rare species of birds since they have the funding and resources to dedicate to saving animals. they OPTIONS: - The preservation society - a rare species of birds Answer:", "targets": "The preservation society", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The government wants to prohibit the people from playing chess on Monday because they want Mondays to be more productive. OPTIONS: - The government - the people A:", "targets": "The government", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jesus appeared to Thomas in order to show that he had risen. he OPTIONS: - Jesus - Thomas Answer:", "targets": "Jesus", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Skype has entered a partnership with Facebook, and they hope that more members join their social network. Who is \"they\" in this prior sentence? OPTIONS: - Skype - Facebook", "targets": "Facebook", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The government tried to free the journalists from North Korea, but they were held captive. they OPTIONS: - The government - the journalists Answer:", "targets": "the journalists", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The kitten played with the yarn because it was bored. Who is it referring to in this sentence? OPTIONS: - The kitten - the yarn --- Answer:", "targets": "The kitten", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The police captured the criminals because they were less prepared. Who is \"they\"? OPTIONS: - The police - the criminals ANS:", "targets": "the criminals", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Steven assassinated the president because he was paid to do it. Who he is? OPTIONS: - Steven - the president A:", "targets": "Steven", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The police arrested the criminals since they break the law. Based on this sentence, who is they? OPTIONS: - The police - the criminals Answer:", "targets": "the criminals", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Cats are smarter than dogs because they always land on their feet. OPTIONS: - Cats - dogs OUT:", "targets": "Cats", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The judge was fond of the contestant so he received the gold medal. Who is \"he\"? OPTIONS: - The judge - the contestant ANS:", "targets": "the contestant", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Doctor Jenner continued his work on a vaccine for John because he has a deadly disease. OPTIONS: - Doctor Jenner - John OUT:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: James asked Robert for a favor, but he was refused. Who he is? OPTIONS: - James - Robert A:", "targets": "James", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is she in the following sentence? The waitress noticed that Rebecca's glass was empty, so she filled it. OPTIONS: - The waitress - Rebecca ANS:", "targets": "The waitress", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Joe tried to get Tom to wake up, but he couldn't. Who he is? OPTIONS: - Joe - Tom A:", "targets": "Joe", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Will Smith and his new movie is highly anticipated by movie critic, John Billic, because he has thus far been a huge hit. Based on this sentence, who is he? OPTIONS: - Will Smith - John Billic Answer:", "targets": "Will Smith", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? The boy tried to address his friend, but he could not speak. OPTIONS: - The boy - his friend A:", "targets": "The boy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? John asked the scientist what he could do to help. OPTIONS: - John - the scientist ANS:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Tom likes John because he has a cool name. OPTIONS: - Tom - John OUT:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The employees of Six Flags denied the customers access to the ride, but they can still go on other rides. OPTIONS: - The employees of Six Flags - the customers OUT:", "targets": "the customers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Misty was replaced by May because she was the only one available. Who is \"she\"? OPTIONS: - Misty - May ANS:", "targets": "May", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The invaders showed no mercy to the defenders, but they would not surrender anyway. OPTIONS: - The invaders - the defenders OUT:", "targets": "the defenders", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Dad yelled at Sam because he was mad. Who he is? OPTIONS: - Dad - Sam A:", "targets": "Dad", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The Crusaders fought many unholy enemies since they were considered unholy by the priests. Who they is? OPTIONS: - The Crusaders - many unholy enemies A:", "targets": "many unholy enemies", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Management gave the workers a raise because they had no other choice. OPTIONS: - Management - the workers A:", "targets": "Management", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Sarah tried to ignore the elephant in the room, but she could not bear the awkwardness. Who she is? OPTIONS: - Sarah - the elephant in the room A:", "targets": "Sarah", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? When the preschoolers visited the senior citizens, they were surprisingly well behaved. OPTIONS: - the preschoolers - the senior citizens A:", "targets": "the preschoolers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Joe tried to get Tom to wake up, but he wouldn't. OPTIONS: - Joe - Tom OUT:", "targets": "Tom", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: George talked to Bill because he was nervous. Who is he referring to in this sentence? OPTIONS: - George - Bill --- Answer:", "targets": "George", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Joy was jealous of Jenny because she was making more money than her. Who is she referring to in this sentence? OPTIONS: - Joy - Jenny --- Answer:", "targets": "Jenny", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Michelle likes green shirts while Sarah prefers blue, because she likes the color of the sky. OPTIONS: - Michelle - Sarah A:", "targets": "Sarah", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Some people proclaimed at the Ontario conventions that we need to colonize planets in the near future since they are places where people can voice these kinds of concerns among like minded people. Who is \"they\" in this prior sentence? OPTIONS: - Some people - the Ontario conventions", "targets": "the Ontario conventions", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Technician Stepanic crafted advanced opticals for Leforge, but he would still prefer to see without such devices. OPTIONS: - Technician Stepanic - Leforge OUT:", "targets": "Leforge", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? NATO forces did precision predator strikes for the Libyan rebels because they did not have the capabilities themselves. OPTIONS: - NATO forces - Libyan rebels ANS:", "targets": "Libyan rebels", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Kenmore is known for making superb appliances which is sold at Sears since they constantly leave customers happy with their high quality brand. Based on this sentence, who is they? OPTIONS: - Kenmore - Sears Answer:", "targets": "Kenmore", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The employees of Six Flags denied the customers access to the ride since they deemed the ride unsafe. Who is \"they\" in this prior sentence? OPTIONS: - The employees of Six Flags - the customers", "targets": "The employees of Six Flags", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Harrison looked into illegal accusations against his partner, Bryan, because he needed to know if these allegations would hurt his business. OPTIONS: - Harrison - Bryan ANS:", "targets": "Harrison", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Hybrid cars produce less pollution than diesel trucks because they use less gas and more electricity. they OPTIONS: - Hybrid cars - diesel trucks Answer:", "targets": "Hybrid cars", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? John tricked Bill because he was mischievous. OPTIONS: - John - Bill OUT:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "John flicked Bill because he had a fly on his shirt. Who is \"he\" in this prior sentence? OPTIONS: - John - Bill", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? The policeman finally caught the criminal, because he used pepper spray and handcuffs. OPTIONS: - The policeman - the criminal OUT:", "targets": "The policeman", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The veterans defeated the newcomers because they were less experienced. Who is \"they\"? OPTIONS: - The veterans - the newcomers ANS:", "targets": "the newcomers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The government placed a tax on the product so it could profit from sales. Based on this sentence, who is it? OPTIONS: - The government - the product Answer:", "targets": "The government", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Policemen advocated the use of wire taps to track terrorists, because they could not catch them without those tools. Who is they referring to in this sentence? OPTIONS: - Policemen - terrorists --- Answer:", "targets": "Policemen", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The Japanese eat a lot more seafood than the Americans because they have a lot of people who do not live near the ocean. Who they is? OPTIONS: - The Japanese - the Americans A:", "targets": "the Americans", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Republicans preferred Romney to Perry because he would not think his supporters were heartless. OPTIONS: - Romney - Perry ANS:", "targets": "Romney", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Fry's Electronics is more successful than Comp USA since they cannot compete competitively in price. they OPTIONS: - Fry's Electronics - Comp USA Answer:", "targets": "Comp USA", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The zookeepers make sure to feed the chimps on a daily schedule so they can remain healthy and content. Based on this sentence, who is they? OPTIONS: - The zookeepers - the chimps Answer:", "targets": "the chimps", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Knight Commander Roddick was plagued by a vision of his dead son because he was killed due to a lack of protection from his father. Who he is? OPTIONS: - Knight Commander Roddick - his dead son A:", "targets": "his dead son", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Police sweep bums off the benches of the park although they do not have a place to stay and sleep at night. they OPTIONS: - Police - bums Answer:", "targets": "bums", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [it] The army crossed the river because it was retreating. OPTIONS: - The army - the river OUT:", "targets": "The army", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is it in the following sentence? The computer rejected the password because it was incorrect. OPTIONS: - The computer - the password ANS:", "targets": "the password", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Jimbo was running from Bobbert because he wanted to get to the car first. OPTIONS: - Jimbo - Bobbert A:", "targets": "Jimbo", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "American Airlines offers upgrades for their preferred passengers since they want them to continue flying with them. Who is \"they\" in this prior sentence? OPTIONS: - American Airlines - their preferred passengers", "targets": "American Airlines", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The police arrested 700 protesters in New York since they had to prevent them from blocking the Manhatten bridge. OPTIONS: - The police - 700 protesters OUT:", "targets": "700 protesters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Jill was writing on a pad for Jane because she needed directions. OPTIONS: - Jill - Jane A:", "targets": "Jane", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Kenmore is known for making superb appliances which is sold at Sears, because they are the best place to sell top brand appliances. Who is \"they\" in this prior sentence? OPTIONS: - Kenmore - Sears", "targets": "Sears", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? Paper beats rock, but it is beaten by scissors. OPTIONS: - Paper - rock A:", "targets": "Paper", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The gun owner fired at the burglar because he stole items. OPTIONS: - The gun owner - the burglar OUT:", "targets": "the burglar", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Sheila made chicken noodle soup for her daughter since she knew it would help her get over her cold. she OPTIONS: - Sheila - her daughter Answer:", "targets": "Sheila", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "American Airlines offers upgrades for their preferred passengers so they continue choosing their airlines over others. Who is \"they\" in this prior sentence? OPTIONS: - American Airlines - their preferred passengers", "targets": "their preferred passengers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Prince Goro lectured Cano about the greatness of the emperor, because he was ignorant on realizing how powerful he really was. OPTIONS: - Prince Goro - Cano OUT:", "targets": "Cano", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John ridiculed Bill because he liked to look down upon others. Based on this sentence, who is he? OPTIONS: - John - Bill Answer:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Todd told Bill that he needed some money. OPTIONS: - Todd - Bill ANS:", "targets": "Todd", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Dance Instructor Kate offers advice to Shelly because she wants her to become a professional dancer one day. she OPTIONS: - Dance Instructor Kate - Shelly Answer:", "targets": "Dance Instructor Kate", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The boy tried to address his friend, but he could not hear. Who is \"he\" in this prior sentence? OPTIONS: - The boy - his friend", "targets": "his friend", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Lions love gazelles because they are delicious. OPTIONS: - Lions - gazelles ANS:", "targets": "gazelles", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Walmart is promoting their Black Friday sale heavily in commercials, since they are the best medium to get information out to the average consumer. OPTIONS: - Walmart - commercials OUT:", "targets": "commercials", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Shawn hit Joe but he did not scream. OPTIONS: - Shawn - Joe OUT:", "targets": "Joe", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Boyfriends always try to go out of their way to treat their girlfriends with respect, but they want to be treated with respect as well. OPTIONS: - Boyfriends - their girlfriends ANS:", "targets": "Boyfriends", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Google is catching up to Firefox in the percentage of users because they have a faster and more reliable browser. Who is they referring to in this sentence? OPTIONS: - Google - Firefox --- Answer:", "targets": "Google", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Johnson wanted to make friendship with David, because he is well connected. Who he is? OPTIONS: - Johnson - David A:", "targets": "David", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Xbox 360 outsold the Nintendo Wii by 300 percent because they are losing their popularity. they OPTIONS: - The Xbox 360 - the Nintendo Wii Answer:", "targets": "the Nintendo Wii", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Stark Industries produces the best technology for the military because they have a number of brilliant scientists. OPTIONS: - Stark Industries - the military A:", "targets": "Stark Industries", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Sam cheated Sally but she did not cry. OPTIONS: - Sally - Sam A:", "targets": "Sally", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: David hit Bill and he enjoyed it. Who he is? OPTIONS: - David - Bill A:", "targets": "David", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "A person is more productive on an IDE than a text editor, therefore it should be used in general practice. Who is \"it\" in this prior sentence? OPTIONS: - an IDE - a text editor", "targets": "an IDE", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Chase Freedom provides quarterly bonuses as incentives for accounts, since they want them to use their card. OPTIONS: - Chase Freedom - accounts ANS:", "targets": "Chase Freedom", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Mark tackled the quarterback, but he was penalized. OPTIONS: - Mark - the quarterback OUT:", "targets": "Mark", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Dallas Cowboys lost their lead to the Redskins because they started to perform very well in the second half. Based on this sentence, who is they? OPTIONS: - The Dallas Cowboys - the Redskins Answer:", "targets": "the Redskins", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Lions love gazelles because they eat them. OPTIONS: - Lions - gazelles A:", "targets": "Lions", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The townspeople ate the unicorns because they were hungry. OPTIONS: - The townspeople - the unicorns ANS:", "targets": "The townspeople", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The teachers failed the students because they answered the test incorrectly. they OPTIONS: - The teachers - the students Answer:", "targets": "the students", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The peace emissaries arrived to negotiate a peace treaty for the warring population, but they will be difficult to find common ground for. they OPTIONS: - The peace emissaries - the warring population Answer:", "targets": "the warring population", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Apple recently had to recall 1st generation IPods, but they did so six years after it was initially released. Who is \"they\" in this prior sentence? OPTIONS: - Apple - 1st generation IPods", "targets": "Apple", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The company accepted the resolution because it was desperate. Who it is? OPTIONS: - The company - the resolution A:", "targets": "The company", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? Steve threw the bowling ball down the lane when it was clear. OPTIONS: - the bowling ball - the lane A:", "targets": "the lane", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Gates is richer than Jobs, so he is not richest person. Who he is? OPTIONS: - Gates - Jobs A:", "targets": "Jobs", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "My parents gave the neighbors tickets to Six Flags since they had extras. Who is \"they\" in this prior sentence? OPTIONS: - My parents - the neighbors", "targets": "My parents", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The professor told John that he passed him. Who he is? OPTIONS: - The professor - John A:", "targets": "The professor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The chef made breakfast for the captain because he was required to. Who is he referring to in this sentence? OPTIONS: - The chef - the captain --- Answer:", "targets": "The chef", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Mike tried to follow Tom but he was hard to see. OPTIONS: - Mike - Tom OUT:", "targets": "Tom", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Management gave the workers a raise because they had threatened to strike. Who they is? OPTIONS: - Management - the workers A:", "targets": "the workers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: MIT accepted the students, because they had good grades. Who is \"they\"? OPTIONS: - MIT - the students ANS:", "targets": "the students", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? The teacher did not recommend William because he had high standards. OPTIONS: - The teacher - William A:", "targets": "The teacher", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? New Orleans is renown for their unique style of crawfish so they have many restaurants which sell it. OPTIONS: - New Orleans - crawfish A:", "targets": "New Orleans", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Shawn hit Joe but he did not apologize. Who is \"he\"? OPTIONS: - Shawn - Joe ANS:", "targets": "Shawn", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The police tried to blockade the bridge to prevent the criminals from escaping because they needed to pass this route to gain freedom. they OPTIONS: - The police - the criminals Answer:", "targets": "the criminals", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The company declared bonus for the employees because they made huge profits. Who they is? OPTIONS: - The company - the employees A:", "targets": "The company", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? To save the world, Liu Kang must defeat Shang Hai in mortal combat, since he would be able to invade the world if he is not defeated. OPTIONS: - Liu Kang - Shang Hai ANS:", "targets": "Shang Hai", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Some people proclaimed at the Ontario conventions that we need to colonize planets in the near future because they think we may face extinction if Aliens ever came for our resources. Who is they referring to in this sentence? OPTIONS: - Some people - the Ontario conventions --- Answer:", "targets": "Some people", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The golfers waved on the players because they were holding them up. OPTIONS: - The golfers - the players A:", "targets": "The golfers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The construction workers hollered at the girls when they saw them. OPTIONS: - The construction workers - the girls ANS:", "targets": "The construction workers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Nvidia is giving away two top of the line laptops to its users, so they will be giving them away for free. Who is \"they\" in this prior sentence? OPTIONS: - Nvidia - its users", "targets": "Nvidia", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: James always gives orders to Owen because he is very bossy. Who he is? OPTIONS: - James - Owen A:", "targets": "James", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: To save the world, Liu Kang must defeat Shang Hai in mortal combat, but if he fails, then the world as he knows it will fall. Who he is? OPTIONS: - Liu Kang - Shang Hai A:", "targets": "Liu Kang", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The ski instructors taught the children the basics of skiing since they are trying to learn. OPTIONS: - The ski instructors - the children OUT:", "targets": "the children", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Mike helped Jack with his assignment because he politely asked him to. Who he is? OPTIONS: - Mike - Jack A:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Knights preferred dragons over horses because they could not fly. OPTIONS: - horses - dragons OUT:", "targets": "horses", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The poor steal from the rich because they need more money. OPTIONS: - The poor - the rich ANS:", "targets": "The poor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Chrome is finally set to pull ahead of Firefox in November because they have increased their popularity with internet users. Based on this sentence, who is they? OPTIONS: - Chrome - Firefox Answer:", "targets": "Chrome", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Jack is an optimist, and Adam is a pessimist, then he looks at the cup half full. OPTIONS: - Jack - Adam OUT:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The master rewarded the dog because he was a good companion. OPTIONS: - The master - the dog OUT:", "targets": "the dog", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Taco needs hot sauce because it does not taste as good alone. Who is \"it\"? OPTIONS: - Taco - hot sauce ANS:", "targets": "Taco", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Hybrid cars are much more fuel efficient than gasoline powered cars, but they have not caught on in popularity yet. OPTIONS: - Hybrid cars - gasoline powered cars ANS:", "targets": "Hybrid cars", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Chase Freedom provides quarterly bonuses as incentives for accounts but they do not always consider the incentive as much value. OPTIONS: - Chase Freedom - accounts ANS:", "targets": "accounts", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The academic clubs lost their members because they were poorly funded. OPTIONS: - The academic clubs - their members OUT:", "targets": "The academic clubs", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: DVD Players are slowly being replaced by Blu Ray Systems, but they will still exist for years to come. Based on this sentence, who is they? OPTIONS: - DVD Players - Blu Ray Systems Answer:", "targets": "DVD Players", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The Magnificent Five will battle it out with Shen Yu's forces because they will need to end his rein of terror. Who is \"they\" in this prior sentence? OPTIONS: - The Magnificent Five - Shen Yu's forces", "targets": "The Magnificent Five", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The authorities detained the hikers because they were prejudiced. Based on this sentence, who is they? OPTIONS: - The authorities - the hikers Answer:", "targets": "The authorities", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Emma did not pass the ball to Janie, although she should have. OPTIONS: - Emma - Janie A:", "targets": "Emma", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: People raise dogs because they are obedient. Based on this sentence, who is they? OPTIONS: - People - dogs Answer:", "targets": "dogs", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Spiderman defeated Magnito because he is a bad guy. OPTIONS: - Spiderman - Magnito ANS:", "targets": "Magnito", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The wolves attacked the travelers in the forest since they were not welcomed near their home. OPTIONS: - The wolves - the travelers OUT:", "targets": "The wolves", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Gary envied Bill because he was poor. OPTIONS: - Gary - Bill OUT:", "targets": "Gary", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Medvedev will cede the presidency to Putin because he is more popular. Who is he referring to in this sentence? OPTIONS: - Medvedev - Putin --- Answer:", "targets": "Putin", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The assembly line workers were told they had been fired by the company, because they could cut costs. Who is \"they\"? OPTIONS: - The assembly line workers - the company ANS:", "targets": "the company", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Batman is always teaching Robin new techniques and tips, since he is his mentor. OPTIONS: - Batman - Robin A:", "targets": "Batman", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Walmart has leaked pages of their Black Friday Ad to the users of the internet, but they will have many other ads to look at to choose from. Who they is? OPTIONS: - Walmart - the users of the internet A:", "targets": "the users of the internet", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: James cheated off Henry's test, and the Teacher failed him. Who him is? OPTIONS: - James - Henry A:", "targets": "James", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Rob was granted a gun license while Jon was not, because he had a criminal past. Who is \"he\"? OPTIONS: - Rob - Jon ANS:", "targets": "Jon", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The Chinese Empire banished the Wu Shu family from the kingdom since they tried to avoid conflict. OPTIONS: - The Chinese Empire - the Wu Shu family ANS:", "targets": "The Chinese Empire", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The Minecraft developers managed to win their case regarding copyright infringement against Bethesda Studios, but they will probably file another lawsuit again. OPTIONS: - The Minecraft developers - Bethesda Studios ANS:", "targets": "Bethesda Studios", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is him? The Secretary and the President met about him being elected. OPTIONS: - The Secretary - the President OUT:", "targets": "the President", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: A series of injections are used to battle a type of cancer in patients, but they do not always provide a hundred percent success rate. Based on this sentence, who is they? OPTIONS: - A series of injections - patients Answer:", "targets": "A series of injections", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The US Health inspection board shut down several food factories since they were violating many rules and regulations. OPTIONS: - The US Health inspection board - several food factories OUT:", "targets": "several food factories", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Software gives more profit over hardware since they are costs with producing the materials each time. Who is \"they\"? OPTIONS: - Software - hardware ANS:", "targets": "hardware", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Modern Warfare has big expectations to live up to due to the successful release of Battlefield 3 since they need to pull fans to their game instead. they OPTIONS: - Modern Warfare - Battlefield 3 Answer:", "targets": "Modern Warfare", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "David hit Bill because Mary really liked him. Who is \"him\" in this prior sentence? OPTIONS: - David - Bill", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The officers chose a planet to send the new soldiers so they could receive experience in hostile environments. OPTIONS: - The officers - the new soldiers A:", "targets": "the new soldiers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Chuck Norris can beat any man in a fight, unless he is tied up and blindfolded. OPTIONS: - Chuck Norris - any man OUT:", "targets": "Chuck Norris", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Insurance companies charge a premium if people had an accident before because they will have to pay out more most likely for that person. Who they is? OPTIONS: - Insurance companies - people A:", "targets": "Insurance companies", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Obama beat John McCain, because he was the better candidate. Who is \"he\"? OPTIONS: - Obama - John McCain ANS:", "targets": "Obama", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The boy ran from the cop because he committed the crime. Who is \"he\"? OPTIONS: - The boy - the cop ANS:", "targets": "The boy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Ashton Kutcher replaced Charlie Sheen as the main character of Two and a Half Men, but he did not leave the show willingly. Who is \"he\"? OPTIONS: - Ashton Kutcher - Charlie Sheen ANS:", "targets": "Charlie Sheen", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? The food in the refrigerator went bad because it was past the expiration date. OPTIONS: - The food - the refrigerator A:", "targets": "The food", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: I chopped down the tree with my axe because it was sharp. Who is it referring to in this sentence? OPTIONS: - the tree - my axe --- Answer:", "targets": "my axe", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Channel 6 news team gave a play by play coverage of the escaped convicts because they needed to report the news. OPTIONS: - Channel 6 news team - the escaped convicts OUT:", "targets": "Channel 6 news team", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Fred drove to Mack's tire shop, and he sold a tire. Who is he referring to in this sentence? OPTIONS: - Fred - Mack --- Answer:", "targets": "Mack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [she] Alexandra told Kelly not to get a tattoo because she raised her conservatively. OPTIONS: - Alexandra - Kelly OUT:", "targets": "Alexandra", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The AirForce is more appealing than the Army, but they are just as important. Who is \"they\"? OPTIONS: - The AirForce - the Army ANS:", "targets": "the Army", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The advisor told the President that he should declare war. Who is he referring to in this sentence? OPTIONS: - The advisor - the President --- Answer:", "targets": "the President", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The FBI usually take over the crime scene from the police since they are more qualified in handling these situations. Who is \"they\" in this prior sentence? OPTIONS: - The FBI - the police", "targets": "The FBI", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Will Smith and his new movie is highly anticipated by movie critic, John Billic, because he felt his role was well played in the previous movies. OPTIONS: - Will Smith - John Billic ANS:", "targets": "John Billic", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Jack shouted at Bill because he crashed the car. OPTIONS: - Jack - Bill ANS:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] John appreciated Bill because he had been in need. OPTIONS: - John - Bill OUT:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Apple defeated Microsoft in the war because they were creative. Who is \"they\"? OPTIONS: - Apple - Microsoft ANS:", "targets": "Apple", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jim Carrey convinced Jeff to travel with him to Aspen, since he wanted to have a travel buddy to visit his girlfriend. Based on this sentence, who is he? OPTIONS: - Jim Carrey - Jeff Answer:", "targets": "Jim Carrey", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The gardener watered the owner's rose because he was doing his job. Who is he referring to in this sentence? OPTIONS: - The gardener - the owner --- Answer:", "targets": "The gardener", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Chase will have a cyber monday sale for credit users since they want to entice users to continue using their cards. Who they is? OPTIONS: - Chase - credit users A:", "targets": "Chase", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Gamestop pulled Square Enix's game, \"Dues Ex\" from the shelves, because they would not sell a game that promoted another game service. Who is they referring to in this sentence? OPTIONS: - Gamestop - Square Enix --- Answer:", "targets": "Square Enix", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] John disliked Bill, but he did not know. OPTIONS: - John - Bill OUT:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Steve loved Bush but he did not accept. Who is \"he\" in this prior sentence? OPTIONS: - Steve - Bush", "targets": "Bush", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The airline unions constantly go on strike against the airlines because they do not care for the employees. OPTIONS: - The airline unions - the airlines OUT:", "targets": "the airlines", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Tom gave James a coat because he was cold. OPTIONS: - Tom - James OUT:", "targets": "James", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The magician pulled a rabbit out of his hat. his OPTIONS: - The magician - a rabbit Answer:", "targets": "The magician", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The museum curator looked at the patron and said he should leave. OPTIONS: - The museum curator - the patron OUT:", "targets": "the patron", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Sega lost to Nintendo because they were inferior. Who they is? OPTIONS: - Sega - Nintendo A:", "targets": "Sega", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Sprint is now selling the IPhone just like Verizon, because they want to also attract customers who are fans of the IPhone. Based on this sentence, who is they? OPTIONS: - Sprint - Verizon Answer:", "targets": "Sprint", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The glass told the toaster that it liked chocolate. Who is \"it\" in this prior sentence? OPTIONS: - The glass - the toaster", "targets": "The glass", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John remembered Bill because he had had been thinking about wicker chairs. Who is he referring to in this sentence? OPTIONS: - John - Bill --- Answer:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Aaron kissed Dan because he wanted him to. OPTIONS: - Aaron - Dan OUT:", "targets": "Dan", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "I think the referee treats Vick like a running back because he has distinct style of play. Who is \"he\" in this prior sentence? OPTIONS: - the referee - Vick", "targets": "Vick", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Western Digital may disappoint their shareholders this season since they have slowed down production in their Thailand factories due to flooding. Who is \"they\"? OPTIONS: - Western Digital - their shareholders ANS:", "targets": "Western Digital", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: There is currently more work on coreference resolution than on chunking because it is a problem that is still far from being solved. Who it is? OPTIONS: - coreference resolution - chunking A:", "targets": "coreference resolution", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The car hop brought the man his tray, but he forgot his french fries. he OPTIONS: - The car hop - the man Answer:", "targets": "The car hop", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Neil Patrick Harris is a better singer than Dave Chappelle,since he does not have time to become a good singer due to his comedy career. OPTIONS: - Neil Patrick Harris - Dave Chappelle ANS:", "targets": "Dave Chappelle", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Soldiers of the armed forces were slowly being phased out by genetically engineered soldiers because they were created solely for the purpose of excelled warfare. they OPTIONS: - Soldiers of the armed forces - genetically engineered soldiers Answer:", "targets": "genetically engineered soldiers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Apple sued Samsung because they felt their intellectual properties were being infringed upon. Who is \"they\" in this prior sentence? OPTIONS: - Apple - Samsung", "targets": "Apple", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Kurt flew in Alex's plane, and he asked him to come again. OPTIONS: - Kurt - Alex OUT:", "targets": "Alex", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The cat looked at the big dog, and it barked menacingly. Who is \"it\" in this prior sentence? OPTIONS: - The cat - the big dog", "targets": "the big dog", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Rocky lost to Clubber Lang because he was not ready for the fight. Who is he referring to in this sentence? OPTIONS: - Rocky - Clubber Lang --- Answer:", "targets": "Rocky", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Student A beat student B, because he slacked off. OPTIONS: - Student A - student B OUT:", "targets": "student B", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Anna tucked Olivia into bed because she fell asleep on the couch. OPTIONS: - Anna - Olivia A:", "targets": "Olivia", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Amazon predicted that oldies fans would like the Queen, Led Zeppelin, Frank Sinatra, The Beatles, and the Dave Matthews Band, but they were totally inaccurate. they OPTIONS: - Amazon - oldies fans Answer:", "targets": "Amazon", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Coach Jay provided instruction to his son on how to eat healthy so that he can live longer. OPTIONS: - Coach Jay - his son ANS:", "targets": "his son", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The lifeguards evacuated the swimmers from the public pool since they needed to clean the pool. OPTIONS: - The lifeguards - the swimmers OUT:", "targets": "The lifeguards", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? The cap fell off the bottle because it was pressurized. OPTIONS: - The cap - the bottle A:", "targets": "the bottle", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Santa Claus and his elves distributed millions of presents worldwide to the children of the world, but they do not all believe in them being able to give presents worldwide in a night. OPTIONS: - Santa Claus and his elves - the children of the world OUT:", "targets": "the children of the world", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Allen laughed at Jimmy because he was making fun of him. Who is \"he\"? OPTIONS: - Allen - Jimmy ANS:", "targets": "Allen", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The separatists launched a surprise attack against the empire so they could turn the tide of battle. OPTIONS: - The separatists - the empire ANS:", "targets": "The separatists", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Sam hates Martha Stewart, because she felt that she was hypocritical. Who is \"she\"? OPTIONS: - Sam - Martha Stewart ANS:", "targets": "Sam", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The police arrested suspected members of Anonymous because they are accused of hacking company data. they OPTIONS: - The police - Anonymous Answer:", "targets": "Anonymous", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The bartenders threw ice at the Jersey Shore cast because they were not wanted in the club. Who is they referring to in this sentence? OPTIONS: - The bartenders - the Jersey Shore cast --- Answer:", "targets": "the Jersey Shore cast", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The Disney characters at Disney World entertain the audience because they are there to keep people happy. OPTIONS: - The Disney characters - the audience A:", "targets": "The Disney characters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Ryan has much less hair than Gary, so he does not go out in public without a hat. Based on this sentence, who is he? OPTIONS: - Ryan - Gary Answer:", "targets": "Ryan", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Retail stores have been trying to pass an internet tax on online retailers for the past few years because they feel it would level the playing field. Who is \"they\" in this prior sentence? OPTIONS: - Retail stores - online retailers", "targets": "Retail stores", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Ken has Adam's bike, because he took it from him. he OPTIONS: - Ken - Adam Answer:", "targets": "Ken", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Mark almost made a deal with Slimy Jack, but backed down when the man thought of his reputation for honesty. the man OPTIONS: - Mark - Slimy Jack Answer:", "targets": "Mark", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Liu Kang threw the bags of Johnny Cage into the water because he was annoyed that he thought he was a baggage boy. Who is \"he\"? OPTIONS: - Liu Kang - Johnny Cage ANS:", "targets": "Liu Kang", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The separatists launched a surprise attack against the empire so they could be caught off guard. OPTIONS: - The separatists - the empire OUT:", "targets": "the empire", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Jackie Chan is starting to become like Chuck Norris, because he is getting close to the age that he retired in his career. Who is \"he\" in this prior sentence? OPTIONS: - Jackie Chan - Chuck Norris", "targets": "Jackie Chan", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The grandmother threw her granddaughter to her death because she would not stop screaming. Based on this sentence, who is she? OPTIONS: - The grandmother - her granddaughter Answer:", "targets": "her granddaughter", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Doctor Conrad Murray is accused of negligence in Michael Jackson's death because he was the doctor on site when the drug overdose took place. Based on this sentence, who is he? OPTIONS: - Doctor Conrad Murray - Michael Jackson Answer:", "targets": "Doctor Conrad Murray", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The youth outran the old man because he was in shape. OPTIONS: - The youth - the old man OUT:", "targets": "The youth", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The band loves their fans because they cannot exist without support. they OPTIONS: - The band - their fans Answer:", "targets": "The band", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The collections agency often goes after delinquent accounts, but they sometimes make mistakes. OPTIONS: - The collections agency - delinquent accounts ANS:", "targets": "The collections agency", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? The mysterious creature is drinking whiskey because it tastes good. OPTIONS: - The mysterious creature - whiskey A:", "targets": "whiskey", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Customer Support fields the questions of their customers so they could receive immediate assistance. they OPTIONS: - Customer Support - their customers Answer:", "targets": "their customers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Student A beat student B, because he studied. OPTIONS: - Student A - student B OUT:", "targets": "Student A", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Morpheous believed Neo was \"the one\", because he had the potential to be \"the one\". Who he is? OPTIONS: - Morpheous - Neo A:", "targets": "Neo", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Gary envied Bill because he was rich. Who is \"he\" in this prior sentence? OPTIONS: - Gary - Bill", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Saudi government beheaded eight Bangladeshis because they wanted to adhere to Islamic laws. Who is they referring to in this sentence? OPTIONS: - The Saudi government - eight Bangladeshis --- Answer:", "targets": "The Saudi government", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: My brother put a Barbie that has metal parts in the microwave, so it does not work anymore. Who it is? OPTIONS: - a Barbie - the microwave A:", "targets": "the microwave", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "John fired Dave because he had too many employees. Who is \"he\" in this prior sentence? OPTIONS: - John - Dave", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Tech Analysts have speculated that Amazon will be releasing a phone next year since they have made a contract with vendors for phone parts. Who they is? OPTIONS: - Tech Analysts - Amazon A:", "targets": "Amazon", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The youth outran the old man because he broke his hip. he OPTIONS: - The youth - the old man Answer:", "targets": "the old man", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The civilians had to flee the encampment from the thugs because they feared for their lives. Who is \"they\" in this prior sentence? OPTIONS: - The civilians - the thugs", "targets": "The civilians", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The chef made breakfast for the captain because he required food. OPTIONS: - The chef - the captain OUT:", "targets": "the captain", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Bill was able to steal the banana from Ken because he was quick. OPTIONS: - Bill - Ken ANS:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? James went to Sully's arcade but he refused to let him in. OPTIONS: - James - Sully ANS:", "targets": "Sully", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Buy More Book Store sends brand new books to customers, but they sometimes end up sending used books instead. OPTIONS: - Buy More Book Store - customers A:", "targets": "Buy More Book Store", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Hybrid cars are much more fuel efficient than gasoline powered cars, but they are still the most used cars today. Who is \"they\"? OPTIONS: - Hybrid cars - gasoline powered cars ANS:", "targets": "gasoline powered cars", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Fry's Electronics is more successful than Comp USA since they price their products much lower. they OPTIONS: - Fry's Electronics - Comp USA Answer:", "targets": "Fry's Electronics", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Deal sites that monitor stores will be active during Thanksgiving weekend, but they do not necessarily guarantee you will get it first. OPTIONS: - Deal sites - stores OUT:", "targets": "Deal sites", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is it in the following sentence? Uncharted 3 did not introduce any new ideas since their last game, Uncharted 2, but it is still going to be a fun game. OPTIONS: - Uncharted 3 - Uncharted 2 ANS:", "targets": "Uncharted 2", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: McDonalds has many more restaurants than Chick Filet worldwide because they are not able to expand their business outside the United States. they OPTIONS: - McDonalds - Chick Filet Answer:", "targets": "Chick Filet", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: A biker sped past an officer and he got away. Based on this sentence, who is he? OPTIONS: - A biker - an officer Answer:", "targets": "A biker", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Horses are faster at short distances than camels, but they can travel much further distances. Based on this sentence, who is they? OPTIONS: - Horses - camels Answer:", "targets": "camels", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Tom likes John because he likes people with cool names. Who is \"he\"? OPTIONS: - Tom - John ANS:", "targets": "Tom", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The starships transported the colonists to their new planet, but they still need to transport several more waves of people. Who they is? OPTIONS: - The starships - the colonists A:", "targets": "The starships", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Thomas pursued Peter, but he escaped. Based on this sentence, who is he? OPTIONS: - Thomas - Peter Answer:", "targets": "Peter", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: When Sue went to Nadia's home for dinner, she caught the wrong bus and arrived late. Who she is? OPTIONS: - Sue - Nadia A:", "targets": "Nadia", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The band loves their fans because they come to every show. OPTIONS: - The band - their fans OUT:", "targets": "their fans", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The robots tried to negotiate a cease-fire with the squirrel-men, but negotiations broke down when they sabotaged the microchip processing facility. OPTIONS: - The robots - the squirrel-men OUT:", "targets": "the squirrel-men", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? I think the referee treats Vick like a running back because he does not understand the game. OPTIONS: - the referee - Vick A:", "targets": "the referee", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The boy laughed at his friend because he heard the joke. OPTIONS: - The boy - his friend OUT:", "targets": "The boy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Hill joined Obama because Bill suggested him. him OPTIONS: - Hill - Obama Answer:", "targets": "Hill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: A person is more productive on an IDE than a text editor, therefore it should not be used in general practice. Who is it referring to in this sentence? OPTIONS: - an IDE - a text editor --- Answer:", "targets": "a text editor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The wolves attacked the travelers in the forest, but they managed to escape unscathed. Who is \"they\" in this prior sentence? OPTIONS: - The wolves - the travelers", "targets": "the travelers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The government tried to free the journalists from North Korea, but they were unsuccessful. OPTIONS: - The government - the journalists A:", "targets": "The government", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The plane shot the rocket at the target, then it hit the target. Who is it referring to in this sentence? OPTIONS: - the rocket - the target --- Answer:", "targets": "the rocket", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Emily asked Anna to stir the pot, but she did not do it. Who she is? OPTIONS: - Emily - Anna A:", "targets": "Anna", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The bird ate the pie and it was ruined. Based on this sentence, who is it? OPTIONS: - The bird - the pie Answer:", "targets": "the pie", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [it] He put snow on the smiley face because it was dry. OPTIONS: - snow - the smiley face OUT:", "targets": "the smiley face", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Sally was really happy that Beth finally got a job because she had been unemployed for years. Who is she referring to in this sentence? OPTIONS: - Sally - Beth --- Answer:", "targets": "Beth", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The farmer proudly revealed his favorite chicken, because he won the prize money. he OPTIONS: - The farmer - his favorite chicken Answer:", "targets": "The farmer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Bill returned Jim twenty dollars because he borrowed money. he OPTIONS: - Bill - Jim Answer:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The Philadelphia Eagles lost to the St. Louis Rams, but it was because they were tired from traveling to the game. Who is \"they\"? OPTIONS: - Philadelphia Eagles - St. Louis Rams ANS:", "targets": "Philadelphia Eagles", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Darth Vader said to Luke Skywalker, \"I am your father\", because he was his son. Who is he referring to in this sentence? OPTIONS: - Darth Vader - Luke Skywalker --- Answer:", "targets": "Luke Skywalker", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: New York is very crowded compared to South Dakota, but they have much more land instead. they OPTIONS: - New York - South Dakota Answer:", "targets": "South Dakota", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The professor grading the student's paper said that he was stupid. Who is \"he\" in this prior sentence? OPTIONS: - The professor - the student", "targets": "the student", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Sir Rodrick was made specialized fitted armor by Jack, because he needed armor that could withstand the power of a lance. OPTIONS: - Sir Rodrick - Jack OUT:", "targets": "Sir Rodrick", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The spider ate the fly because he was hungry. Who is \"he\" in this prior sentence? OPTIONS: - The spider - the fly", "targets": "The spider", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The man asked Mark the question again because he was curious. Based on this sentence, who is he? OPTIONS: - The man - Mark Answer:", "targets": "The man", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Sam helped Davey fortify their bunker because he thought the Mexicans were invading. OPTIONS: - Sam - Davey OUT:", "targets": "Davey", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Treasure hunters have to constantly fear running into bandits because they could be risking their lives if they encounter them. Based on this sentence, who is they? OPTIONS: - Treasure hunters - bandits Answer:", "targets": "Treasure hunters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Will Smith got his son in a movie since he is the son of a famous movie actor. Who is \"he\"? OPTIONS: - Will Smith - his son ANS:", "targets": "his son", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Blackberry alienated a lot of users because they were angered by the service being taken down for days. OPTIONS: - Blackberry - a lot of users OUT:", "targets": "a lot of users", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Planet Express was bought out by Mom's Friendly Delivery Service so they can eliminate the competition. Based on this sentence, who is they? OPTIONS: - Planet Express - Mom's Friendly Delivery Service Answer:", "targets": "Mom's Friendly Delivery Service", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The heavy weapons team bombarded the settlement with their mortars even though they were unarmed. Who is they referring to in this sentence? OPTIONS: - The heavy weapons team - the settlement --- Answer:", "targets": "the settlement", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [she] The bus driver yelled at a kid after she drove her vehicle. OPTIONS: - The bus driver - a kid OUT:", "targets": "The bus driver", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? King Leonidas was more respected then King Henry because he unfairly taxed the people. OPTIONS: - King Leonidas - King Henry OUT:", "targets": "King Henry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Bob killed Vincent because he wanted to kill someone. Who is \"he\"? OPTIONS: - Bob - Vincent ANS:", "targets": "Bob", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The company accepted the resolution because it was well-written. it OPTIONS: - The company - the resolution Answer:", "targets": "the resolution", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Mary lied to Sue and she slapped her. Who is \"she\"? OPTIONS: - Mary - Sue ANS:", "targets": "Sue", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Gartok defeated Grognak because he was the stronger man. OPTIONS: - Gartok - Grognak ANS:", "targets": "Gartok", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Robert fired Chris because he couldn't do the job. he OPTIONS: - Robert - Chris Answer:", "targets": "Chris", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Jean is making fun of Kyle because he lost. OPTIONS: - Jean - Kyle OUT:", "targets": "Kyle", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Anna tucked Olivia into bed because she was caring. Who she is? OPTIONS: - Anna - Olivia A:", "targets": "Anna", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: MIT accepted the students, because they decided that they were the best. Who is \"they\"? OPTIONS: - MIT - the students ANS:", "targets": "MIT", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Chuck Norris can beat any man in a fight, unless he is invincible. OPTIONS: - Chuck Norris - any man OUT:", "targets": "any man", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Snooki got angry at Kendra since she would not emotionally support her in her time of need. she OPTIONS: - Snooki - Kendra Answer:", "targets": "Kendra", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The police officer shot the protester because he tried to attack the governor. Who is he referring to in this sentence? OPTIONS: - The police officer - the protester --- Answer:", "targets": "the protester", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Naruto has about 200 more episodes then Code Geass because they finished the story in much fewer episodes. they OPTIONS: - Naruto - Code Geass Answer:", "targets": "Code Geass", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Verizon Fios provides hundreds of channels to millions of viewers, because they want them to have a plethora of options to choose from. they OPTIONS: - Verizon Fios - millions of viewers Answer:", "targets": "Verizon Fios", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "John picked Bill because he was in need of talent. Who is \"he\" in this prior sentence? OPTIONS: - John - Bill", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "John chose Bill because he was choosing. Who is \"he\" in this prior sentence? OPTIONS: - John - Bill", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? The boulder dropped into the river, but it continued to roll. OPTIONS: - The boulder - the river OUT:", "targets": "The boulder", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The Union defeated the Confederates in the Civil war since they had better resources and numbers. OPTIONS: - The Union - the Confederates OUT:", "targets": "The Union", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The carpenters came before the painters since they need to paint after the furniture has already been built. Who they is? OPTIONS: - The carpenters - the painters A:", "targets": "the painters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The assembly line workers were told they had been fired by the company, because they had moved the jobs overseas. Who they is? OPTIONS: - The assembly line workers - the company A:", "targets": "The assembly line workers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The Drill Sergeants trained the troops aggressively because they need to be trained well to survive in war. Who is \"they\" in this prior sentence? OPTIONS: - The Drill Sergeants - the troops", "targets": "the troops", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The orchestra was booed by the audience because they had expected a rock band. Who they is? OPTIONS: - The orchestra - the audience A:", "targets": "the audience", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is it in the following sentence? A mathematical equation is more influential than politics, because it will stand forever. OPTIONS: - A mathematical equation - politics ANS:", "targets": "A mathematical equation", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? A policeman saw John Edwards commit the crime, so he was arrested. OPTIONS: - A policeman - John Edwards OUT:", "targets": "John Edwards", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The squirrels buried the nuts so they would not lose them. Based on this sentence, who is they? OPTIONS: - The squirrels - the nuts Answer:", "targets": "The squirrels", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Heath Ledger was considered the greatest Joker of all time by Ebert, but he cannot make that decision for all critics. he OPTIONS: - Heath Ledger - Ebert Answer:", "targets": "Ebert", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The heavy weapons team bombarded the settlement with their mortars since they needed to soften up the enemy before moving in. Who is they referring to in this sentence? OPTIONS: - The heavy weapons team - the settlement --- Answer:", "targets": "The heavy weapons team", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The employees crushed the boxes because they were empty. Who is \"they\"? OPTIONS: - The employees - the boxes ANS:", "targets": "the boxes", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The boy gave his friend a cookie because he was hungry. OPTIONS: - The boy - his friend OUT:", "targets": "his friend", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The coach criticized the player because he explicitly told everyone not to break the team's formation. Who he is? OPTIONS: - The coach - the player A:", "targets": "The coach", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John bored Bill because he was boring. Who is he referring to in this sentence? OPTIONS: - John - Bill --- Answer:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The judges monitor the performance of the competitors to measure their abilities, but they do not decide if they move on to the next round. they OPTIONS: - The judges - the competitors Answer:", "targets": "The judges", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Olivia tried to counsel Emily, but she was not interested. Based on this sentence, who is she? OPTIONS: - Olivia - Emily Answer:", "targets": "Emily", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Tom asked his son to drive so that he could sleep. Who is \"he\"? OPTIONS: - Tom - his son ANS:", "targets": "Tom", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The other student corrected Robert because he better understood the problem. Who is \"he\"? OPTIONS: - The other student - Robert ANS:", "targets": "The other student", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Peter managed to win the lottery and loaned money to Rick, but he will pay him back. Who is \"he\" in this prior sentence? OPTIONS: - Peter - Rick", "targets": "Rick", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The ball hit the window and Bill caught it. Based on this sentence, who is it? OPTIONS: - The ball - the window Answer:", "targets": "The ball", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: John gave a large sum of money to Bill because he needed a loan. Who is \"he\"? OPTIONS: - John - Bill ANS:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The US president had a meeting with the Chinese president, where he told him not to interfere with China's internal policy. OPTIONS: - The US president - the Chinese president OUT:", "targets": "the Chinese president", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The kids asked their neighbors if they could have candy on Halloween. Who is they referring to in this sentence? OPTIONS: - The kids - their neighbors --- Answer:", "targets": "The kids", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Pirates are always compared to ninjas, but they are more specific to Japanese culture. OPTIONS: - Pirates - ninjas OUT:", "targets": "ninjas", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The judges monitor the performances of the competitors to measure their abilities, so they need to be able to impress them with their skills. OPTIONS: - The judges - the competitors OUT:", "targets": "the competitors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Kenny attacked Ben, and then he attacked back. OPTIONS: - Kenny - Ben OUT:", "targets": "Ben", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: James asked Robert for a favor, but he refused. Who he is? OPTIONS: - James - Robert A:", "targets": "Robert", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Saturday Night Live often has politicians as one of their main centers of attention since they are what viewers want to see joked about. OPTIONS: - Saturday Night Live - politicians ANS:", "targets": "politicians", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Mavericks are able to sell much merchandise to fans this season, and they just want it since they are the hottest team at the moment. Based on this sentence, who is they? OPTIONS: - The Mavericks - fans Answer:", "targets": "fans", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The older male cat is bullying the new younger male cat so he has been submissive. Who is he referring to in this sentence? OPTIONS: - The older male cat - the new younger male cat --- Answer:", "targets": "the new younger male cat", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The police called headquarters for help and they refused. Who is \"they\"? OPTIONS: - The police - headquarters ANS:", "targets": "headquarters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The NSA sent their agents in the field to retrieve intelligence, but they were not able to gather the intelligence for them. OPTIONS: - The NSA - their agents OUT:", "targets": "their agents", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is him in the following sentence? James cheated off Henry's test, and the Teacher told him. OPTIONS: - James - Henry ANS:", "targets": "Henry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? The cabbage was in the freezer and it became full. OPTIONS: - The cabbage - the freezer OUT:", "targets": "the freezer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The pilots saved the passengers because they had a civic duty. OPTIONS: - The pilots - the passengers OUT:", "targets": "The pilots", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The students read the books because they were interesting. OPTIONS: - The students - the books OUT:", "targets": "the books", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The boy lent his friend a pencil because the teacher told him to write. him OPTIONS: - The boy - his friend Answer:", "targets": "his friend", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Rocky won the match with Richard because he had no energy. he OPTIONS: - Rocky - Richard Answer:", "targets": "Richard", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [she] Dance Instructor Kate offers advice to Shelly because she is eager to soak up as much experience as possible. OPTIONS: - Dance Instructor Kate - Shelly OUT:", "targets": "Shelly", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "David hit Bill because Mary asked him to. Who is \"him\" in this prior sentence? OPTIONS: - David - Bill", "targets": "David", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Naruto has about 200 more episodes than Code Geass because they have a long interesting storyline. OPTIONS: - Naruto - Code Geass A:", "targets": "Naruto", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Our professor told the TA that he needed his help. OPTIONS: - Our professor - the TA OUT:", "targets": "Our professor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The Stars did not have many viewers watching the game last Friday because they were playing at the same time as the World Series. OPTIONS: - The Stars - many viewers OUT:", "targets": "The Stars", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Dogs are friendlier than cats since they would rather be alone. OPTIONS: - Dogs - cats A:", "targets": "cats", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [she] Mary lied to Sue and she asked for forgiveness. OPTIONS: - Mary - Sue OUT:", "targets": "Mary", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] John ridiculed Bill because he was a big help. OPTIONS: - John - Bill OUT:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Stark Industries produces the best technology for the military, but they pay top dollar to equip their forces with this. Who is \"they\"? OPTIONS: - Stark Industries - the military ANS:", "targets": "the military", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Steve Urkel was always annoying Carl Winslow in the show, \"Family Matters\", because he is quite annoying by nature. Who he is? OPTIONS: - Steve Urkel - Carl Winslow A:", "targets": "Steve Urkel", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Rammstein performed their latest hit single to the masses of Germany because they wanted to hear their newest masterpieces. Based on this sentence, who is they? OPTIONS: - Rammstein - the masses of Germany Answer:", "targets": "the masses of Germany", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Scribes were often hired by nobles in the Medieval period since they had the ability to read and write. OPTIONS: - Scribes - nobles OUT:", "targets": "Scribes", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Kevin stared at Michael and he got angry. OPTIONS: - Kevin - Michael OUT:", "targets": "Michael", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Our professor told the TA that he could have the day off. OPTIONS: - Our professor - the TA OUT:", "targets": "the TA", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Clark Kent hides his identity from Lex Luthor since he wishes to keep his loved ones safe. Who is he referring to in this sentence? OPTIONS: - Clark Kent - Lex Luthor --- Answer:", "targets": "Clark Kent", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Raccoons constantly play dead when people come near since they hope they will be ignored. OPTIONS: - Raccoons - people OUT:", "targets": "Raccoons", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The older male cat is bullying the new younger male cat so that he can assert his dominance. OPTIONS: - The older male cat - the new younger male cat OUT:", "targets": "The older male cat", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Aaron kissed Dan because he wanted to. he OPTIONS: - Aaron - Dan Answer:", "targets": "Aaron", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Raccoons constantly play dead when people come near because they frighten them. OPTIONS: - Raccoons - people A:", "targets": "people", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The home team lost to the Giants because they were unable to pass. OPTIONS: - The home team - the Giants ANS:", "targets": "The home team", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Jessica did not like Selma cutting her hair short, but she ended up loving her new style. Who she is? OPTIONS: - Jessica - Selma A:", "targets": "Jessica", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? Cheesecake is better than fruitcake because it tastes better. OPTIONS: - Cheesecake - fruitcake A:", "targets": "Cheesecake", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Lucy gave a tutorial on how to install IOS 5 to Cindy because she is not very technologically savvy. Who is she referring to in this sentence? OPTIONS: - Lucy - Cindy --- Answer:", "targets": "Cindy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The peace emissaries arrived to negotiate a peace treaty for the warring population, since they wish to assist in ending the war. OPTIONS: - The peace emissaries - the warring population OUT:", "targets": "The peace emissaries", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The mouse ran from the cat all the way to the kitchen because it chased him. Based on this sentence, who is it? OPTIONS: - The mouse - the cat Answer:", "targets": "the cat", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Jimbo eats more than Bobbert because he is not on a diet. OPTIONS: - Jimbo - Bobbert A:", "targets": "Jimbo", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The pilots saved the passengers because they begged them to. Who they is? OPTIONS: - The pilots - the passengers A:", "targets": "the passengers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? The cap fell off the bottle because it was untwisted. OPTIONS: - The cap - the bottle OUT:", "targets": "The cap", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The Swiss bank freezed the accounts of a crime syndicate because they had fraudulent money deposited in their account. OPTIONS: - The Swiss bank - a crime syndicate OUT:", "targets": "a crime syndicate", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Rick Davis campaigned for John McCain since he could best support him in office. Who is \"he\"? OPTIONS: - Rick Davis - John McCain ANS:", "targets": "Rick Davis", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? The teacher told the student that he needed to practice. OPTIONS: - The teacher - the student A:", "targets": "the student", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: People like dogs but they do not like cats. Based on this sentence, who is they? OPTIONS: - People - dogs Answer:", "targets": "People", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Sarah tried to ignore the elephant in the room, but she would not stop trumpeting. OPTIONS: - Sarah - the elephant in the room A:", "targets": "the elephant in the room", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The plane shot the rocket at the target, then it blew up. it OPTIONS: - the rocket - the target Answer:", "targets": "the target", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The other student corrected Robert because he had misunderstood the problem. Based on this sentence, who is he? OPTIONS: - The other student - Robert Answer:", "targets": "Robert", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John disliked Bill and he did not pick him. Who is he referring to in this sentence? OPTIONS: - John - Bill --- Answer:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Police sweep bums off the benches of the park since they need to enforce the law of no sleeping in the park overnight. Who they is? OPTIONS: - Police - bums A:", "targets": "Police", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The glass told the toaster that it was fat. Who it is? OPTIONS: - The glass - the toaster A:", "targets": "the toaster", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is she? Angelina Jolie played the role of the mother of Grendell, but she is a fictional character which would have to be created using CGI. OPTIONS: - Angelina Jolie - the mother of Grendell OUT:", "targets": "the mother of Grendell", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Tim gave Marlo a pat on the back because he wanted to help. Based on this sentence, who is he? OPTIONS: - Tim - Marlo Answer:", "targets": "Tim", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The jocks did not like the nerds because they were losers. Who is they referring to in this sentence? OPTIONS: - The jocks - the nerds --- Answer:", "targets": "the nerds", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Caesar the ape found out the door code by watching Morris, because he was careless when typing in the code. Who is \"he\"? OPTIONS: - Caesar the ape - Morris ANS:", "targets": "Morris", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The police tried to blockade the bridge to prevent the criminals from escaping, but they needed additional backup to be successful. OPTIONS: - The police - the criminals A:", "targets": "The police", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Gladiators are viewed better than Slaves because they live in a life of servitude instead of dying in glory. Who is \"they\" in this prior sentence? OPTIONS: - Gladiators - Slaves", "targets": "Slaves", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is she? Stephanie gave Brandy flowers because she was sick. OPTIONS: - Stephanie - Brandy OUT:", "targets": "Brandy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The couple took the car to the shop on Tuesday, but they will not charge until next week. Who is they referring to in this sentence? OPTIONS: - The couple - the shop --- Answer:", "targets": "the shop", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Hunters excel in tracking animals because they can see the trail they leave in the forest. OPTIONS: - Hunters - animals OUT:", "targets": "Hunters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Kurt sang to Jon since he wanted to be the lead singer. OPTIONS: - Kurt - Jon OUT:", "targets": "Kurt", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is she in the following sentence? Kim Kardashian has already followed in the steps of Demi Moore and getting divorced, but she would not want people to experience her same sadness. OPTIONS: - Kim Kardashian - Demi Moore ANS:", "targets": "Demi Moore", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? John ridiculed Bill because he acted like a fool. OPTIONS: - John - Bill A:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Boyfriends always try to go out of their way to treat their girlfriends with respect because they are more inclined to stay with them when they are respected. Who is \"they\" in this prior sentence? OPTIONS: - Boyfriends - their girlfriends", "targets": "their girlfriends", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Rosie beat Mary in Scrabble because she was bad at word games. Who is she referring to in this sentence? OPTIONS: - Rosie - Mary --- Answer:", "targets": "Mary", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The doctor told Susan that she had been busy. Who is she referring to in this sentence? OPTIONS: - The doctor - Susan --- Answer:", "targets": "The doctor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? A biker sped past an officer and he turned on his siren. OPTIONS: - A biker - an officer OUT:", "targets": "an officer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The salesman sold a hot tub to the customer because he was looking for something to use and soak in. OPTIONS: - The salesman - the customer OUT:", "targets": "the customer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The grandmother threw her granddaughter to her death because she felt jealous. Who is \"she\" in this prior sentence? OPTIONS: - The grandmother - her granddaughter", "targets": "The grandmother", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Peter Griffin often pokes fun at Chris, because he enjoys doing it. he OPTIONS: - Peter Griffin - Chris Answer:", "targets": "Peter Griffin", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Katie accused Jane but she felt badly about it. she OPTIONS: - Katie - Jane Answer:", "targets": "Katie", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "There is more NLP work on English than on Bengali because it has rich linguistic resources. Who is \"it\" in this prior sentence? OPTIONS: - English - Bengali", "targets": "English", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Microsoft discontinued plans for the Courier tablet due to the success of the tablets from Apple, so they have eliminated another competitor in the tablet market. Based on this sentence, who is they? OPTIONS: - Microsoft - Apple Answer:", "targets": "Apple", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The citizens rebelled against the government because they were being repressed. OPTIONS: - The citizens - the government OUT:", "targets": "The citizens", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Herman Cain has been rising in the polls, causing concern for Rick Perry, but he does not believe this rise in popularity will sustain. Based on this sentence, who is he? OPTIONS: - Herman Cain - Rick Perry Answer:", "targets": "Rick Perry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Coins are better than dollars because they weigh more. Who is they referring to in this sentence? OPTIONS: - Coins - dollars --- Answer:", "targets": "Coins", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Jim taught John rhetoric to become a lawyer, but he did not pay him. Who is \"he\"? OPTIONS: - Jim - John ANS:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The company declared bonus for the employees because they worked hard. OPTIONS: - The company - the employees ANS:", "targets": "the employees", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Nancy adopted a baby girl because she was picked to be adopted. she OPTIONS: - Nancy - a baby girl Answer:", "targets": "a baby girl", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John kicked Bill because he was being mean. Who is he referring to in this sentence? OPTIONS: - John - Bill --- Answer:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Entertainmart has to win over the consumers with their low prices, or they will most likely go out of business. Who is they referring to in this sentence? OPTIONS: - Entertainmart - the consumers --- Answer:", "targets": "Entertainmart", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The ball broke the window because it was fragile. it OPTIONS: - The ball - the window Answer:", "targets": "the window", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Jean is making fun of Kyle because he won. OPTIONS: - Jean - Kyle OUT:", "targets": "Jean", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The mother encouraged her daughter to sing a difficult song so she would be challenged. Who is \"she\" in this prior sentence? OPTIONS: - The mother - her daughter", "targets": "her daughter", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? UPS provides much convenience to the customers with their drop off service so they are encouraged to bring their packages in more often. OPTIONS: - UPS - the customers ANS:", "targets": "the customers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Blizzard Entertainment does not sell their games on Steam because they prefer to keep their own profits. OPTIONS: - Blizzard Entertainment - Steam OUT:", "targets": "Blizzard Entertainment", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: John shot Jack, the elephant, in my pajamas, but how he got there is still a mystery. Who he is? OPTIONS: - John - Jack A:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The jurors deliberated on the defendants' fate for hours, but they did not reach a verdict. Who is they referring to in this sentence? OPTIONS: - The jurors - the defendants --- Answer:", "targets": "The jurors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Hulu has had tremendous growth of subscribers over traditional cable provider Dish Network since they are charging too much for their plan. OPTIONS: - Hulu - Dish Network ANS:", "targets": "Dish Network", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? John picked Bill because he was talented. OPTIONS: - John - Bill OUT:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Seagate recently announced to their investors that production will not go back to normal until the end of 2012 because they had their factories flooded last month. Who is they referring to in this sentence? OPTIONS: - Seagate - their investors --- Answer:", "targets": "Seagate", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Malachi's program would not run on the computer because it was full of bugs. Who is it referring to in this sentence? OPTIONS: - Malachi's program - the computer --- Answer:", "targets": "Malachi's program", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Microsoft Azure provides cloud servers for consumers, but they are still hesitant to switch to cloud computing. OPTIONS: - Microsoft Azure - consumers OUT:", "targets": "consumers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Seth is smarter than Sai, and consequently he got a better job. OPTIONS: - Seth - Sai ANS:", "targets": "Seth", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The government wanted to issue weapons to the US border patrol, since they need them to patrol effectively. Who is \"they\"? OPTIONS: - The government - the US border patrol ANS:", "targets": "the US border patrol", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: James went to Sully's arcade and he asked for tickets. Who he is? OPTIONS: - James - Sully A:", "targets": "James", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The new knives are better than the old knives since they are much sharper. they OPTIONS: - new knives - old knives Answer:", "targets": "new knives", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jill was writing on a pad for Jane because she wanted to leave her address. Based on this sentence, who is she? OPTIONS: - Jill - Jane Answer:", "targets": "Jill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The golfers waved on the players because they were waiting. OPTIONS: - The golfers - the players OUT:", "targets": "the players", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Officer Kennedy saved Roger from the criminals because he upholds the peace. Who he is? OPTIONS: - Officer Kennedy - Roger A:", "targets": "Officer Kennedy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The junior football team likes the Dallas Cowboys because they get to watch quality football. Who is they referring to in this sentence? OPTIONS: - The junior football team - the Dallas Cowboys --- Answer:", "targets": "The junior football team", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Video games are outselling movies because they are fun to play. OPTIONS: - Video games - movies ANS:", "targets": "Video games", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The knife cut through the fence because it was sharp. it OPTIONS: - The knife - the fence Answer:", "targets": "The knife", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The wine busted the cask because it was too carbonated. Who is \"it\" in this prior sentence? OPTIONS: - The wine - the cask", "targets": "The wine", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: AMD's Bulldozer chips have received lukewarm reception compared to Intel's Sandy Bridge chips since they were subpar in performance. Who they is? OPTIONS: - AMD's Bulldozer chips - Intel's Sandy Bridge chips A:", "targets": "AMD's Bulldozer chips", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The veterans defeated the newcomers because they were more experienced. OPTIONS: - The veterans - the newcomers OUT:", "targets": "The veterans", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Gartok defeated Grognak because he was puny and weak. Who is \"he\" in this prior sentence? OPTIONS: - Gartok - Grognak", "targets": "Grognak", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Google bought Motorola because they were bankrupt. Who is \"they\"? OPTIONS: - Google - Motorola ANS:", "targets": "Motorola", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: James always gives orders to Owen because he is very obedient. Who is \"he\"? OPTIONS: - James - Owen ANS:", "targets": "Owen", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The construction company could not rezone the area due to endangered butterflies because they are in danger of being wiped out if their environment is ruined. Who is they referring to in this sentence? OPTIONS: - The construction company - endangered butterflies --- Answer:", "targets": "endangered butterflies", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Bob Marley shot the sheriff, but he survived. he OPTIONS: - Bob Marley - the sheriff Answer:", "targets": "the sheriff", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The police officer chased the thief because he was stealing from the bank. he OPTIONS: - The police officer - the thief Answer:", "targets": "the thief", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? A motorboat turns the propeller pushing the water backwards, thus it moves forward. OPTIONS: - A motorboat - the propeller A:", "targets": "A motorboat", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Merchant Smith purchased the trophy from Knight Louis because he desperately needed the money. OPTIONS: - Merchant Smith - Knight Louis A:", "targets": "Knight Louis", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? John tricked Bill because he was slow-witted. OPTIONS: - John - Bill ANS:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The students protested against the new policies because they were angry. OPTIONS: - The students - the new policies OUT:", "targets": "The students", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The bartenders threw ice at the Jersey Shore cast because they did not not like them in their club. OPTIONS: - The bartenders - the Jersey Shore cast ANS:", "targets": "The bartenders", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Tim bought Eric a gecko, but he did not like it. OPTIONS: - Tim - Eric ANS:", "targets": "Eric", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Bob cooked omelets for Jack, because he knew how. he OPTIONS: - Bob - Jack Answer:", "targets": "Bob", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Alex Rodriguez is paid much higher than Brandon Hughs because he is a less sought after player. Who he is? OPTIONS: - Alex Rodriguez - Brandon Hughs A:", "targets": "Brandon Hughs", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The United States sanctioned Iran since they recently discovered their assassination plot on an ambassador in the States. Based on this sentence, who is they? OPTIONS: - The United States - Iran Answer:", "targets": "The United States", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Pizza hut pizzas are tastier than Papa John pizzas because they give less ingredients and cheeses. Who is they referring to in this sentence? OPTIONS: - Pizza - Papa John --- Answer:", "targets": "Papa John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The boy scouts were able to raise more money for charity over the girl scouts since they were not able to raise funds as actively. Who is \"they\"? OPTIONS: - The boy scouts - the girl scouts ANS:", "targets": "the girl scouts", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? DVD Players are slowly being replaced by Blu Ray Systems since they are becoming the new medium of entertainment. OPTIONS: - DVD Players - Blu Ray Systems A:", "targets": "Blu Ray Systems", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The army crossed the river because it was shallow. Who is \"it\"? OPTIONS: - The army - the river ANS:", "targets": "the river", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Michael asked Jacob to dance because he felt sorry for him. OPTIONS: - Michael - Jacob OUT:", "targets": "Michael", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Sally kicked Mary and she was hurt. Who is \"she\"? OPTIONS: - Sally - Mary ANS:", "targets": "Mary", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is his in the following sentence? Jack raced past Dan since his car is old. OPTIONS: - Jack - Dan ANS:", "targets": "Dan", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The product fair showed Office 365, and it had a lot of attendees. Who is \"it\" in this prior sentence? OPTIONS: - The product fair - Office 365", "targets": "The product fair", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Sega lost to Nintendo because they were superior. Who is \"they\"? OPTIONS: - Sega - Nintendo ANS:", "targets": "Nintendo", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Hitler conquered Alex in the war because nobody supported him. Who is \"him\" in this prior sentence? OPTIONS: - Hitler - Alex", "targets": "Alex", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Master Sifu passes wisdom on to Jack so he listens very intently to what he has to say. OPTIONS: - Master Sifu - Jack OUT:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Chase will have a cyber monday sale for credit users, but they may not necessarily care about the sale. Who is they referring to in this sentence? OPTIONS: - Chase - credit users --- Answer:", "targets": "credit users", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The cat broke the glass because it was clumsy. Based on this sentence, who is it? OPTIONS: - The cat - the glass Answer:", "targets": "The cat", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Tiger Woods dropped Randy as his caddy because he was not satisfied with his work. Who he is? OPTIONS: - Tiger Woods - Randy A:", "targets": "Tiger Woods", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: LA Galaxy is constantly seeking famous players to fill their ranks, but they are constantly sought after by many teams with offers. Who they is? OPTIONS: - LA Galaxy - famous players A:", "targets": "famous players", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The squirrels buried the nuts so they would not get lost. Who they is? OPTIONS: - The squirrels - the nuts A:", "targets": "the nuts", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Frosted Flakes is tastier than Fiber One because they taste bland due to the fiber. Based on this sentence, who is they? OPTIONS: - Frosted Flakes - Fiber One Answer:", "targets": "Fiber One", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Bob killed Vincent because he was stealing drugs. OPTIONS: - Bob - Vincent OUT:", "targets": "Vincent", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Four wheel drive cars are used for rally racing instead of rear wheel cars because they do not race well off road. Who is \"they\"? OPTIONS: - Four wheel drive cars - rear wheel cars ANS:", "targets": "rear wheel cars", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The government wanted to issue weapons to the US border patrol, so they asked the Congress to approve the budget on weapons. OPTIONS: - The government - the US border patrol ANS:", "targets": "The government", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Jimbo ate the fish that Bobbert prepared because he was hungry. OPTIONS: - Jimbo - Bobbert OUT:", "targets": "Jimbo", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Amazon's Kindle Fire may surpass Apple's IPad because they offer a very competitive low price. Based on this sentence, who is they? OPTIONS: - Amazon - Apple Answer:", "targets": "Amazon", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is it in the following sentence? The Emancipation Proclamation made slavery illegal, but it was still practiced. OPTIONS: - The Emancipation Proclamation - slavery ANS:", "targets": "slavery", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Four wheel drive cars are used for rally racing instead of rear wheel cars because they are better for off-road racing. OPTIONS: - Four wheel drive cars - rear wheel cars A:", "targets": "Four wheel drive cars", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [she] Emily asked Anna to stir the pot, because she forgot to do it. OPTIONS: - Emily - Anna OUT:", "targets": "Emily", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Ashton Kutcher replaced Charlie Sheen as the main character of Two and a Half Men, but he does not play the same character the previous actor played. OPTIONS: - Ashton Kutcher - Charlie Sheen A:", "targets": "Ashton Kutcher", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Joe earned more money than Rob on the Price is Right because he kept guessing wrong. OPTIONS: - Joe - Rob OUT:", "targets": "Rob", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Jim taught John rhetoric to become a lawyer, but he did not get paid. OPTIONS: - Jim - John ANS:", "targets": "Jim", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Joe slapped Jose in the face because he was angry. Who is \"he\" in this prior sentence? OPTIONS: - Joe - Jose", "targets": "Joe", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Bob cooked omelets for Jack, because he was hungry. Who is \"he\" in this prior sentence? OPTIONS: - Bob - Jack", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Americans preferred Obama to McCain because he was too old. Who is \"he\" in this prior sentence? OPTIONS: - Obama - McCain", "targets": "McCain", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The boy scouts were able to raise more money for charity over the girl scouts since they had a very active fund raising schedule. they OPTIONS: - The boy scouts - the girl scouts Answer:", "targets": "The boy scouts", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The sailors fell off the boats because they were capsizing. Based on this sentence, who is they? OPTIONS: - The sailors - the boats Answer:", "targets": "the boats", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [it] The painting was at the museum because it was on display. OPTIONS: - The painting - the museum OUT:", "targets": "The painting", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Herald Simmons has tremendous skill in rousing up the audience for Knight Keller, so he recruited him solely to get the audience riled up for him. Who is he referring to in this sentence? OPTIONS: - Herald Simmons - Knight Keller --- Answer:", "targets": "Knight Keller", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The computer could not run the program because it did not have enough memory. Who is \"it\" in this prior sentence? OPTIONS: - The computer - the program", "targets": "The computer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Republicans preferred Romney to Perry because he said his supporters were heartless. Who he is? OPTIONS: - Romney - Perry A:", "targets": "Perry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Bioware recently announced a stress test to beta users this weekend so they are eagerly awaiting to play the much anticipated game. Who they is? OPTIONS: - Bioware - beta users A:", "targets": "beta users", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: England won the bid over Spain because they prepared better. Who is \"they\"? OPTIONS: - England - Spain ANS:", "targets": "England", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Software gives more profit over hardware since they have little cost associated with selling more. Based on this sentence, who is they? OPTIONS: - Software - hardware Answer:", "targets": "Software", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: John flicked Bill because he saw a fly on his shirt. Who is \"he\"? OPTIONS: - John - Bill ANS:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [it] The bird perched on the limb and it sang. OPTIONS: - The bird - the limb OUT:", "targets": "The bird", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Subways has always been considered a healthy choice by athletes since they offer such healthy ingredients in their sandwiches. OPTIONS: - Subways - athletes ANS:", "targets": "Subways", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [it] The rock melted in the lava because it was hot. OPTIONS: - The rock - the lava OUT:", "targets": "the lava", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Steven assassinated the president because he was a too liberal. OPTIONS: - Steven - the president A:", "targets": "the president", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Tim bought Eric a gecko, because he liked him. Who is he referring to in this sentence? OPTIONS: - Tim - Eric --- Answer:", "targets": "Tim", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The judge was fond of the contestant so he voted favorably. Who he is? OPTIONS: - The judge - the contestant A:", "targets": "The judge", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Tom gave James a coat because he was generous. OPTIONS: - Tom - James A:", "targets": "Tom", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The jocks did not like the nerds because they were bullies. they OPTIONS: - The jocks - the nerds Answer:", "targets": "The jocks", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Apple indicated that the Siri program would not be available for previous IPhones, but they were proven wrong when hackers were successful. Who is \"they\"? OPTIONS: - Apple - previous IPhones ANS:", "targets": "Apple", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Conservatives differ from Democrats since they normally resist change. they OPTIONS: - Conservatives - Democrats Answer:", "targets": "Conservatives", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Paula liked Ness more than Pokey because he was mean to her. Who is \"he\" in this prior sentence? OPTIONS: - Ness - Pokey", "targets": "Pokey", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Cathy let Joanna into her car, so she could sell the car. Who she is? OPTIONS: - Cathy - Joanna A:", "targets": "Cathy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Dogs are friendlier than cats since they enjoy the company of people. OPTIONS: - Dogs - cats ANS:", "targets": "Dogs", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? HP sold a new LED monitor for a heavily discounted price to consumers, so they ended up buying mass amounts of monitors. OPTIONS: - HP - consumers ANS:", "targets": "consumers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? John thanked Bill because he had needed help. OPTIONS: - John - Bill OUT:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The government officials publicly apologized to the people because they were forced to. OPTIONS: - The government officials - the people A:", "targets": "The government officials", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The Minecraft developers managed to win their case regarding copyright infringement against Bethesda Studios since they did not violate any laws. OPTIONS: - The Minecraft developers - Bethesda Studios OUT:", "targets": "The Minecraft developers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The DEA raided the Mexican Cartel's warehouse because they suspected a drug business was occurring. they OPTIONS: - DEA - Mexican Cartel Answer:", "targets": "DEA", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The professor told John that he passed the exam. Who is he referring to in this sentence? OPTIONS: - The professor - John --- Answer:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The townspeople ate the unicorns because they were delicious. Who they is? OPTIONS: - The townspeople - the unicorns A:", "targets": "the unicorns", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Janice bought Kenda a car because she needed one. OPTIONS: - Janice - Kenda A:", "targets": "Kenda", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Parents send their children to bed, and they have to listen to authority since they are dependents. OPTIONS: - Parents - their children OUT:", "targets": "their children", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Zidane headbutted Zambrotta because he was being insulting. Based on this sentence, who is he? OPTIONS: - Zidane - Zambrotta Answer:", "targets": "Zambrotta", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John thanked Bill because he was helpful. Who is he referring to in this sentence? OPTIONS: - John - Bill --- Answer:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The band connected well to their fans, so they continued to buy albums. Who is \"they\"? OPTIONS: - The band - their fans ANS:", "targets": "their fans", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Males always outnumber females at Comic Con since they generally take less interest in things that are considered nerdy. OPTIONS: - Males - females OUT:", "targets": "females", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Beowulf was granted a magical artifact by King Henry that emitted a light since he wanted him to be able to find effectively in the dark. Who he is? OPTIONS: - Beowulf - King Henry A:", "targets": "King Henry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Blue Thunder scored more goals than Green Hogs since they are the better team. OPTIONS: - Blue Thunder - Green Hogs OUT:", "targets": "Blue Thunder", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Conservatives differ from Democrats since they normally promote change. OPTIONS: - Conservatives - Democrats OUT:", "targets": "Democrats", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Jim was staring at the guy with the snowboard, because he was doing tricks. OPTIONS: - Jim - the guy OUT:", "targets": "the guy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Tobias is upset with William because he would not pay. OPTIONS: - Tobias - William OUT:", "targets": "Tobias", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Allen laughed at Jimmy because he told a funny joke. OPTIONS: - Allen - Jimmy OUT:", "targets": "Jimmy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The ball broke the window because it was hard. Who is it referring to in this sentence? OPTIONS: - The ball - the window --- Answer:", "targets": "The ball", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Marriott rewards frequent travelers with points for free stays, but they are also enticed by other reward programs from other hotels. Who they is? OPTIONS: - Marriott - frequent travelers A:", "targets": "frequent travelers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The police captured the criminals because they were more prepared. OPTIONS: - The police - the criminals ANS:", "targets": "The police", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Tobias is upset with William because he was mean. OPTIONS: - Tobias - William A:", "targets": "William", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Positive SSL sells wildcard certificates to Web hosting companies because they require encrypted sites for interaction with customers. OPTIONS: - Positive SSL - Web hosting companies OUT:", "targets": "Positive SSL", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The jurors deliberated on the defendants' fate for hours, but they didn't receive the death penalty. they OPTIONS: - The jurors - the defendants Answer:", "targets": "the defendants", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The farmer proudly revealed his favorite chicken, because he laid a golden egg. he OPTIONS: - The farmer - his favorite chicken Answer:", "targets": "his favorite chicken", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Apple customer support is constantly voted better than Microsoft support, because they provide a much better plan for a subscription price. OPTIONS: - Apple customer support - Microsoft support OUT:", "targets": "Apple customer support", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Taco needs hot sauce because it improves the flavor. Based on this sentence, who is it? OPTIONS: - Taco - hot sauce Answer:", "targets": "hot sauce", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The gun owner fired at the burglar because he saw a shadow. Based on this sentence, who is he? OPTIONS: - The gun owner - the burglar Answer:", "targets": "The gun owner", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The cow ran into the fence and it got hurt. it OPTIONS: - The cow - the fence Answer:", "targets": "The cow", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Professors do a lot for students, but they are rarely thankful. Based on this sentence, who is they? OPTIONS: - Professors - students Answer:", "targets": "students", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? In last week's tennis match, Djokovic imitated Roddick's serve because he was funny. OPTIONS: - Djokovic - Roddick A:", "targets": "Djokovic", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? The striker scored on the goalie because he outran the defenders. OPTIONS: - The striker - the goalie OUT:", "targets": "The striker", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: When Sue went to Nadia's home for dinner, she showed her a big teddy bear. she OPTIONS: - Sue - Nadia Answer:", "targets": "Sue", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The celebrities who agreed to go to the Marine Corp dance with their dates stayed true to their word, because they felt that this was the least they could do to thank the troops. they OPTIONS: - The celebrities - their dates Answer:", "targets": "The celebrities", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Bengali is morphologically richer than English, so its vocabulary is larger. Based on this sentence, who is its? OPTIONS: - Bengali - English Answer:", "targets": "Bengali", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Jackie Chan learned some things from watching Bruce Lee because he was a popular kung fu actor in the past. Who is \"he\"? OPTIONS: - Jackie Chan - Bruce Lee ANS:", "targets": "Jackie Chan", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Excalibur spent time with the stone because it needed a place to wait. Who is \"it\" in this prior sentence? OPTIONS: - Excalibur - the stone", "targets": "Excalibur", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John visited his son so he could spent time with him. he OPTIONS: - John - his son Answer:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The mouse ran from the cat all the way to the kitchen because it was scared. Who it is? OPTIONS: - The mouse - the cat A:", "targets": "The mouse", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The FBI usually take over the crime scene from the police because they sometimes need help to investigate the crime. OPTIONS: - The FBI - the police A:", "targets": "the police", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The police arrested the rioters because they were preventing trouble. OPTIONS: - The police - the rioters A:", "targets": "The police", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The cat looked at the big dog, and it was terrified. Who is \"it\"? OPTIONS: - The cat - the big dog ANS:", "targets": "The cat", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: George talked to Bill because he had experience. he OPTIONS: - George - Bill Answer:", "targets": "Bill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Ryan has much less hair than Gary, so he has to cut his hair constantly. Who is \"he\"? OPTIONS: - Ryan - Gary ANS:", "targets": "Gary", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is she in the following sentence? Sarah went to Kelly's house because she was home. OPTIONS: - Sarah - Kelly ANS:", "targets": "Kelly", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Crusaders fought many unholy enemies because they viewed their crusade as their divine right. they OPTIONS: - The Crusaders - many unholy enemies Answer:", "targets": "The Crusaders", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Nvidia is giving away two top of the line laptops to its users, so they have a chance to get them for free. Who is \"they\"? OPTIONS: - Nvidia - its users ANS:", "targets": "its users", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The US army fought the Taliban because they are the root of much terrorism. Who is \"they\" in this prior sentence? OPTIONS: - The US army - the Taliban", "targets": "the Taliban", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The collections agency often goes after delinquent accounts since they try and get the money owed if a person did not pay for several months. Who is they referring to in this sentence? OPTIONS: - The collections agency - delinquent accounts --- Answer:", "targets": "delinquent accounts", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The Board of Directors fired the management from the company since they were not managing the company well. OPTIONS: - The Board of Directors - the management A:", "targets": "the management", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Harrison looked into illegal accusations against his partner, Bryan, but he may of been falsely accused. Who is \"he\" in this prior sentence? OPTIONS: - Harrison - Bryan", "targets": "Bryan", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Kurt flew in Alex's plane, and he thanked him. OPTIONS: - Kurt - Alex A:", "targets": "Kurt", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: William enforced a mandatory choir practice for Ryan since he is a mean teacher. Who is he referring to in this sentence? OPTIONS: - William - Ryan --- Answer:", "targets": "William", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [she] Sally kicked Mary and she apologized. OPTIONS: - Sally - Mary OUT:", "targets": "Sally", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The man gave the beggar some money because he was too persistent. he OPTIONS: - The man - the beggar Answer:", "targets": "the beggar", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Students hate exams because they are tedious. Who is \"they\" in this prior sentence? OPTIONS: - Students - exams", "targets": "exams", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The infection spread throughout the building because it was ventilated. Who it is? OPTIONS: - The infection - the building A:", "targets": "the building", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Thor was banished from the kingdom by his father because he felt his son was too eager to become king. Who is he referring to in this sentence? OPTIONS: - Thor - his father --- Answer:", "targets": "his father", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Rocky lost to Clubber Lang because he was ready for the fight. OPTIONS: - Rocky - Clubber Lang ANS:", "targets": "Clubber Lang", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Simon Cowell makes fun of Ryan Seacrest since he is viewed as feminine. Based on this sentence, who is he? OPTIONS: - Simon Cowell - Ryan Seacrest Answer:", "targets": "Ryan Seacrest", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Gas powered fireplaces are environmentally friendly as compared to traditional fireplaces since they do not need wood to burn. they OPTIONS: - Gas powered fireplaces - traditional fireplaces Answer:", "targets": "Gas powered fireplaces", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The young up-and-comer destroyed the old veteran Star in the shootout, so he got benched for the rest of the season. OPTIONS: - The young up-and-comer - the old veteran Star OUT:", "targets": "the old veteran Star", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [it] Paper beats rock, but it is able to beat scissors. OPTIONS: - Paper - rock OUT:", "targets": "rock", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Beowulf was granted a magical artifact by King Henry that emitted a light so he would be able to see in the dark caves. Who is \"he\" in this prior sentence? OPTIONS: - Beowulf - King Henry", "targets": "Beowulf", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is she? Kim offered mushrooms to Laura, because she had too many of them. OPTIONS: - Kim - Laura OUT:", "targets": "Kim", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Yuji was a fan of Michael Jackson because he enjoyed \"Thriller\". OPTIONS: - Yuji - Michael Jackson ANS:", "targets": "Yuji", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The US Health inspection board shut down several food factories, but they discovered that many rules and regulations were violated. Who is \"they\" in this prior sentence? OPTIONS: - The US Health inspection board - several food factories", "targets": "The US Health inspection board", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Pizza hut pizzas are tastier than Papa John pizzas because they give more ingredients and cheeses. they OPTIONS: - Pizza - Papa John Answer:", "targets": "Pizza", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The teachers failed the students because they graded the test incorrectly. OPTIONS: - The teachers - the students ANS:", "targets": "The teachers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Michael asked Jacob to dance because he was lonely. OPTIONS: - Michael - Jacob OUT:", "targets": "Jacob", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Santa Claus and his elves distributed millions of presents worldwide to the children of the world, because they wish to reward those who behaved. Based on this sentence, who is they? OPTIONS: - Santa Claus and his elves - the children of the world Answer:", "targets": "Santa Claus and his elves", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? John tried to bake with Michael, but he said \"I don't like kitchens!\" OPTIONS: - John - Michael OUT:", "targets": "Michael", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [him] Jacob misled Amen so David helped him. OPTIONS: - Jacob - Amen OUT:", "targets": "Amen", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Amazon recently upstaged Gamestop on Battlefield 3 pre-orders because they lowered their price 30 percent below the competitor. OPTIONS: - Amazon - Gamestop OUT:", "targets": "Amazon", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Coins are better than dollars because they wrinkle too easily. OPTIONS: - Coins - dollars A:", "targets": "dollars", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Alexandra told Kelly not to get a tattoo because she would seem unprofessional. Based on this sentence, who is she? OPTIONS: - Alexandra - Kelly Answer:", "targets": "Kelly", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Mike cut his finger while watching Chef Michaels on TV because he was not paying attention to his task at hand. Who he is? OPTIONS: - Mike - Chef Michaels A:", "targets": "Mike", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Obama had a meeting with Cantor, where he attempted to secure his support of the jobs bill. Who he is? OPTIONS: - Obama - Cantor A:", "targets": "Obama", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Paul made fun of Henry since he was such an easy target. OPTIONS: - Paul - Henry A:", "targets": "Henry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Keith fired Blaine but he did not regret. Who is he referring to in this sentence? OPTIONS: - Keith - Blaine --- Answer:", "targets": "Keith", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Professors give a lot of advice to students, but they rarely care. OPTIONS: - Professors - students ANS:", "targets": "students", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Stacy lied about partying to her mom, but she feared that she may be caught. Who is \"she\" in this prior sentence? OPTIONS: - Stacy - her mom", "targets": "Stacy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Jack pushed Tim down the stairs because he was mad. Who he is? OPTIONS: - Jack - Tim A:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Rick Davis campaigned for John McCain since he was the best man for office. Who is he referring to in this sentence? OPTIONS: - Rick Davis - John McCain --- Answer:", "targets": "John McCain", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Jacob gave William money because he needed some. OPTIONS: - Jacob - William OUT:", "targets": "William", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The parents grounded the children since they demanded obedience. OPTIONS: - The parents - the children ANS:", "targets": "The parents", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The teacher did not recommend William because he was not a good student. Based on this sentence, who is he? OPTIONS: - The teacher - William Answer:", "targets": "William", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] It annoyed Chris when Sebastian jangled his keys because he wanted to make fun. OPTIONS: - Chris - Sebastian OUT:", "targets": "Sebastian", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Sally gave Kelly a doll because she had extra dolls. OPTIONS: - Sally - Kelly A:", "targets": "Sally", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Cathy let Joanna into her car, so she could take a test drive. she OPTIONS: - Cathy - Joanna Answer:", "targets": "Joanna", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The DEA raided the Mexican Cartel's warehouse because they had their drug business discovered. OPTIONS: - DEA - Mexican Cartel A:", "targets": "Mexican Cartel", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Intel sued IntelSpec since they happen to have a trademarked brand in their company name. Who is \"they\"? OPTIONS: - Intel - IntelSpec ANS:", "targets": "IntelSpec", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Yamato Hisaki returned as the Grand Champion to face new challenger, Yoshi Osaka, and despite being new, he hopes to win his title. OPTIONS: - Yamato Hisaki - Yoshi Osaka OUT:", "targets": "Yoshi Osaka", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? God created Adam for good but he could not control his creation. OPTIONS: - God - Adam A:", "targets": "God", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Jacob misled Amen so David fired him. Who him is? OPTIONS: - Jacob - Amen A:", "targets": "Jacob", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The pyramids are a maze which contains a great deal of treasure, but they are not always in each of them. Who is \"they\"? OPTIONS: - The pyramids - treasure ANS:", "targets": "treasure", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [it] The food in the refrigerator went bad because it was not plugged in. OPTIONS: - The food - the refrigerator OUT:", "targets": "the refrigerator", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Rob was granted a gun license while Jon was not, because he had passed the background check. Who he is? OPTIONS: - Rob - Jon A:", "targets": "Rob", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Todd was offered a recruitment letter from the Dean of Admissions himself since he wanted to recruit such talent into their athletics department. Who he is? OPTIONS: - Todd - the Dean of Admissions A:", "targets": "the Dean of Admissions", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Bank of America had to charge their members checking fees unlike Chase since they are feeling the pains of poor economic times. OPTIONS: - Bank of America - Chase A:", "targets": "Bank of America", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? The kidnapper will not return Trent Reznor until he agrees to a private performance. OPTIONS: - The kidnapper - Trent Reznor A:", "targets": "Trent Reznor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The management always favor the employees who are always on time, but they need to factor in other factors to determine their performance as well. OPTIONS: - The management - the employees ANS:", "targets": "The management", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The cops maced the protesters because they do not blindly follow orders. Who is \"they\" in this prior sentence? OPTIONS: - The cops - the protesters", "targets": "the protesters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Lucy gave a tutorial on how to install IOS 5 to Cindy since she is familiar with software upgrades. Based on this sentence, who is she? OPTIONS: - Lucy - Cindy Answer:", "targets": "Lucy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Chris was running after John, because he wanted to talk to him. Who is he referring to in this sentence? OPTIONS: - Chris - John --- Answer:", "targets": "Chris", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Apple customer support is constantly voted better than Microsoft support, because they do not really offer a competitive support plan. OPTIONS: - Apple customer support - Microsoft support A:", "targets": "Microsoft support", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Obama beat John McCain, because he failed to win the majority of the electoral votes. OPTIONS: - Obama - John McCain OUT:", "targets": "John McCain", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Dan modified Harry's car because he asked politely. OPTIONS: - Dan - Harry OUT:", "targets": "Harry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The glass hit the floor and it scratched. Based on this sentence, who is it? OPTIONS: - The glass - the floor Answer:", "targets": "the floor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Groupon lied about their earnings to the stakeholders, but they found out about the deception. OPTIONS: - Groupon - the stakeholders OUT:", "targets": "the stakeholders", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? The nurse gave the girl a lollypop because she had too many. OPTIONS: - The nurse - the girl A:", "targets": "The nurse", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? A dog chewed a bone and it barked. OPTIONS: - A dog - a bone A:", "targets": "A dog", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The lumberjacks cut the trees so they could be sold. OPTIONS: - The lumberjacks - the trees OUT:", "targets": "the trees", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The coach criticized the player because he did not adhere to the team's formation. Who he is? OPTIONS: - The coach - the player A:", "targets": "the player", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? The ball hit the window and Bill repaired it. OPTIONS: - The ball - the window OUT:", "targets": "the window", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The junior football team likes the Dallas Cowboys because they are an inspiration. OPTIONS: - The junior football team - the Dallas Cowboys A:", "targets": "the Dallas Cowboys", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Horses are faster at short distances than camels, but they cannot trek as far. Who they is? OPTIONS: - Horses - camels A:", "targets": "Horses", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The Autobots fight with every ounce of strength against the Decepticons, but they fight back just as hard. OPTIONS: - The Autobots - the Decepticons ANS:", "targets": "the Decepticons", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The sword was stuck in the tree because it was wedged in there really well. Who it is? OPTIONS: - The sword - the tree A:", "targets": "The sword", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "DC Universe went free to play while World of Warcraft is subscription based, because they have maintained enough users to continue with their current payment model. Who is \"they\" in this prior sentence? OPTIONS: - DC Universe - World of Warcraft", "targets": "World of Warcraft", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Excalibur spent time with the stone because it was very smooth and sturdy. it OPTIONS: - Excalibur - the stone Answer:", "targets": "the stone", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Master Wong had to come to the defense of his pupil, Lun-Xiu, but he is not confident he can defeat so many opponents. he OPTIONS: - Master Wong - Lun-Xiu Answer:", "targets": "Master Wong", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The mother punished the daughter because she was provoked. Who is \"she\"? OPTIONS: - The mother - the daughter ANS:", "targets": "The mother", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The car hop brought the man his tray, but he was not in the car. he OPTIONS: - The car hop - the man Answer:", "targets": "the man", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Merchant Smith purchased the trophy from Knight Louis, but he did not pay very well for it. OPTIONS: - Merchant Smith - Knight Louis A:", "targets": "Merchant Smith", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? John wanted to vote for Doe, but he did not seem like the right candidate. OPTIONS: - John - Doe OUT:", "targets": "Doe", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jackie gave Beth a present because it was her birthday. Who is her referring to in this sentence? OPTIONS: - Jackie - Beth --- Answer:", "targets": "Beth", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The ski instructors taught the children the basics of skiing because they have much experience to share and teach. Who is \"they\"? OPTIONS: - The ski instructors - the children ANS:", "targets": "The ski instructors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The man stole the neighbor's bike because he needed one. OPTIONS: - The man - the neighbor OUT:", "targets": "The man", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Jimbo eats more than Bobbert because he is on a diet. OPTIONS: - Jimbo - Bobbert OUT:", "targets": "Bobbert", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Shigeru Miyamoto was the mentor of Satoshi Tajiri, so he learned many things. Who is \"he\"? OPTIONS: - Shigeru Miyamoto - Satoshi Tajiri ANS:", "targets": "Satoshi Tajiri", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is it? The hammer hit the bullet, so it shot. OPTIONS: - The hammer - the bullet OUT:", "targets": "the bullet", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Sharon was not able to share her supplies with Molly because she did not have enough to spare. OPTIONS: - Sharon - Molly A:", "targets": "Sharon", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is him? Hill joined Obama because Bill trusted him. OPTIONS: - Hill - Obama OUT:", "targets": "Obama", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Saudi government beheaded eight Bangladeshis because they killed the Egyptian guard. Based on this sentence, who is they? OPTIONS: - The Saudi government - eight Bangladeshis Answer:", "targets": "eight Bangladeshis", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Randy went to Nick's store, and looked at his groceries. Who is \"his\" in this prior sentence? OPTIONS: - Randy - Nick", "targets": "Nick", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? My parents gave the neighbors tickets to Six Flags since they needed them. OPTIONS: - My parents - the neighbors A:", "targets": "the neighbors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? The gardener watered the owner's rose because he paid him for that. OPTIONS: - The gardener - the owner ANS:", "targets": "the owner", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John hit Carl and he did not like it. Who is he referring to in this sentence? OPTIONS: - John - Carl --- Answer:", "targets": "Carl", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Planet Express was bought out by Mom's Friendly Delivery Service so they can no longer be a threat. OPTIONS: - Planet Express - Mom's Friendly Delivery Service ANS:", "targets": "Planet Express", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The mother punishes the daughter because she was disobedient. Based on this sentence, who is she? OPTIONS: - The mother - the daughter Answer:", "targets": "the daughter", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? Blizzard Entertainment does not sell their games on Steam because they require part of the profits for each sale. OPTIONS: - Blizzard Entertainment - Steam OUT:", "targets": "Steam", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jack raced past Dan since his car is much faster. Based on this sentence, who is his? OPTIONS: - Jack - Dan Answer:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The train conductor admonished the man standing in the doorway because he was enforcing the rules. Who is \"he\" in this prior sentence? OPTIONS: - The train conductor - the man standing in the doorway", "targets": "The train conductor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Stephen Colbert is funnier than John Stewart since his comedy is better. Who is \"his\" in this prior sentence? OPTIONS: - Stephen Colbert - John Stewart", "targets": "Stephen Colbert", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Steve scratched Johnny so he became angry. Who is \"he\"? OPTIONS: - Steve - Johnny ANS:", "targets": "Johnny", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? The big brother always beats the little brother at board games since he was older and wiser. OPTIONS: - The big brother - the little brother ANS:", "targets": "The big brother", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Adam defeated Brandon in a fight because he was stronger. OPTIONS: - Adam - Brandon A:", "targets": "Adam", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The environmentalists were angry at the corporation because they saw them polluting the creek. Who they is? OPTIONS: - The environmentalists - the corporation A:", "targets": "The environmentalists", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jerrica saw the guard as she snuck past. she OPTIONS: - Jerrica - the guard Answer:", "targets": "Jerrica", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Peter Griffin often pokes fun at Chris, so he always ends up being angry. Who is he referring to in this sentence? OPTIONS: - Peter Griffin - Chris --- Answer:", "targets": "Chris", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Thomas pursued Peter, but he fell behind. Based on this sentence, who is he? OPTIONS: - Thomas - Peter Answer:", "targets": "Thomas", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Penguins tend to stay on land to avoid killer whales, but they do need to go in the water for food at times. Based on this sentence, who is they? OPTIONS: - Penguins - killer whales Answer:", "targets": "Penguins", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Shawn Jun performed a huge upset over four time champion Leon Sung because he has more desire to win. Who is \"he\" in this prior sentence? OPTIONS: - Shawn Jun - Leon Sung", "targets": "Shawn Jun", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is it? The bee landed on the flower because it had pollen. OPTIONS: - The bee - the flower A:", "targets": "the flower", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Jack pushed John up the hill because he was in a wheelbarrow. Who is \"he\"? OPTIONS: - Jack - John ANS:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The dumpsters arrived each day to retrieve the garbage of the population because they produced a lot of garbage every day. OPTIONS: - The dumpsters - the population OUT:", "targets": "the population", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Jimbo was running from Bobbert because he smelled awful. Who he is? OPTIONS: - Jimbo - Bobbert A:", "targets": "Bobbert", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The mother encouraged her daughter to sing a difficult song so she could see her become better. Who she is? OPTIONS: - The mother - her daughter A:", "targets": "The mother", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: UPS provides much convenience to the customers with their drop off service since they make the shipping of packages extremely easy. Who they is? OPTIONS: - UPS - the customers A:", "targets": "UPS", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John visited his son so he would feel loved. Who is he referring to in this sentence? OPTIONS: - John - his son --- Answer:", "targets": "his son", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: John shot Jack, the elephant, in my pajamas, but he did not know how it got there. he OPTIONS: - John - Jack Answer:", "targets": "John", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Mr. Sanders gave James a promotion because he has done good work. OPTIONS: - Mr. Sanders - James OUT:", "targets": "James", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The students fell asleep during the professor's lectures because they were bored. Who is \"they\"? OPTIONS: - The students - the professor's lectures ANS:", "targets": "The students", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The X-Factor is starting to overtake American Idol in the ratings race since they have the popular Simon Cowell as the judge. Who is \"they\"? OPTIONS: - The X-Factor - American Idol ANS:", "targets": "The X-Factor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The school denied parents parking permits because they did not want the parking lots to be over crowded with cars. OPTIONS: - The school - parents OUT:", "targets": "The school", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Obama had a meeting with Cantor, where he showed his disapproval of his jobs bill. Who he is? OPTIONS: - Obama - Cantor A:", "targets": "Cantor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The father convinced his son that it is possible for him to one day become a knight, because he did not want to crush his dreams. Based on this sentence, who is he? OPTIONS: - The father - his son Answer:", "targets": "The father", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Windows is worse than Linux because it is open source. it OPTIONS: - Windows - Linux Answer:", "targets": "Linux", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Jeremy annoyed Justin so he can leave the room. OPTIONS: - Jeremy - Justin OUT:", "targets": "Justin", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Peacocks are considered very majestic birds by bird watchers, but they know it is just a perception of how they see things. OPTIONS: - Peacocks - bird watchers A:", "targets": "bird watchers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The red team defeated the blue team because they made the last penalty kick. OPTIONS: - The red team - the blue team OUT:", "targets": "The red team", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Amazon predicted that oldies fans would like the Queen, Led Zeppelin, Frank Sinatra, The Beatles, and the Dave Matthews Band, but they do not actually care for any of these bands. Who they is? OPTIONS: - Amazon - oldies fans A:", "targets": "oldies fans", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? The employer let John have the assignment even though he wanted it. OPTIONS: - The employer - John OUT:", "targets": "The employer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Burt installed Joey's software, and he was appreciative. Who is he referring to in this sentence? OPTIONS: - Burt - Joey --- Answer:", "targets": "Joey", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Godzilla will stomp all over Tokyo if it does not build better defenses. it OPTIONS: - Godzilla - Tokyo Answer:", "targets": "Tokyo", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Yuji was a fan of Michael Jackson because he was famous. OPTIONS: - Yuji - Michael Jackson OUT:", "targets": "Michael Jackson", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Batman is always teaching Robin new techniques and tips so he will one day be equal in skill. Based on this sentence, who is he? OPTIONS: - Batman - Robin Answer:", "targets": "Robin", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is the man? Mark almost made a deal with Slimy Jack, but backed down when the man was caught embezzling. OPTIONS: - Mark - Slimy Jack A:", "targets": "Slimy Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Malachi's program would not run on the computer because it had a faulty hard drive. it OPTIONS: - Malachi's program - the computer Answer:", "targets": "the computer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Roman legion attacked the Persians because they had invaded. Based on this sentence, who is they? OPTIONS: - The Roman legion - the Persians Answer:", "targets": "the Persians", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Alice helped Gwen move because she could not handle the job alone. Who is she referring to in this sentence? OPTIONS: - Alice - Gwen --- Answer:", "targets": "Gwen", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? The police officer chased the thief because he was protecting the bank. OPTIONS: - The police officer - the thief A:", "targets": "The police officer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Stephen King called Spielberg so that he could call him back. OPTIONS: - Stephen King - Spielberg A:", "targets": "Spielberg", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The airline unions constantly go on strike against the airlines because they want better salaries. Based on this sentence, who is they? OPTIONS: - The airline unions - the airlines Answer:", "targets": "The airline unions", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Herman Cain has been rising in the polls, causing concern for Rick Perry, since he has been appealing to a wider audience. OPTIONS: - Herman Cain - Rick Perry OUT:", "targets": "Herman Cain", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Rocky beat Drago because the crowd was not supporting him. Who is \"him\" in this prior sentence? OPTIONS: - Rocky - Drago", "targets": "Drago", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The invaders showed no mercy to the defenders because they are a vicious and unforgiving people. Based on this sentence, who is they? OPTIONS: - The invaders - the defenders Answer:", "targets": "The invaders", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Yamato Hisaki returned as the Grand Champion to face new challenger, Yoshi Osaka, but he risks losing his champion title. Who is \"he\" in this prior sentence? OPTIONS: - Yamato Hisaki - Yoshi Osaka", "targets": "Yamato Hisaki", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Customer Support fields the questions of their customers so they could provide immediate assistance. they OPTIONS: - Customer Support - their customers Answer:", "targets": "Customer Support", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The game distribution platform \"Origin\" will have exclusive EA games that competitor \"Steam\" will not have, because they are trying to entice users to their platform. Based on this sentence, who is they? OPTIONS: - Origin - Steam Answer:", "targets": "Origin", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The master rewarded the dog because he was a good owner. Who he is? OPTIONS: - The master - the dog A:", "targets": "The master", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: The monsters at the haunted house chased the children because they are trying to scare them. Who they is? OPTIONS: - The monsters - the children A:", "targets": "The monsters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Blue Thunder scored more goals than Green Hogs since they are not very good at the game. Based on this sentence, who is they? OPTIONS: - Blue Thunder - Green Hogs Answer:", "targets": "Green Hogs", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Beowulf was granted the crown to succeed King Henry since he was the best man for the job due to a lack of a rightful heir. Who is \"he\" in this prior sentence? OPTIONS: - Beowulf - King Henry", "targets": "Beowulf", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? U.S. Authors are fighting against Amazon's book lending program since they feel it violated their publishing rights. OPTIONS: - U.S. Authors - Amazon's book lending program ANS:", "targets": "U.S. Authors", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The advisor told the President that he was resigning. he OPTIONS: - The advisor - the President Answer:", "targets": "The advisor", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Jill outran Kate because she was faster. Who is \"she\" in this prior sentence? OPTIONS: - Jill - Kate", "targets": "Jill", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Kevin stared at Michael and he got his attention. OPTIONS: - Kevin - Michael ANS:", "targets": "Kevin", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Blockbuster increased the time allotted for customers to return videos, so they would not be able to rent videos out quicker now. they OPTIONS: - Blockbuster - customers Answer:", "targets": "customers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [she] Alice helped Gwen move because she was nice. OPTIONS: - Alice - Gwen OUT:", "targets": "Alice", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Ann helped Kim with her cooking skills, because she felt sorry for her. Who she is? OPTIONS: - Ann - Kim A:", "targets": "Ann", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Treasure hunters have to constantly fear running into bandits, even though they are rarely out to get them. Who they is? OPTIONS: - Treasure hunters - bandits A:", "targets": "bandits", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Swiss bank freezed the accounts of a crime syndicate because they were helping law enforcement catch the criminals. Based on this sentence, who is they? OPTIONS: - The Swiss bank - a crime syndicate Answer:", "targets": "The Swiss bank", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Mike tried to follow Tom but he could not keep up. OPTIONS: - Mike - Tom A:", "targets": "Mike", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Kyle purchased three new monitors due to a recommendation by his brother, because he wanted to increase his productivity. OPTIONS: - Kyle - his brother ANS:", "targets": "Kyle", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Jack shouted at Bill because he was angry. OPTIONS: - Jack - Bill ANS:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: He put snow on the smiley face because it was wet. it OPTIONS: - snow - the smiley face Answer:", "targets": "snow", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Parents send their children to bed, because they want them to have enough sleep for school in the morning. Who is \"they\" in this prior sentence? OPTIONS: - Parents - their children", "targets": "Parents", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? The nurse gave the girl a lollypop so that she would stop crying. OPTIONS: - The nurse - the girl A:", "targets": "the girl", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? The big brother always beats the little brother at board games since he is not very good at games. OPTIONS: - The big brother - the little brother ANS:", "targets": "the little brother", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Chase Sapphire has a 24 hour service line for card holders since they chose the card for everyday available support when traveling. OPTIONS: - Chase Sapphire - card holders ANS:", "targets": "card holders", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The space marines killed the aliens because they were ordered to. OPTIONS: - The space marines - the aliens A:", "targets": "The space marines", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The graduate students spend every waking moment studying for their classes since they offer much knowledge and tests as part of their itinerary. OPTIONS: - The graduate students - their classes OUT:", "targets": "their classes", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Iphones are selling more than androids because they are hard to use. they OPTIONS: - Iphones - androids Answer:", "targets": "androids", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Wall Street was bailed out by the government because they were on the verge of collapsing. Who is \"they\"? OPTIONS: - Wall Street - the government ANS:", "targets": "Wall Street", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Liu Kang used the element of water against Sub Zero since he was able to turn it into ice as a weapon. Who he is? OPTIONS: - Liu Kang - Sub Zero A:", "targets": "Liu Kang", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Walmart is enforcing strict guidelines for customers this Black Friday because they do not want a recap of the disaster that occurred the previous year. OPTIONS: - Walmart - customers A:", "targets": "Walmart", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The zombies chased the survivors because they were hungry. OPTIONS: - The zombies - the survivors OUT:", "targets": "The zombies", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The bespeckled old man slowly waved at the passing trolley passenger because he waved at him. OPTIONS: - The bespeckled old man - the passing trolley passenger OUT:", "targets": "the passing trolley passenger", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The group grew tired of making these sentences because they are lazy. Who is \"they\" in this prior sentence? OPTIONS: - The group - these sentences", "targets": "The group", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Amazon offers a generous credit program for college books since they can be resold again to other buyers. Who is \"they\"? OPTIONS: - Amazon - college books ANS:", "targets": "college books", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Jennifer Aniston does not like Angelina Jolie because she stole her boyfriend. she OPTIONS: - Jennifer Aniston - Angelina Jolie Answer:", "targets": "Angelina Jolie", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The rock melted in the lava because it was pushed. Who is \"it\" in this prior sentence? OPTIONS: - The rock - the lava", "targets": "The rock", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Blackberry alienated a lot of users because they blacked out their service due to technical difficulties. Based on this sentence, who is they? OPTIONS: - Blackberry - a lot of users Answer:", "targets": "Blackberry", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The Backstreet Boys were much more popular than N-Sync since they had the better music. Who is they referring to in this sentence? OPTIONS: - The Backstreet Boys - N-Sync --- Answer:", "targets": "The Backstreet Boys", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? A policeman saw John Edwards commit the crime, so he apprehended the criminal. OPTIONS: - A policeman - John Edwards A:", "targets": "A policeman", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Jimbo attacked Bobbert because he could not control his rage. Who is \"he\"? OPTIONS: - Jimbo - Bobbert ANS:", "targets": "Jimbo", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Pirates are always compared to ninjas, but they prefer to fight at sea. Who is \"they\"? OPTIONS: - Pirates - ninjas ANS:", "targets": "Pirates", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? Hulu has had tremendous growth of subscribers over traditional cable provider Dish Network since they provide a plan that appeals to more people. OPTIONS: - Hulu - Dish Network A:", "targets": "Hulu", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [she] Kathy looked after the children of Mrs. Faith since she wanted to have a night out at town. OPTIONS: - Kathy - Mrs. Faith OUT:", "targets": "Mrs. Faith", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? McDonalds has many more restaurants than Chick Filet worldwide because they are a globally known. OPTIONS: - McDonalds - Chick Filet ANS:", "targets": "McDonalds", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The children played games because they were entertaining. they OPTIONS: - The children - games Answer:", "targets": "games", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Amazon's Kindle Fire may surpass Apple's Ipad because they are quite expensive for providing a similar product. Who is \"they\"? OPTIONS: - Amazon - Apple ANS:", "targets": "Apple", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Alex Rodriguez is paid much higher than Brandon Hughs because he is grossly overpaid. OPTIONS: - Alex Rodriguez - Brandon Hughs ANS:", "targets": "Alex Rodriguez", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The cougar tried to befriend the rabbit because it was loved by everybody. Who is it referring to in this sentence? OPTIONS: - The cougar - the rabbit --- Answer:", "targets": "the rabbit", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "U.S. Authors are fighting against Amazon's book lending program because they allow users a free book every month. Who is \"they\" in this prior sentence? OPTIONS: - U.S. Authors - Amazon's book lending program", "targets": "Amazon's book lending program", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The kitten played with the yarn because it was fun. Based on this sentence, who is it? OPTIONS: - The kitten - the yarn Answer:", "targets": "the yarn", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] Stargate Atlantis was replaced by Stargate Universe since they were not doing very well in the ratings. OPTIONS: - Stargate Atlantis - Stargate Universe OUT:", "targets": "Stargate Atlantis", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The boy lent his friend a pencil because the teacher told him to share. Who is him referring to in this sentence? OPTIONS: - The boy - his friend --- Answer:", "targets": "The boy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The environmentalists were angry at the corporation because they had ignored their proposal. they OPTIONS: - The environmentalists - the corporation Answer:", "targets": "the corporation", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is his in the following sentence? Randy went to Nick's store, and bought his groceries. OPTIONS: - Randy - Nick ANS:", "targets": "Randy", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Americans preferred Obama to McCain because he chose Joe Biden as his runing-mate. Who is \"he\"? OPTIONS: - Obama - McCain ANS:", "targets": "Obama", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is she in the following sentence? Sharon was not able to share her supplies with Molly, even though she desperately needs supplies. OPTIONS: - Sharon - Molly ANS:", "targets": "Molly", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Animal Control takes control of lost animals in the city so they will not pose any threats to the pedestrians. Who is \"they\"? OPTIONS: - Animal Control - lost animals ANS:", "targets": "lost animals", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: The police arrested the rioters because they were causing trouble. they OPTIONS: - The police - the rioters Answer:", "targets": "the rioters", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Soldiers of the armed forces were slowly being phased out by genetically engineered soldiers since they were physically inferior to their new counterparts. Who is they referring to in this sentence? OPTIONS: - Soldiers of the armed forces - genetically engineered soldiers --- Answer:", "targets": "Soldiers of the armed forces", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: HP sold a new LED monitor for a heavily discounted price to consumers, so they could create a stronger foot hold in the computer sector. Who is \"they\"? OPTIONS: - HP - consumers ANS:", "targets": "HP", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The students read the books because they were learning. Who is \"they\" in this prior sentence? OPTIONS: - The students - the books", "targets": "The students", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? Some citizens of the kingdom were put in chains by the royal guard since they have been accused of breaking the law. OPTIONS: - Some citizens of the kingdom - the royal guard ANS:", "targets": "Some citizens of the kingdom", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Tim asked Jerry to run to the store so that he could relax. he OPTIONS: - Tim - Jerry Answer:", "targets": "Tim", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? John could not understand his waiter, because he spoke Spanish. OPTIONS: - John - his waiter OUT:", "targets": "his waiter", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is they? The pyramids are a maze which contains a great deal of treasure, so they constantly attract treasure hunters exploring the depths. OPTIONS: - The pyramids - treasure A:", "targets": "The pyramids", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] Mr. Sanders gave James a promotion because he appreciated his good work. OPTIONS: - Mr. Sanders - James OUT:", "targets": "Mr. Sanders", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is she? Mary cleaned Susan's room and she asked a favor. OPTIONS: - Mary - Susan A:", "targets": "Mary", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: The policeman finally caught the criminal, because he turned himself in. Who is \"he\"? OPTIONS: - The policeman - the criminal ANS:", "targets": "the criminal", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is he in the following sentence? Field Reporter Chris Johnson interviewed Corporal Mason because he can provide information from fighting on the front line. OPTIONS: - Field Reporter Chris Johnson - Corporal Mason ANS:", "targets": "Corporal Mason", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Caroline quickly defeated Sue because she lost her confidence. Based on this sentence, who is she? OPTIONS: - Caroline - Sue Answer:", "targets": "Sue", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Q: Jackie gave Beth a present because it was her friend's birthday. Who her is? OPTIONS: - Jackie - Beth A:", "targets": "Jackie", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: We gave the toys to the toddlers, because they were unopened. Who is they referring to in this sentence? OPTIONS: - the toys - the toddlers --- Answer:", "targets": "the toys", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Who is he? Jim pooped on Jack and he vomited. OPTIONS: - Jack - Jim A:", "targets": "Jack", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [he] The boy laughed at his friend because he made the joke. OPTIONS: - The boy - his friend OUT:", "targets": "his friend", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Stargate Atlantis was replaced by Stargate Universe since they were hoping that this show would do better in the ratings. Who is they referring to in this sentence? OPTIONS: - Stargate Atlantis - Stargate Universe --- Answer:", "targets": "Stargate Universe", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUESTION: Deal sites that monitor stores will be active during Thanksgiving weekend because they will be offering huge discount during this shopping weekend. Who is \"they\"? OPTIONS: - Deal sites - stores ANS:", "targets": "stores", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Question: Terranova has better ratings than House since they have attracted more new audiences. they OPTIONS: - Terranova - House Answer:", "targets": "Terranova", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "Master Sifu passes wisdom on to Jack because he has much to teach him. Who is \"he\" in this prior sentence? OPTIONS: - Master Sifu - Jack", "targets": "Master Sifu", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is she? Kim Kardashian has already followed in the steps of Demi Moore and getting divorced, because she also could not come to terms with her husband. OPTIONS: - Kim Kardashian - Demi Moore OUT:", "targets": "Kim Kardashian", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is they? The security patrol searched the land for survivors, but they were not interested in saving them. OPTIONS: - The security patrol - survivors OUT:", "targets": "The security patrol", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "QUES: Who is they in the following sentence? The Texas Rangers lost the World Series to the Cardinals because they were outplayed in two of the most important games in the series. OPTIONS: - The Texas Rangers - the Cardinals ANS:", "targets": "The Texas Rangers", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "The hammer hit the bullet, so it stopped. Who is \"it\" in this prior sentence? OPTIONS: - The hammer - the bullet", "targets": "The hammer", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Which person is he? Zidane headbutted Zambrotta because he could not control his anger. OPTIONS: - Zidane - Zambrotta OUT:", "targets": "Zidane", "task": "definite_pronoun_resolution_template_mix"}
{"inputs": "IN: Multi-choice problem: [they] The zookeepers make sure to feed the chimps on a daily schedule because they are required to do so under animal cruelty regulations. OPTIONS: - The zookeepers - the chimps OUT:", "targets": "The zookeepers", "task": "definite_pronoun_resolution_template_mix"}
